[
  {
    "companyName": "Aakarshan International",
    "logo": "https://merojob.com/media/cache/01/0e/010e017f07ac3d07e7acac714da39658.jpg",
    "industry": "Manpower Recruitment",
    "about": "Aakarshan International Pvt. Ltd, (an Ethical & Responsible Recruitment Organization) is a leading sourcing and recruiting organization, having more than 18 years of expertise in this field and sprinting with the international standard under compliance of the legislation of ISO 9001:2015, seeking sincere, hardworking and creative candidates for following positions.\n\nAakarshan is committed for ethical and responsible hiring . With the 18 years of wonderful legacy in the recruitment field. We believe on mapping the customers journey undergo with the customer culture for work. We are providing manpower from Nepal to the Responsible Business Alliance (RBA) complaince member Employers in Malaysia \n\nFor more information you can also log on to www.aakarshannepal.org\n\n\n''An Ethical & Responsible Recruitment Organization''"
  },
  {
    "companyName": "ABC Consulting",
    "logo": "https://merojob.com/media/cache/0a/f7/0af75ff6ff2ba30716aa0da548d90e1d.jpg",
    "industry": "Research Firms",
    "about": "Consulting firm for Information Technology."
  },
  {
    "companyName": "Accuro Advisors",
    "logo": "https://merojob.com/media/cache/22/f4/22f4948ab20d572cd79073047b392690.jpg",
    "industry": "Other",
    "about": "Accuro Advisors is a business and investment advisory firm based in Kathmandu, where we combine our knowledge, experience and expertise to offer professional advice and execute investment decisions and help the clients turn their visions to reality. Clients have their own unique opinion on what makes life great, so we take the burden of financial management off our clients so they can enjoy life as they wish to! We offer our clients a peace of mind, and peace of mind occurs when one has a clear plan and control over their financial goals.\n\n\n \n\nWe strive to help our clients feel empowered and achieve peace of mind with regards to their financial position through professional relationships based on uncompromising integrity, trust, passion and personalized service. We accomplish this mission by offering holistic, comprehensive advisory and investment management services to help clients’ priorities and attain their goals in life."
  },
  {
    "companyName": "Agappe Diagnostics Switzerland GmbH",
    "logo": "https://merojob.com/media/cache/51/9d/519db2b017bb0b1998440248d706751f.jpg",
    "industry": "Multinational Companies",
    "about": "Agappe is committed towards the welfare of mankind by providing customers with superior quality In-Vitro Diagnostic (IVD) products and services. With a well-developed in-house R&D centre, Agappe is focused on the research and manufacturing of IVD Reagents and Equipment to meet the needs of every laboratory."
  },
  {
    "companyName": "Alfa Beta Institute",
    "logo": "https://merojob.com/media/cache/9d/bb/9dbb9ace3ad93e192dcef73a8f298a9c.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Alfa Beta has gloriously completed 30 years in the field of International Education Consulting and is proudly representing more than 300 institutions from over 18 countries. Since its establishment, the organization has been dedicated to helping students make the right choice of their education and future careers globally. \n\nAs a member of the AIRC and Prometric authorized Service Provider, we follow a very strict guideline of operations and have developed our working procedures accordingly. In these years we have grown to ten centers across the country and an onshore center in Sydney Australia. We are today the largest study abroad and test preparation center in Nepal touching and changing the lives of over ten thousand students annually.\n\nAwarded with “Nepal’s No.1 Business Partner” for 2017, 2018 and again in 2019 by IDP IELTS we have also been trusted by global organizations such as Pearson and ETS who have authorized us to run their test centers at our premises. \n\nWe believe that there is a tremendous potential in every individual and all that is needed to tap this potential is to give the individual the space to grow and explore."
  },
  {
    "companyName": "Aloi",
    "logo": "https://merojob.com/media/cache/70/01/7001afeabae3569ac05e801333b7f558.jpg",
    "industry": "Software Companies",
    "about": "Aloi Private Limited is a technology company that builds software for micro-finance. For more information, please visit www.aloi.global. We are seeking a Marketing & Brand Strategist."
  },
  {
    "companyName": "AlphaBetaTheta Technologies",
    "logo": "https://merojob.com/media/cache/ac/e5/ace5efc05a9a3104d2145726a4557ca1.png",
    "industry": "Software Companies",
    "about": "Alpha Beta Theta Technologies is an IT services and consulting business. Our purpose is to support our clients to achieve better solutions and outcomes. We are committed to making our clients’ work simpler by providing a wide range of specialized services like web development, software development and IT consulting."
  },
  {
    "companyName": "Annapurna Aroma Company",
    "logo": "https://merojob.com/media/cache/7f/a3/7fa332f915127e269184557256df0828.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "Annapurna Aroma Company Pvt. Ltd. is an agriculture company mainly established with the aim of answering a question how valuable natural resources of our country can be optimally utilized, which is well known for its own abundant natural resources, and strengthening the rural population by improving their social and economic status. Annapurna Aroma has been majorly engaged in cultivation and contract farming, distilling and processing of aromatic plants from various region of Nepal.\n\nAnnapurna Aroma is a culmination of extensive research into the aromatic plants from Nepal and the desire to promote exploration of the bountiful medicinal and therapeutic resources potential of the Himalayan range. In addition, we are also involved in the development of agro-technology for advanced scientific cultivation of medicinal and aromatic plants that are of commercial importance to the local farmers.\n\nCurrently, we are selling different types of natural and pure essential oils of the finest quality which are scientifically tested. Besides selling the pure oil we have our own blends which are produced after a rigorous research. We have also been able to increase sufficient product lines within a very short timeframe with significant increase in distillation units."
  },
  {
    "companyName": "Aqore Software",
    "logo": "https://merojob.com/media/cache/e9/41/e941fcf1d5ad45e0da10119d816da1bc.jpg",
    "industry": "Software Companies",
    "about": "Aqore is a company founded by 2 successful software entrepreneurs with a proven record of building an international product used by thousands of users in the US and Canada. \nCompany is in process of procuring resources to build yet another product targeted for international market. \nWith a work hard/play hard motto we expect employees to grow with the company. Selected group of individuals will be working in multiple small agile startup teams.\n\nRun and managed by people with cumulative 50 years of industry and technical experience.\nCollaborative expertise in enterprise level product delivery, migration and security solutions\nOffer best solutions to clients to support their industry goals.\n\nEmployee Benefits:\n\nCompetitive Salary\nMedical Insurance\nLunch Allowance\nTeam Building events\nSports events\nCIT Option\nFlexible work environment\nVarious Skill Development Training\n\nWork Culture:\n\nYoung and dynamic work culture\nWork hard, play hard\nRight person for the right job\nGrow with us\nPassionate, committed and creative culture"
  },
  {
    "companyName": "Arya Pharma",
    "logo": "https://merojob.com/media/cache/ff/17/ff17e2679ebe8cdfdcb317d31f3d1c44.jpg",
    "industry": "Pharmaceuticals / Healthcare",
    "about": "Arya Pharma Lab Pvt. Ltd is one of the fast growing and leading pharmaceuticals companies in Nepal since 1994. We are manufacturing human pharmaceuticals and animal health products driven by proficient marketing team, state of the art manufacturing facilities and visionary leadership."
  },
  {
    "companyName": "Autism Care Chitwan Society",
    "logo": "https://merojob.com/media/cache/8b/b8/8bb801df14406024c0c4fb02715fa695.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Autism Care Chitwan Society (ACCS) is a non-governmental, non-profit making organization established by group of dedicated parents of children with Autism. ACCS since its inception has been actively working for awareness, the rights and capacity building of child/persons with autism. ACCS has working experience with several INGOs like Abilis Foundation, Handicap International together with the Autism Care Nepal Society. Besides in the short period it has gained its credibility from the Organization of Persons with Disabilities (OPD) and government stakeholders from the district. Besides this Autism Care Chitwan Society had worked on inclusive education project particularly with student with disability, in additional ACCS worked in emergency period (Covid response project)."
  },
  {
    "companyName": "Babylon National School",
    "logo": "https://merojob.com/media/cache/69/3d/693df9c36938da89891892d6967cfb80.jpg",
    "industry": "Education - School & Colleges",
    "about": "Babylon National School is a co-ed English medium school from PG to +2 levels in management stream. The school was established in the year 1996 with the purpose of enhancing holistic development of students in a genial environment through innovative methodology. The pedagogy itself focuses on our learner's heuristic learning.The school is located in Shantinagar, New Baneshwor, Kathmandu, Nepal. It has 750 plus students at present academic year 2017. The school aims to enhance all round development of students in an amiable educational environment through inventive methodologies. It offers activities and programs that help harmonious development of personality in loving and caring environment"
  },
  {
    "companyName": "Bajgai & Associates",
    "logo": "https://merojob.com/media/cache/98/0b/980b8d5151abcbf1783455c09daa1f18.jpg",
    "industry": "Audit Firms / Tax Consultant",
    "about": "Bajgai Associates is Chartered Accountants firm offering Audit, Assurance, Accounting Business Advisories, Tax Consulting, Risk Advisories, Merger Acquisition and Initial Public Offering Services. Bajgai Associates is widely proclaimed for its services towards both domestic and international clients In our practice, we consider value addition to clients to be the driving factor for continuous growth We comprise a team of worthy practitioners of accounting, business supports, advisory, taxation and consulting who are well versed with industries, laws practices prevailing in the country."
  },
  {
    "companyName": "Bajra Energy Ventures",
    "logo": "https://merojob.com/media/cache/64/dd/64dd1fc44dbf9ec15811119e5b49e9ee.jpg",
    "industry": "Hydropower / Alternate Energy",
    "about": "Bajra Energy Ventures Pvt. Ltd. is a 24.80 MW hydropower project. The project site lies northeast of Pokhara valley. The main access to the site is available from Pokhara city through a 6 km long two-lane pitch road. The company has acquired Generation Licence and is currently waiting for PPA."
  },
  {
    "companyName": "Begnas Lake Resorts and Villa",
    "logo": "https://merojob.com/media/cache/a2/53/a253c5e224987e252ba4b625553bfa16.jpg",
    "industry": "Hotels / Resorts / Restaurant",
    "about": "Begnas Lake Resort & Villas is located 12 Km East of bustling Pokhara town lies this wondrous paradise – the Begnas lake known for its clear spring-fed water and lushly vegetated surroundings – just the setting for your long-deserved escape to another world! The resort is situated on the southern bank of the lake with every guestroom affording spectacular mountain views"
  },
  {
    "companyName": "Best's Montessori Chain of Schools & Training Centre",
    "logo": "https://merojob.com/media/cache/cc/bf/ccbf3fc6fbdaeab37b778ea252ef73f9.jpg",
    "industry": "Education - School & Colleges",
    "about": "Baishali Education SystemTechnology (P) Ltd, (BEST) was founded in the year 2005. Under Best's Montessori Chain of schools, we have six Montessori preschools) located at Kuleshwor-Ph 4031691, Dhumbarahi-Chabhil-Ph.4430860 Samakhusi-Ph.4389192, Sinchahiti (Patan)-Ph.5003539, Mandikhatar (4377784). Best's Montessori Elementary school (class 1 to 10 ) at Lazimpat (Ph.4001814), Best's Montessori International School (Clas 1 to 5) at Kuleshwor Ph. 4031691. Renowned Montessori Training Centre-Ph.4430814 running different training successfully since 14 years at Putalisadak, Kathmandu.(Currently in Kuleshwor Phone:4031691).\n\nInformation center:9866247932/9866247933"
  },
  {
    "companyName": "Bhoklagyo Food Delivery Service",
    "logo": "https://merojob.com/media/cache/d0/8d/d08d5b25c8c19f4d0f242c11f1826302.jpg",
    "industry": "Food Production",
    "about": "Bhoklagyo Food delivery service is the first cloud kitchen in Nepal .It operates from 4:00pm - 4:00pm . It aims to provide food hot delicious food  for people or workers during the midnight hours.\n\nIt is a production facility , where food is prepared, packaged and delivered to the respected customers."
  },
  {
    "companyName": "Big Mart",
    "logo": "https://merojob.com/media/cache/c8/5e/c85eae7198c52beefc51f6adb0e65937.jpg",
    "industry": "Retail / Shops",
    "about": "BIG MART is a chain of supermarkets operating in various parts of Kathmandu, Lalitpur and Bhaktapur. With some explosive growth targets, Big mart is in constant lookout to expand its ever growing team of professionals. We are currently looking for exceptional people who are willing to take on responsibility and play an active role in our success as we continue to grow."
  },
  {
    "companyName": "Biomed International",
    "logo": "https://merojob.com/media/cache/24/3f/243f4567df4c2bc6cbe94f1b01586cc0.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "Established in 1998, as an extension of the existing healthcare business since last six decades, we are importer & distributor of all dental products also involved in designing, developing, planning and upgrading treatment centers/clinics, and dental hospitals. Today we are privileged to be known as one of the leading distributors in Nepal with more than hundred reputed companies and more than 10,000 variety of products dental products in our portfolio."
  },
  {
    "companyName": "Bitskraft",
    "logo": "https://merojob.com/media/cache/f9/96/f996f42f4c49dabf186bb1c7ff1bc138.jpg",
    "industry": "Information / Computer / Technology",
    "about": "BitsKraft is a global provider of software-based innovation engineering services using disruptive technologies such as Machine Learning & AI, Big Data, the Cloud, the Internet of Things (IoT), Blockchain and Serverless Computing. With experts in Java, Python, JavaScript frameworks, Microservices and containers such as Docker and Kubernetes. Bitskraft has mastered the tools and process needed to successfully implement disruptive technologies. BitsKraft serves companies in Financial Services, Healthcare, Retail, Media, Recruitment and Technology industries."
  },
  {
    "companyName": "Bitwelt Software",
    "logo": "https://merojob.com/media/cache/58/85/5885239404b5138aeda992c91287a106.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Bitwelt develops productivity apps for modern teams."
  },
  {
    "companyName": "Bluedice Digital Marketing Agency",
    "logo": "https://merojob.com/media/cache/4c/60/4c6060d1788337b7b626cc9a63a16d3e.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Bluedice Digital is a tech-enabled digital marketing solutions provider, and we create custom strategies for each of our clients based on their business goals.\n\nOur team is made up of expert marketers, designers, and developers, and we know what it takes to get real and maximum results. We also keep the focus on the metrics that mean the most, like leads and revenue generated. We are more concerned on getting quality result which helps to grow the business forward and we believe that out clients’ success is the best measure of our performance"
  },
  {
    "companyName": "BookingWhizz",
    "logo": "https://merojob.com/media/cache/d2/2b/d22b703a307f84cd27b925297e483cf8.jpg",
    "industry": "Software Companies",
    "about": "BookingWhizz is a booking technology as as well as travel and tour concern  focused exclusively on the hotel industry and online marketing.\n\n The company, with headquarters in London, was established in 2009 from a vision to help hoteliers take control over the booking process and turn their websites into the main and most powerful sales tool. Our hand-picked team, with extensive management experience and skills in the hospitality sector, has been working on this idea since then."
  },
  {
    "companyName": "Burger Group",
    "logo": "https://merojob.com/media/cache/8b/29/8b29fb0398af740d6e1666ab064139db.jpg",
    "industry": "Hotels / Resorts / Restaurant",
    "about": "The Burger House & Crunchy Fried Chicken is the largest restaurant chain established in Nepal with the spirit to provide quick food services with proper hospitality for greater customer satisfaction. The Burger House & Crunchy Fried Chicken has more than 100+ outlets currently operating at various places of Nepal."
  },
  {
    "companyName": "CAMCE-SDLQ JV",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Construction / Real Estate",
    "about": "CAMCE-SDLQ JV is an international engineering construction company."
  },
  {
    "companyName": "Cedar Gate Services",
    "logo": "https://merojob.com/media/cache/50/a9/50a96bd1243ac67e22f694608fc305c7.jpg",
    "industry": "Software Companies",
    "about": "Cedar Gate Services Pvt. Ltd (Formerly Deerwalk Services Pvt. Ltd)  is a leading software company in Kathmandu, Nepal, providing software development, software testing, data analytics, IT infrastructure and business process support services to its parent company in the United States. For more information,\nvisit: https://cedargate.com/"
  },
  {
    "companyName": "China Communication Construction Company",
    "logo": "https://merojob.com/media/cache/2f/ee/2fee3092aeb1c4b77aa6e56e04607df1.jpg",
    "industry": "Construction / Real Estate",
    "about": "CHINA COMMUNICATIONS CONSTRUCTION COMPANY LIMITED (“CCCC” or the “Company”), initiated and founded by China Communications Construction Group (“CCCG”), was incorporated on 8 October 2006. The Company (including all of its subsidiaries except where the content otherwise requires) is the ﬁrst large state-owned transportation infrastructure group entering the overseas capital market.\n\nThe Company and its subsidiaries (collectively, the “Group”) are principally engaged in the design and construction of transportation infrastructure, dredging and heavy machinery manufacturing business. It covers the following business aspects: port, terminal, road, bridge, railway, tunnel, civil work design and construction, capital dredging and reclamation dredging, container crane, heavy marine machinery, large steel structure and road machinery manufacturing, and international project contracting, import and export trading services. It is the largest port construction and design company in China, a leading company in road and bridge construction and design, a leading railway construction company, the largest dredging company in China and the second largest dredging company (in terms of dredging capacity) in the world. The Company is also the world’s largest container crane manufacturer.\n\nCCCC, Nepal branch would be responsible for the construction of Mugling-Pokhara Highway Improvement Phase. The  objective  of the  project  is  to  widen  and  upgrade  the  road from  existing  double  lane  to  four  lane  bituminous  paved  standard to cater to increased traffic  load and provide smooth, easy and quick access eliminating existing traffic congestion and reduction in roadway accidents. The whole section of the road is rapidly being developed as urban area and forms the only major gateways to Pokhara, famous tourist center in Western Development Region."
  },
  {
    "companyName": "Chokgyur Lingpa Foundation",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "NGO / INGO / Development Projects",
    "about": "No overview found."
  },
  {
    "companyName": "Clinic One",
    "logo": "https://merojob.com/media/cache/31/c5/31c56e27c8aa4f90e4f5e90a40231364.jpg",
    "industry": "Hospital / Clinic / Diagnostic Centre",
    "about": "Clinic One– a multi-specialty preventative healthcare clinic - is seeking a Front Desk Administrator to optimize and lead its group of clinical care providers. This individual will collaborate with the Clinic One management team to define, optimize, and enforce existing processes to consistently deliver high-quality service to our patients.\n\n\nWe are Kathmandu’s leading preventative clinic committed to providing the highest quality patient care. We diagnose and treat patients of all ages, while emphasizing preventive medicine (vaccinations) and overall patient health and wellness. \n\n\nWe provide the following services: \n\nVaccinations \nImaging Tests(ECG, ECHO, X-Ray, Ultrasound)\nDoctor Consultation.\nMental Health consultation\nRegular Health Check-Ups [Whole Body Checkup].\nPharmacy services with home delivery\n\nClinic at Home\n\nHealth Care Training"
  },
  {
    "companyName": "C.L.K. & Associates",
    "logo": "https://merojob.com/media/cache/b3/08/b3087054020312abc15a745c1d177405.jpg",
    "industry": "Audit Firms / Tax Consultant",
    "about": "C.L.K. & Associates, Chartered Accountants is a partnership firm managed by experienced and leading Chartered Accountants providing broad range of professional services to corporates, governments, non- profit organizations and individuals. These services include Auditing & Assurance, Tax Advisory, Business Support Service, Risk Management, management consulting service and Human Resource Development and other related services."
  },
  {
    "companyName": "ContentioLab",
    "logo": "https://merojob.com/media/cache/51/c6/51c63e806517c467fde7d09dd60df016.jpg",
    "industry": "Information / Computer / Technology",
    "about": "We are a research-oriented company that specializes in writing services like content writing, ghostwriting, and technical writing. Contentio Lab is the best in the market offering high-quality services by experienced writers, experts, and professionals."
  },
  {
    "companyName": "Content Scout",
    "logo": "https://merojob.com/media/cache/3d/a6/3da6edec731247c33c04216cf8e30a61.jpg",
    "industry": "Software Companies",
    "about": "Content Scout Pvt. Ltd. is an established software development company delivering software development services of any complexity to clients worldwide."
  },
  {
    "companyName": "COPENNED",
    "logo": "https://merojob.com/media/cache/47/81/478101e24ab8adfbadb2e652818f927f.jpg",
    "industry": "Information / Computer / Technology",
    "about": "We are a group of young, enthusiastic, motivated, and innovative people working together. In our quest of providing the best engineering solutions, we are constantly on the lookout for fresh engineers looking forward to an exciting opportunity. If you would like to work with us feel free to reach to our Human Resource and/or Public Relations Department."
  },
  {
    "companyName": "CREASION",
    "logo": "https://merojob.com/media/cache/80/a1/80a143c62a5d2a657ee6ca0b518cb4f3.png",
    "industry": "NGO / INGO / Development Projects",
    "about": "Center for Research and Sustainable Development Nepal (CREASION) is a not-for-profit, non-governmental organization established in 2005 AD. Since its initiation, it has been actively working in the sectors of disaster, environment, youth, children and women through different projects. \n\n\nThe foundation of CREASION is primarily based on compassion and sustainability and its projects focus on maintaining the values of transparency, accountability and humility. It applies a solution-oriented approach towards development and has initiated multiple innovative projects in alignment to its major working sectors. \n\n\n\n\n\nTo know about our projects: https://creasion.org/"
  },
  {
    "companyName": "Cynical Technology",
    "logo": "https://merojob.com/media/cache/e4/2f/e42f8323ca5db2c66983d3c8a0016be2.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Cynical Technology is a cyber-security startup company with skillful expertise in application penetration, network penetration, security auditing and compliance that focuses on solving issues of concern to management in regards to cybersecurity. The firm serves as digital risk adviser to businesses,  governments, and institution around the country."
  },
  {
    "companyName": "Dalit JanKalyan Yuba Club Lahan",
    "logo": "https://merojob.com/media/cache/56/47/56476ee7416fca52b576d89e176d2cdf.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Dalit Jan–Kalyan Youth Club (DJKYC) is a social development organization established in Lahan Municipality Ward No.-10 Gudigaw, formed by dalits which has been continuously implementing Dalit Empowerment campaigns after getting its legally registration in 2000 in activeness of dalit youths, DJKYC, organizing Right-based campaign programs like grouping meeting, discussion, workshop, interaction, training, opposition, slogan, rally and unviewed for social justice along public advocacy on Dalits collective issues eg. Caste-based discrimination and untouchables, mainly issues of rights and rights related to Human Rights with Dalits, poor, Women and children has been promoting through ever circulating result oriented campaign of them. In that's way, it has been circulating awareness campaign, empowerment campaign and income generating. Dalit Jan kalyan Youth club has targeted transformation of current conflict of country in peace, conflict victim women, men and children for awareness generating campaign, skill Development training for income generating, organizing for peace through group formation and mobilization and micro-finance program. It has been affiliated in SWC (social weffare council) at 2001 and in Eastern Region Dalit NGO federation (DNF) at 2003."
  },
  {
    "companyName": "Danfe Works Enterprises Nepal",
    "logo": "https://merojob.com/media/cache/b1/a1/b1a1b4ba73fc5e804f18c70efa76b946.jpg",
    "industry": "Retail / Shops",
    "about": "“Danfe Works Enterprises Nepal” is a social enterprise that focuses on providing On-the-job training and employment opportunity to marginalized population of Nepal to come up with quality Nepal made products. At Danfe Works, our vision is to maximize the use of local raw materials, using indigenous knowledge and skills of local artisans from marginalized rural population of Nepal to come up with designer “Made in Nepal” clothing Brands and accessories."
  },
  {
    "companyName": "Daraz",
    "logo": "https://merojob.com/media/cache/ea/e8/eae85182b1b44978e931f9f2943f2986.jpg",
    "industry": "E-Commerce/ E-Business",
    "about": "Launched in 2012, Daraz is South Asia's online shopping and selling destination of choice – present in Pakistan, Bangladesh, Sri Lanka, Myanmar and Nepal. Supported by a wide range of tailored marketing, data, and service solutions, the pioneering e-commerce ecosystem in South Asia has 30,000 sellers and 500 brands, serving 5 million consumers. With 2 million products available, Daraz offers a diverse assortment of products in categories ranging from consumer electronics to household goods, beauty, fashion, sports equipment, and groceries. Focused on providing an excellent customer experience, it offers multiple payment methods including cash-on-delivery, comprehensive customer care and hassle- free returns. Daraz is owned by Alibaba Group Holding Limited.\n\n At Daraz, we believe in chasing hard towards big goals."
  },
  {
    "companyName": "Deloitte India",
    "logo": "https://merojob.com/media/cache/75/82/7582c3e957dc9aba5962fbc3100dde00.jpg",
    "industry": "Consulting / Legal",
    "about": "Deloitte is one of the world’s largest and most diversified professional services organizations, providing assurance & advisory, tax, management consulting, and enterprise risk management services through more than 345,000 professionals in more than 150 countries. Our organization includes a unique portfolio of competencies integrated in one industry-leading organization. Deloitte Touche Tohmatsu India LLP (DTTI LLP) is a member firm in India that provides non-audit consulting services. Our experienced professionals deliver seamless, consistent services wherever our clients operate. The figure alongside highlights our global experience.\n\n\nDeloitte India offers a wide gamut of consultancy services and provides a comprehensive range of fully coordinated services under a single umbrella. We have been present in India for more than 100 years through its legacy firm A. F Ferguson & Co. Deloitte network’s Indian practice constitutes a large and important part of the global firm."
  },
  {
    "companyName": "Design Station",
    "logo": "https://merojob.com/media/cache/1e/78/1e784a521cb73afd8da4088e0544686c.jpg",
    "industry": "Construction / Real Estate",
    "about": "Design Station is a complete solution to your construction needs. Based on the foundation of trust and relation, we focus on giving budget friendly and sustainable construction along with our expert’s consultation to improve and give exceptional designs to your home, office, garden, property or any space. Our team is capable of overseeing all the aspect of exterior and interior components of a project of any scale."
  },
  {
    "companyName": "Devworks International",
    "logo": "https://merojob.com/media/cache/5c/8a/5c8aef3c8c0821776534bc6e1dd97442.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "The USAID-funded Nepal Health and Hygiene Activity (Swachchhata) is implementing by SNV USA (dba DevWorks International) aims to contribute to Nepal’s Country Development Cooperation Strategy goal of a healthier and well-nourished population. The Swachchhata focuses on improving quality of health service delivery and hygiene promotion in seven districts of Lumbini and Karnali provinces. Swachchhata is recruiting for the following positions:"
  },
  {
    "companyName": "Dharma Adventures",
    "logo": "https://merojob.com/media/cache/42/88/4288c37bdc1966e006b2ceb596eacd4f.jpg",
    "industry": "Travel Agents / Tour Operators",
    "about": "Dharma Adventures is a niche Destination Management Company, offering personalized services to clients looking for life changing experiences in Bhutan, India, Nepal and Tibet. We have been operating in the Himalayas since 1991, growing steadily while ensuring that the qualities of our services remain high and the product, top notch. The principles on which Dharma Adventures was founded - safety, hygiene, environment protection and adaptability, have always been the backbone of the company. Our aim is to provide visitors with every kind of viable adventure that the Himalayas can possibly offer. Agile, knowledgeable and efficient field staffs, top of the line equipment and well maintained vehicles are our assets.\n\nWe have offices set up in Nepal, Tibet, India and Bhutan to ensure that our clients have a smooth transition when undertaking a multi destination holiday in this region. Our knowledge and experience in the Himalayas makes us a reliable and trusty partner. We are positive, forthcoming,flexible and strive for perfection. We look to build programs that will satisfy all travelers and adventure seekers. On a journey with us there will be plenty of all that is good and desirable: magnificent scenery, excellent equipment, knowledgeable guides, ethnic cuisine, sturdy vehicles, maximum safety, clean environs and cheerful disposition. The serene beauty offered by the Himalayas is no doubt one of nature’s greatest creations and can be lived and enjoyed in a short span of time that you will spend with Dharma Adventures.        \n\n“We are your gateway to the Himalayas!”"
  },
  {
    "companyName": "Dish Media Network",
    "logo": "https://merojob.com/media/cache/42/be/42be087c9f91ee7816973feed64019d2.png",
    "industry": "Broadcast Media",
    "about": "Dish Media Network Ltd (DishHome) is one of the fastest-growing digital pay TV operator in Nepal. The company is run by a pool of young and highly qualified professionals. With operations across all 75 districts, the company has high-quality infrastructure for digital satellite broadcasting.\n\nDishHome strives to create an environment where people can contribute to its corporate culture, business process, and strategic goals."
  },
  {
    "companyName": "Dream Zone Pvt. Ltd.",
    "logo": "https://merojob.com/media/cache/df/1d/df1d9ee9acf6f849fb809ee7941653d8.jpg",
    "industry": "Construction / Real Estate",
    "about": "Interior Design & Build Company."
  },
  {
    "companyName": "EBPearls",
    "logo": "https://merojob.com/media/cache/78/12/7812ee5c7575e9c67d851e001001846c.png",
    "industry": "Information / Computer / Technology",
    "about": "EB Pearls was established in 2005 and is a full service digital solution agency. EB Pearls has offices in Sydney (Australia) and Lalitpur (Nepal), and it houses around 100 staffs across all offices. We, at EB Pearls, hold expertise in website, eCommerce, and mobile applications development.\n\n\nOur values pronounce solving digital solutions regardless of complexity and quality of services and product to the highest standard.  In such, the pivot to our success is the pool of competent people who own EB Pearl’s values and exhibit strong competence on quality of services, robust business system/process, top-notch technical capabilities, and utmost client’s satisfaction. As EB Pearls is at primary growth stage, we emphasis on cost-effectiveness while taking ambitious goals to grow our business. This stimulates us toward the establishment of strategic and holistic People Operations function at EB Pearls."
  },
  {
    "companyName": "Embassy Of Finland",
    "logo": "https://merojob.com/media/cache/aa/91/aa91af58143dd484e2c3a67d9ff87fe8.jpg",
    "industry": "Embassies / Foreign Consulate",
    "about": "The Embassy of Finland in Kathmandu is seeking a qualified individual for the role of locally recruited Special Adviser in the field of natural resource management and climate resilience for a fixed-term full- time position for 24 months starting on November 1, 2022, or as per agreement. \n\nNepal is one of Finland’s long-term development partner countries. Finland has been engaged in development cooperation in Nepal since 1983, in the water sector since 1989. The overarching goal of Finland’s Country Programme 2021-2024 for Nepal is to support Nepal’s equitable, economically viable and environmentally sustainable transition into a middle-income country by 2030. In the period 2021–2024, Finland’s cooperation focuses on three sectors: primary education, gender equality, and improved climate resilience and health through sustainable water supply, sanitation and hygiene and livelihood development."
  },
  {
    "companyName": "Executive Search- merojob",
    "logo": "https://merojob.com/media/cache/8d/67/8d678f2446654fbb2044fcac3013483c.jpg",
    "industry": "Manpower Recruitment",
    "about": "Executive Search Service of merojob specializes in recruiting best fit candidate (Usually Senior/Top level Position) for the client organization in various industries. We are also involved throughout more of the hiring process, conducting detailed interviews and presenting candidates to the client organizations selectively. Our process, involves analyzing the need of roles, screening and approaching right candidate, conduct preliminary interviews, facilitating the overall process from interview to selection.\n\nPlease be assured that your information are strictly kept confidential with merojob (Executive Search) and any details of your application shall only be shared to client only after proper consent.\n\nOn behalf of one of our client we are currently recruiting for the below mentioned position for our client industry."
  },
  {
    "companyName": "e-Zone International",
    "logo": "https://merojob.com/media/cache/e4/06/e4064120fa7a4af3728cf0cb54bd5ff3.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Founded in April 2003, e-Zone International (An ISO 9001:2008 Certified IT Company) is a premier IT organization driven towards providing the best of the technology era through solutions locally and globally with a slogan '.....quality forever'. e-Zone delivers technology-driven business solutions that meet the strategic objectives of our clients and create unmatched business value for clients through a combination of process excellence, quality frameworks and service delivery innovation."
  },
  {
    "companyName": "Furniture Hub",
    "logo": "https://merojob.com/media/cache/41/b0/41b0ae6d16dcab6ba03867df24514480.jpg",
    "industry": "Retail / Shops",
    "about": "Furniture Hub Private Limited is the pioneer company to introduce concept of online furniture in Nepal. Furniture Hub is based in Kathmandu and is a premium furniture manufacturer and first online furniture provider of Nepal from 2014. \n\nWe specialize in premium interior designing works for our clients and manufacture high quality customized furniture using our high end European machines and skilled labor. We currently employ over 150+ in our workforce including architects, engineers and skilled tradesman."
  },
  {
    "companyName": "Fusemachines Nepal",
    "logo": "https://merojob.com/media/cache/cc/cc/cccc01081bc117087c1cd754247515e4.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Fusemachines (https://www.fusemachines.com/) is an enterprise AI services, education and solutions provider on a mission to democratize AI.\n\nHeadquartered in New York with operations across North and Latin America and Asia, Fusemachines brings together engineers and PhDs from around the world to help companies build innovative AI solutions. With a Nepal based head office in Kathmandu, Fusemachines offers advanced AI products such as Fuse Classroom, Fuse Extract. Fusemachines AI Schools run AI Microdegree and Certificate programs in physical classrooms as well as online live classes using its proprietary content and learning platform."
  },
  {
    "companyName": "Garima Capital Limited",
    "logo": "https://merojob.com/media/cache/cc/16/cc16ce221d257ba2400bd6ea77c77a3a.jpg",
    "industry": "Capital Market",
    "about": "Garima Capital Limited is a Merchant Banker, licensed by Securities Board of Nepal (SEBON) to render 'Portfolio Management Services' (PMS). It has also obtained Depositary Participant License from CDS & Clearing Ltd. to render DP Services. Company is on the verge of obtaining full-fledged Merchant Banking License including Mutual Fund Manager License. The Company is located at Kamalpokhari Ward-01, Kathmandu, Nepal.\n\n\nOur core team comprises of qualified finance professionals which shall enable us to provide prompt and thorough service to our valued clients. We encourage an open and collaborative working environment in which everyone has the opportunity to deliver her or his best. We foster professionalism, excellence, cooperation among our employees and high standards of business ethics."
  },
  {
    "companyName": "Gharbazar.com",
    "logo": "https://merojob.com/media/cache/90/1f/901f416753f7a02118813aea184aa8de.png",
    "industry": "Real Estate - Property Management, Rental and Hiring",
    "about": "Gharbazar.com provides online services to sell, buy or rent properties. It is online marketplace platform for those who want to deal in their properties directly with the seller and buyer. It is a bridge between the buyers and sellers.\n\nSell your property at gharbazar.com!"
  },
  {
    "companyName": "GIZ",
    "logo": "https://merojob.com/media/cache/86/ec/86ecddddbe869796541779f980fdf4d7.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Deutsche Gesellschaft für Internationale Zusammenarbeit (GIZ) GmbH invites application from suitable and qualified professionals for the Local and Provisional Economic Development/Green Resilient Agricultural Productive Ecosystems (GRAPE) Project. LPED/GRAPE is a joint Nepali-German Project under the guidance of the Ministry of Land Management, Cooperatives and Poverty Alleviation (MoLCPA), Government of Nepal with Technical Assistance by the Deutsche Gesellschaft für Internationale Zusammenarbeit (GIZ) GmbH, commissioned by the German Federal Ministry for Economic Cooperation and Development (BMZ) and co-financed by the European Union and Finland. The overall volume of the project is 18,35 Mio. EUR. The overall objective of the Project is that framework conditions for local economic development in selected (rural and urban) municipalities and value chains at local and provincial level are improved. The Project has four output areas:\n\nEconomic Governance: The project supports municipality-level stakeholders in creating beneficial framework conditions for agriculture-based actors and for climate-resilient value chains. This is done by supporting climate-sensitive planning and investments on the municipality level.\n\nAction Research:This field of action enables change through innovation. The project includes the development and testing of climate smart solutions that suit specific regions as well as the market. It will also enable cooperation by connecting research institutions with stakeholders along the value chain.\n\nRolling-Out: Sustainable approaches identified through research or tested approach will be promoted through intermediaries and implemented on a larger scale by farmers, cooperatives, and producer groups.\n\nScaling-Up:The knowledge, instruments, good practices and policy recommendations developed on the local level will be presented to a larger and diverse audience at provincial and national level to encourage a scaling-up of climate-resilient and water-efficient approaches in agricultural value chains. Under the overall supervision of Chief Technical Advisor (CTA), the position holder (junior professional) is ensures the management and implementation of the project’s communication and visibility (C&V) plan and for the support of general project communication as per corporate design."
  },
  {
    "companyName": "Global Academy of Tourism and Hospitality Education",
    "logo": "https://merojob.com/media/cache/e1/00/e10078d392e421261e8cf4841a70bdcc.jpg",
    "industry": "Education - School & Colleges",
    "about": "Global Academy of Tourism & Hospitality Education (GATE) is an award winning International  Hotel Management School based in Kathmandu Nepal, offering world-class hospitality  education since 2007 affiliation with world famous Ecole Hôtelière de Lausanne, EHL  https://www.ehl.edu/"
  },
  {
    "companyName": "Global College International",
    "logo": "https://merojob.com/media/cache/f3/e9/f3e9e12cdac40597ed6045497405ac9b.jpg",
    "industry": "Education - School & Colleges",
    "about": "Founded in 2009, Global College International (GCI) is a quality driven academic institution of higher education in Nepal. GCI has been awarded with the World Standardization Certification (WSC) under the International Quality Certification by the World Book of Records (WBR), London in recognition as a pioneer of global education that prepares every graduate to making a difference at local and global level. Recognized as a research- oriented institution, GCI has been selected as a partner for ERASMUS +2 Capacity Building Global Project on entrepreneurship and sustainable tourism management research, innovation and student- faculty mobility programs funded by  European Union. The managing team of this institution consist of academicians, researchers, entrepreneurs, and professionals with track- record in diverse fields of expertise relating to management science and business practice. GCI has been delivering management education with the academic programs of undergraduate and graduate level. As of now these are the programs; A- Level affiliated to Cambridge University ,Bachelor of Business Administration (BBA), Bachelor of Travel and Tourism Management (BTTM), Bachelor of Hotel Management (BHM) and Master of Business Administration (MBA), all affiliated to Mid- West University (MU) and Global Institute of Professional Training Pvt. Ltd, Nepal."
  },
  {
    "companyName": "GreenCodes",
    "logo": "https://merojob.com/media/cache/69/9f/699fbbcd5f19ef5177890a0b84e9ecf5.png",
    "industry": "Information / Computer / Technology",
    "about": "GreenCodes is a team of professional, motivated and highly experienced developers from Nepal.\nIn addition we believe in quality work and timely delivery.  Most of all we love to work on challenging tasks and scale-able development. We develop easy and interactive user interface with strong backed frame. Hence we are expertise in the field of creative Website Designing, Search Engine Optimization (SEO), software and plugin development. As we are young and energetic technical savvies and in hungry of latest innovation technologies on web, as a result we will apply all the technology evolution strategies in our projects. Our smart work will often describe who we are!"
  },
  {
    "companyName": "GSN Consulting",
    "logo": "https://merojob.com/media/cache/e9/b3/e9b39fd3c365eb16b3ecb65256bab865.jpg",
    "industry": "Audit Firms / Tax Consultant",
    "about": "Established in 2011, G.S.N. is a growing firm and has a deep understanding of the local economy. At G.S.N., we are continuously looking for avenues to assimilate value added knowledge, for our people, for our clients and for the society as a whole.\n\nOur philosophy and practice is to blend the technical, practical and business approach in each of our engagement. Our techniques are designed to identify business issue and provide relevant assistance to meet those challenges. We advise in designing accounting system and provide our clients with practical business oriented solutions to maneuver through numerous obstacles/problems.\n\nG.S.N. specializes in business advisory & consultation services, audit & assurance, tax planning & accounting & bookkeeping. To augment to the services available, we have developed the capability to collect, mobilize and organize engagement teams from a pool of affiliated institutions and professional consultants and practitioners.\n\nG.S.N. has a nationwide network of professionals committed to serve the overall industry. Their in-depth knowledge and experience enables us to provide clients with insights firmly grounded in understanding the business challenges of the current economic environment."
  },
  {
    "companyName": "Habitat for Humanity International Nepal",
    "logo": "https://merojob.com/media/cache/f9/16/f916fe44f825a01455fc98f34730241d.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Habitat for Humanity International Nepal's vision is a world where everyone has a decent place to live. Habitat Nepal operates as part of an international network with a common objective of reducing poverty and eliminating substandard housing and homelessness from the world."
  },
  {
    "companyName": "Hamro Academy",
    "logo": "https://merojob.com/media/cache/a3/a2/a3a2c293e8c6fa1e2d580625209b0813.png",
    "industry": "E-Commerce/ E-Business",
    "about": "Welcome to Nepal's Best learning platform. We are an innovative education platform connecting our highly regarded and experienced faculty members and the students from different parts of the world through the electronic media. We envision any person located at any place can get access to the best faculty and highest quality education. We have developed a secured yet user friendly platform for both students and teachers which includes video lectures, notes, test series and live sessions.\n\n\n\n\nWe aim to establish ourselves as the market leaders in the online education industry through our student friendly notes, creative teachers and innovative learning methodology provided via our web platform and mobile app."
  },
  {
    "companyName": "Hansikar Technologies",
    "logo": "https://merojob.com/media/cache/8a/33/8a33b5b96674cca8c98679d7a4e92593.png",
    "industry": "Information / Computer / Technology",
    "about": "Hansikar is a leading digital marketing agency established in 2018 and has served over 50 clients. We are primarily focused on designing result-driven online marketing strategies (including SMM, SEO, Ecommerce SEO, local SEO, PPC, Content Marketing, Video Marketing) for ensuring accelerated growth in client’s business and improved conversion rates. \n\nOur passionate and professional team is comprised of highly data-driven individual and creative thinkers who take both quantitative and qualitative approaches to achieve desired success.\n\n\nLearn more about us in this link."
  },
  {
    "companyName": "Heisenberg Research",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Advertising Agency",
    "about": "Heisenberg Research provides intelligence-driven data and software solutions in capital markets. Our solutions are a combination of unbiased information, artificial intelligence, and expertise."
  },
  {
    "companyName": "Heritage Publishers & Distributors",
    "logo": "https://merojob.com/media/cache/5a/86/5a86f8f1e7a04eedfb0a6f149c451a3b.jpg",
    "industry": "Designing / Printing / Publishing",
    "about": "Heritage Publishers and Distributors Pvt. Ltd. is one of the renowned publishers and distributors in Nepal. It is located at Bhotahity, Kathmandu a central point of Kathmandu. It was established in 2005 AD. an aim to serve all kinds of readers providing all kinds of educational materials produced from all native as well as foreign publishers.\n\nSince its establishment it has started providing different types of textbooks, reference books and other different educational materials to all kinds of readers. It has been providing books of different fields, faculties, levels and institutions necessary for pre-school to university level readers. In addition to distribution of all kinds of books, it has started publishing different types of books for different readers, students, teachers, professors, researchers, scholars, and academicians prepared by different renowned and expert writers, editors and subject experts.\n\nHeritage Publishers and Distributors has three counters at Bhotahity. The retail counter or showroom is in front of Fine Arts Campus, next is inside the way to Asan and storeroom is beside Vidyarthi Pustak Bhandar, Bhotahity.\n\nIts counters have a wide varieties of books, reference books and other kinds of educational materials of all the faculties and different levels of Tribhuvan University, Kathmandu University Pokhara University, Purwanchal University, Nepal Sanskrit, Far-western as well as Lumbini Bouddha University and Higher Secondary Education Board, Council for Technical Education and Vocational Training (CTEVT) and others at retail as well as wholesale price.\n\nWe are dealing our customers with: School and general books  Medical, Dental and Nursing Books  Engineering and Agriculture books Science and Computer books Law, Religion, Fine Arts Books Different commissions and competitions Journalism, management, and CA books Exam solution and help books of different exams Military, Police Tourists, Language, literature Yoga, Ayurveda, Sports and Games  History, Culture, Religion, Architecture  Sociology and Anthropology and many more…\n\nAll kinds of books published and distributed by native and foreign publishers and distributors are available in our counters in addition to these books.\n\nOur retail counters open from morning to evening all days. With spacious parking facility it is a centre of all educational materials. We have more than 150 dealers in different parts of Nepal: in valley and outside. They can order books individually as well as via email, fax, courier services. We can collect our amount through draft, cheque, fax or money exchangers from any city of Nepal and other countries. We deliver orders through road transport services as soon as possible after of payment. Our transactions are done with computerised system. Therefore, customers’ satisfaction and service is the main motto of our business. In case of any misunderstanding between Heritage and other party we can appeal to Kathmandu District Court."
  },
  {
    "companyName": "Himgiri Hygiene",
    "logo": "https://merojob.com/media/cache/3b/5a/3b5ac22a187a51ad723c3ac43632ea0d.jpg",
    "industry": "Consumer Products / FMCG",
    "about": "Himgiri Hygiene Pvt Ltd, formerly known as Himgiri Soap & Chemical Industries (P) Limited, is a company situated in Biratnagar, Nepal that produces laundry, detergent, and hygiene-related products. This business, founded in 2062 B.S. (2006 AD), concentrates on producing high-quality household cleaning products and has developed a solid brand identity. With its corporate office in Naxal, Kathmandu, a branch office in Butwal, Rupandehi, and an evergrowing network of dealers and distributors all over the country, the company has extended its coverage to almost every part of the country and has quickly risen to become one of the nation's top producers of hygiene-related goods, with a daily production capacity of over 150 metric tons. The company's vision: \"घर घरमा हिमगिरी\" is the motto that we, all the employees, follow in all we do. Best known for its quality and value-for-money products, the company has never skimped on the products offered to customers and has built well-known businesses with a solid track record over the period of time."
  },
  {
    "companyName": "Hotel Ambassador",
    "logo": "https://merojob.com/media/cache/76/a2/76a2fc7a98460314885129a57f4c8364.jpg",
    "industry": "Hotels / Resorts / Restaurant",
    "about": "Hotel Ambassador is a four-star hotel at the heart of Kathmandu. Located in one the most vibrant areas of Kathmandu (Lazimpat), it is an ideal choice for guests who want to experience everything great that the city has to offer, without having to venture too far.\n\nHotel Ambassador by ACE Hotels is looking for dynamic & energetic personnels to join its growing team."
  },
  {
    "companyName": "Hotel Khangri",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Hotels / Resorts / Restaurant",
    "about": "Located in Kathmandu, a 9-minute walk from Pashupatinath, Kathmandu Khangri Hotel has accommodations with a restaurant, free private parking, a bar and a garden. The property is around 1.9 km from Boudhanath Stupa, 3.7 km from Hanuman Dhoka and 3.9 km from Kathmandu Durbar Square. The property provides a 24-hour front desk and room service for guests."
  },
  {
    "companyName": "Hotel Shangri~La Pvt. Ltd",
    "logo": "https://merojob.com/media/cache/7d/ea/7dea5e786691190373cb1089af45f886.jpg",
    "industry": "Hotels / Resorts / Restaurant",
    "about": "The First domestic chain hotel of Nepal. \n\nRelaunching a brand-new luxury portfolio in 2023"
  },
  {
    "companyName": "IIMI Asia Pacific",
    "logo": "https://merojob.com/media/cache/94/b1/94b111ea23a19832e6e6ce0a7412560f.jpg",
    "industry": "Information / Computer / Technology",
    "about": "IIMI\n\nData Entry and IT Services\n\n IIMI is a 25-year-old outsourcing company offering data entry, processing, and BPO (Business Process Outsourcing) services to its clients around the world. Headquartered in USA, it has its own operations in 5 different countries and employs 4,000+ people."
  },
  {
    "companyName": "Inctic Labs",
    "logo": "https://merojob.com/media/cache/f8/b3/f8b399dc6a58ca0e70745e1d874f491a.jpg",
    "industry": "Information / Computer / Technology",
    "about": "We are a bunch of tech ninjas, split across Nepal(HQ), Germany & USA. Born in the heart of Kathmandu, we are open to the world. If you do not know about us till today cause we want to keep it that way.\n\nIt is not only about technology when you work with us. We are good at what we do i.e. blend technology with creative solutions resulting growth in your business. We could be your next step for your vision."
  },
  {
    "companyName": "InfoDevelopers",
    "logo": "https://merojob.com/media/cache/5a/6a/5a6a6708bee397c9ca59b5b333865b7d.jpg",
    "industry": "Information / Computer / Technology",
    "about": "At InfoDevelopers, we continuously work to ensure that our services are maintained at the highest possible level of reliability and satisfaction. We are not successful until every customer start achieving return on their investments from reduced production costs and streamlined processes. InfoDevelopers provides innovative, quality, cost effective IT Services and Software solutions for business process automation and re-engineering. Established in 2002 AD, the Company has been promoted and managed by professionals having long working experience in banking and IT sectors. We have 150 staff members who are currently working with us."
  },
  {
    "companyName": "International Genesis Technology Nepal",
    "logo": "https://merojob.com/media/cache/ab/b6/abb6f92b363708cc2d23e3e464753f21.jpg",
    "industry": "Telecommunication",
    "about": "International Genesis Technology Nepal Pvt. Ltd, is a leading Telecom Services Provider Company in Nepal offering services and solutions to address the Network Life Cycle requirements of Telecom Operators, Technology providers (OEM’s) and Tower Companies.\n\niGenesis is Contributing in the Vision of Digital & Brighter Nepal by Contributing to the Telecom Industry through Excellent Construction Building Capabilities & Expertise in Electrical, Power & Solar."
  },
  {
    "companyName": "International Manpower Recruitment",
    "logo": "https://merojob.com/media/cache/5f/47/5f4756001c1f01d0304329a51685ad5c.jpg",
    "industry": "Manpower Recruitment",
    "about": "IMR Solution is a premier recruitment agency that offers the most inclusive service to both employer & job seekers and stands as the best solution and compromise between recruitment cost, timely service and workers' reliability. We specialize in ethical and professional overseas recruitment services for our clients and candidates. The experience gained by processing hundreds of overseas recruitment projects guarantees to have clients demand handled quickly, accurately and professionally."
  },
  {
    "companyName": "Jagdamba Laminates",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Distribution Companies / Wholesale",
    "about": "We are major distributors of Laminates and New wood based in Kathmandu, Nepal. We distribute products of major brands such as Greenlam, Action Tesa, Magnus."
  },
  {
    "companyName": "Job Center",
    "logo": "https://merojob.com/media/cache/27/9d/279da390a301591cee3a955a9f03f13f.jpg",
    "industry": "Manpower Recruitment",
    "about": "Job Center is a recruitment agency that offers exciting international career opportunities to skilled professionals, experts and multilingual specialists in the Europe and the Middle East. We recruit at all levels for the world’s leading companies and start-ups in many fields around the world!\n\nEstablished in 2065, Job Center is an International Human Resource Consultancy based in Nepal with partners across Africa, Asia, Europe, Middle East, North America and South America. \n\nWe help organizations from SMEs to blue chip companies, optimize their employees and management potential through our unique Recruitment Process Outsourcing System providing an effective alternative to traditional ways of recruitment. \n\nWe provide a complete integrated ethical recruiting solution by following a rigorous process of sourcing, pre-screening, assessing, selecting, engaging and on-boarding enabling employees to recruit the right candidates for the right job."
  },
  {
    "companyName": "Just Say No Nepal",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "NGO / INGO / Development Projects",
    "about": "Just Say No Nepal (JNS) is an internationally recognized a national level non-government and nonprofit making social organization which was initiated by Mr. Rishi Raj Ojha, Founder Chairperson of this organization. Mr. Ojha was influenced by drug abuse prevention activities of Just Say No Japan during his advanced study on Drug and Alcohol Abuse Prevention and Management course in Tokyo, Japan. Just Say Nepal affiliated with Just Say No International, USA in 1991 and it was actively works for drug, alcohol and tobacco abuse prevention programs in Nepal till 2001. After several years successful experience in Just Say No program in the country, Just Say No Nepal was formally registered under Society Registration Act of Government of Nepal, Ministry of Home Affairs, District Administrative Office in 2002. Similarly, it is affiliated with Social Welfare Council (SWC) and it is also enrolment with Ministry of Home Affairs, Narcotic Control Section and Executive Member of Narcotic Control Division, Ministry of Home Affairs. It is also registered for PAN and Tax assumption in Internal Revenue Office under the Ministry of Finance. Just Say No Nepal is a pioneer organization in addressing the issues of drug, alcohol and tobacco abuse prevention and drug related harms reduction education and policy reform in the country."
  },
  {
    "companyName": "Kantipur Holidays",
    "logo": "https://merojob.com/media/cache/d5/03/d503e5cda0765151d9aaee8133732777.jpg",
    "industry": "Travel Agents / Tour Operators",
    "about": "Kantipur Holidays is an online travel distribution company established to facilitate our customers with extensive services to plan a perfect solution to an exquisite holiday destination. Through our services you can effortlessly devise your holiday in any location, within the best possible price ranges. As a leading travels and tours firm within Nepal, we assure the ultimate solution to our customers' itinerary, no matter how exclusive they are. We are driven by a zealot and industrious professional team along with an exhaustively maintained IT structure. We are committed to assist our clients with smart travel choices, offering peculiar holiday packages and extensive hotel list at your desired destination within competitive prices. It is our earnest motive to make your trips convenient and memorable."
  },
  {
    "companyName": "KARU",
    "logo": "https://merojob.com/media/cache/33/71/3371faf3e2fc83f24eb260a33325a17b.jpg",
    "industry": "Engineering Firms",
    "about": "KARU aims to be the leading Firm for complete design and building solutions in Nepal, through recognition and high value from clients, colleagues and industry leaders."
  },
  {
    "companyName": "Kasuwa Khola Hydropower Ltd (KKHPL)",
    "logo": "https://merojob.com/media/cache/64/f7/64f702cde42785b5ee3f080fea0f26a2.jpg",
    "industry": "Hydropower / Alternate Energy",
    "about": "Kasuwa Khola Hydropower Ltd (KKHPL), is a public company incorporated on Kartrik 30, 2067 (November 16, 2010) as per Company Act 2063, Nepal with the objective to develop and invest in hydropower projects. It is currently developing 45 MW Kasuwa Khola Hydropower project in Sankhuwasabha District and owns its electricity generation license. The project is located in Makalu Gaupalika, of Sankhuwasabha District. Its registered office is located at Tripureshwor -11, Bluestar Complex, Kathmandu, Nepal. CEDB Hydropower Development Company (CHDC) holds sole ownership in the company.\n\n\nContact No: +977 1 4101140."
  },
  {
    "companyName": "Kathmandu Infosys Educational Consultancy",
    "logo": "https://merojob.com/media/cache/1a/25/1a2541afdb14576b12b6d26d774f2ec6.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "“KIEC formally known as Kathmandu Infosys is Nepal's must searched education consultancy, Established in the year of 2006, having served a plethora of students, taking them one step closer to achieving their dreams. Our team at KIEC, pride ourselves on working round the clock, finding bespoke solutions that are unique to every individual student, based on their background and qualifications. We thrive in reaching the unsurpassed pinnacle of giving a wide array of options to the students, that they can choose from while suggesting what's best for them, and that's what makes us Nepal's number one education consultancy.\n\nWe have successfully branched out all over Nepal, with offices in Sydney and Melbourne, so that no student is deprived of their right to international top-class education. We have the finest counselors, who are always updated with the new immigration regulations, staying one step ahead of the game. Our Learning Center hosts the best IELTS, PTE, SAT & GRE classes in Nepal, with proficient teachers having decades of experience, that understand the needs of each student. We are honored to be Nepal's number one education consultancy and are always ready to be at your service any time of the day!”\n\nOnce you will be in any KIEC offices, we assured you that you will \"Get More\"."
  },
  {
    "companyName": "Kathmandu Meridian School",
    "logo": "https://merojob.com/media/cache/bd/4f/bd4f8678e8c4d446bc505666b294915f.jpg",
    "industry": "Education - School & Colleges",
    "about": "We believe that education is a shared responsibility and that the successful operation of a school depends on the cooperation of everyone involved: students, parents, and staffs. The mission of the Kathmandu Meridian School is to create a constructive partnership among the members of this triad. Each of us is responsible for doing his or her part to make our school a place where we can all work and strive together in harmony. \n\nKathmandu Meridian School realizes that education is a mutual responsibility and the successful operation of a school depends upon the cooperation of everyone involved; school administration, students and parents. The mission of the Kathmandu Meridian School is to generate a positive and trustworthy relation among the members of this triad.\n\nKMS is focused to strengthen the admirable learning environment to all the students to support them to develop the best that is embryonic in children, to prepare them for the upcoming challenges to face the changing world by developing their inter personal potential skills and talents and grow up as a successful human beings without self-consciousness and prejudice in any form. This is what KMS sets apart in pursuit to develop in the growing environment of worldwide schooling values."
  },
  {
    "companyName": "Khalti Digital Wallet",
    "logo": "https://merojob.com/media/cache/32/27/3227642d60ceadc3a94c418c71ea9609.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Khalti is a mobile wallet, payment gateway & service provider in Nepal. Launched in January 2017, Khalti is one of the leading online payment solution in Nepal. It allows users to pay for a range of services like basic utility payments, hotel bookings, movie and domestic flight tickets, events and many more. It is operated and owned by Sparrow Pay Pvt. Ltd. \n\nWe offer payment solution to over hundreds of merchants across Nepal and provide seamless payments using ebanking, smart banking, cards, and wallet. Being not just limited to mobile app users, Khalti has more than 8000 POS and Agent Network providing Khalti services to end users.\n\nKhalti is home to some of the brightest minds in the country, which includes a team of highly skilled developers and interactive marketers. Our solution-oriented approach makes us reliable for any and all kind of service you might require from Khalti with the best user experience possible.\n\nOur goal is to simplify lives of people by bringing financial inclusivity to every individual in Nepal and take the payment industry from offline to online through best practices."
  },
  {
    "companyName": "Magnus Consulting Group",
    "logo": "https://merojob.com/media/cache/ac/a5/aca5a996f5400d38ce7e180e2abce81d.jpg",
    "industry": "Software Companies",
    "about": "Magnus Consulting Group Pvt. Ltd. is Nepal's first Social Enterprise established in 2005 to work with rural small farmers - through their cooperatives and Microfinance Institutions (MFIs) - to help them improve their socio-economic status. The ground breaking partnership model, Private Community Partnership (PCP), has been highly effective in enterprise's strategies to work with the underserved farmers.\n\nIn the PCP, first, Information and Communications Technology (ICT) is integrated into small farmer cooperatives and MFIs. The enterprise's locally developed software solutions is integrated with the coop's and MFI's strategies and then tailored-made training program is executed for behavior change intervention (BCI) for rapid adoption of ICT. The cooperatives and MFIs are sensitized of investment on the ICT infrastructure and its return period (CBA was the result of pilots in 2006 in three cooperatives which provided leeway to replicate in few more before scaling up). The training coupled with BCI strategies, then help them embrace ICT at rapid pace. PCP, which is a partnership for a long haul, concretizes the trust between the enterprise and the coops and MFIs.\n\nToday, the enterprise has successfully integrated ICT in 250 Small Farmer Agriculture Cooperatives and MFIs in 45 districts. This is unprecedented in the backdrop of numerous ICT diffusion attempts by other actors in all sectors. In an average, 3.5 staffs of each of these rural financial institutions, have developed capacity to operate on ICT and trust their own newly acquired skills-set: and the number is growing by 10% every year. \n\nThe internet connectivity, now has been successfully established in 100 partners. In addition to software solution itself, the demand of the connectivity has risen from the coops and MFIs themselves, because of the acquired knowledge on efficiency, transparency and easy-to-work-environment that ICT has introduced. With the connectivity, not only enterprise addresses problems and bugs relating to the software, it also sends software updates, messages (e-mail possible now) and other information relating to good governance. In other words, these isolated communities are now connected with the world and opens up many social business opportunities for the enterprise as well as other strategic partners.\n\nWith ten year's experiences in rural areas with farming communities in designing, developing, implementing and monitoring ICT interventions and BCI strategies and finance software development has driven the enterprise to its maturity level for highly specialized and effective services to our clients. During the first five years, to sustain the strategies, the enterprise embarked on executing and managing many ICT related projects that span from ICT consulting to software development to out-sourcing. This is the other service portfolio of the enterprise."
  },
  {
    "companyName": "Maple International Education",
    "logo": "https://merojob.com/media/cache/aa/74/aa748d84d71942c68546606a224cc30f.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Maple International Education Pvt. Ltd is established with the motive to provide up-to-date college & university information, right academic counseling, visa documentation guidelines and fast service. From its establishment period to till date it is successful to create a strong goodwill among the students and their parents. Maple International Education Pvt. Ltd. is a leading professional education information service center.\n\nIt is run by highly experienced and qualified professionals. It is truthfully offering complete guidance and information for academic matters such as the choice of course, admission guidance and helping students in selecting best programs in different fields to various universities and colleges.\n\nMAPLE aims for the Colleges and Universities having first rate facilities, strong student support, an affordable room and cost and high quality teaching to create the perfect atmosphere for the students to achieve the best they have long-awaited for. To develop and to establish the ideal educational world, MAPLE is working as an authorize representative with various universities and colleges. MAPLE is keen to establish mutual relationship and welcoming environment to enroll Nepalese Students to unique culture and groups."
  },
  {
    "companyName": "Marpha Trading Pvt. Ltd.",
    "logo": "https://merojob.com/media/cache/80/c0/80c09ca7cf310ea9aba42a5f71b910fe.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "Company Import various goods from third country."
  },
  {
    "companyName": "Maxim Incorporation Traders",
    "logo": "https://merojob.com/media/cache/8b/ca/8bca7b10e6967b6e7cad9e3188b6bde0.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "Maxim Incorporation Traders is the leading medical equipment supplier and authorized national dealer of International reputed company with ISO 9001:2015. The Company is seeking qualified and hiring deserving candidates"
  },
  {
    "companyName": "Max Lagence",
    "logo": "https://merojob.com/media/cache/a8/96/a89688a7016873587ffa4193915748e2.jpg",
    "industry": "Advertising Agency",
    "about": "L'agence is a 360 degree advertising agency and provides creative marketing solutions to some of the most sought-after clientele in Nepal. Our reach and scope of work is unlimited and so should be your commitment - to deliver.\n\nWe are on the look-out for people who understand that being the best does not come on a plate with a silver spoon, but is achieved by the long, brutal working hours.\n\nOur continuous expansion and increased clientele demand that we open up more vacancies."
  },
  {
    "companyName": "ME10",
    "logo": "https://merojob.com/media/cache/49/91/4991f257c2952632e3fa4fa95e48f567.jpg",
    "industry": "Audit Firms / Tax Consultant",
    "about": "We are a well established accounting firm in Kathmandu, and a partner of a London based firm with over 20 years of service in the industry. We provide service for UK and International clients that include privately-held businesses, professional partnerships, individuals, trustees, charities, family offices and subsidiaries of international companies. We have continually invested in our people and processes to ensure they are at the leading-edge, enabling our clients to benefit from our partner led expertise and experience."
  },
  {
    "companyName": "Medipro Computers",
    "logo": "https://merojob.com/media/cache/7e/25/7e25fd583db1c097a1beb615f58aa7b0.jpg",
    "industry": "Information / Computer / Technology",
    "about": "MediPro is the first domestic software company in Nepal to expertise complete business software for medicine business serving every aspects of business automation world since 1991 through its efficient professionals and beautiful minds\n\nMedipro is the pioneer of computer software for all spectrum of medicine business and hospital management systems. We are the market leader in this niche market since the inception of the company three decades ago in Nepal (AD 1991). We have been serving thousands of our valued customers across every corner of Nepal. Here is the opportunity to be a valuable member of this glorious company for you. We are looking for full-time candidates who have a strong desire to contribute and have a problem-solving attitude."
  },
  {
    "companyName": "Neelam Gahana",
    "logo": "https://merojob.com/media/cache/9e/37/9e3738feec2ae9f8a7fb9ea31e09d236.jpg",
    "industry": "Gem and Jewellery",
    "about": "Neelam Gahana is seeking to recruit a highly dedicated and qualified candidate for following position:"
  },
  {
    "companyName": "Nepal Digital Payments Company Limited",
    "logo": "https://merojob.com/media/cache/cb/99/cb997801e6ffdb36398b0a9d5653fe4a.jpg",
    "industry": "E-Commerce/ E-Business",
    "about": "Nepal Digital Payments Company Limited (NDPC) is a public company established by the joint investment of Nepal Doorsanchar Company Limited (Nepal Telecom) and Rastriya Banijya Bank Limited. The Company has been incorporated with an aim to operate mobile financial services to provide cashless payment services to people across Nepal and thus help improve financial inclusion and realize the national goal of digital society. The company shall provide easy, affordable and comprehensive digital mobile financial services to both banked and unbanked masses across the nation, thereby helping create a cashless society."
  },
  {
    "companyName": "New Business Age",
    "logo": "https://merojob.com/media/cache/9e/ea/9eeac47de027b6bb60d6e4995a1101c6.jpg",
    "industry": "Media / Publication (Newspaper, Magazines)",
    "about": "New Business Age Pvt. Ltd is a well-established media house of Nepal (set up in year 2001), which has been publishing, since 2001, New Business Age, an English Monthly and since 2005, Aarthik Abhiyan, a Nepali National Business Daily. Their websites are www.newbusinessage.com and www.abhiyandaily.com."
  },
  {
    "companyName": "Newspaper Posting",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Advertising Agency",
    "about": "-"
  },
  {
    "companyName": "NIC Asia Bank",
    "logo": "https://merojob.com/media/cache/55/9e/559ec4043d6d01f3cf1e9ee66dfca921.jpg",
    "industry": "Banks",
    "about": "NIC ASIA Bank is one of the most reputed and No. 1 commercial bank in the country in terms of brand equity, risk-assets, deposit volume, and footprints. The Bank is currently on a lookout for a dynamic, result oriented, pragmatic, self-motivated and passionate candidates to join us in following position:"
  },
  {
    "companyName": "NIDAN Hospital",
    "logo": "https://merojob.com/media/cache/c3/75/c3756993c21c0699ef6f4b12725b98b2.jpg",
    "industry": "Hospital / Clinic / Diagnostic Centre",
    "about": "Nidan Hospital Limited is a preferred 50 bed multispeciality hospital situated in Pulchowk, Lalitpur and offers clinical specialties such as gastroenterology, nephrology, urology, orthopedic, surgery, gynecology and obstetrics, paediatric, etc. Nidan seeks application with expression of interest to lead a dynamic team."
  },
  {
    "companyName": "Noble Textiles",
    "logo": "https://merojob.com/media/cache/ca/f1/caf1a3b3fc5d811bf060dabb1b7d8fd6.png",
    "industry": "Manufacturing / Engineering",
    "about": "Noble Textiles is part of Prestige Companies, the group behind iconic brands like Rara and Hathi Chap chappals, Prestige Mats, ST Carpets, Prestige Carpets, etc.\n\nWe are a woven and knitted textiles company based in Birgunj, Nepal. We specialize in manufacturing and marketing Shirting and Suiting fabrics and winter wear fabrics. Our fabrics are used by schools, colleges, corporates, and other institutions. We also manufacture acrylic yarn-based winter wear fabrics popularly known as Bhela in Nepal.\n\nWe have a manufacturing capacity of 3 million meters per annum that will soon be expanded to 7 million meters. With this, we will become one of the largest textile companies in the country.\n\nWe are always on the lookout for young and energetic people who can contribute to the growth of the company."
  },
  {
    "companyName": "Nourish Foods Pvt. Ltd.",
    "logo": "https://merojob.com/media/cache/8b/03/8b03ce69ac92197633b4b9208bc1b4bb.jpg",
    "industry": "Food Production",
    "about": "Nourish  Food is a young brand which intends to cater healthy easy to cook foods products. We only produce high quality frozen momos with the brand name YUMMS MOMO. Yumms is available at all small and big department store. Our food products is 100 % halal"
  },
  {
    "companyName": "OM SAI TRADE CONCERN",
    "logo": "https://merojob.com/media/cache/67/44/67440d5faaf63740e2aabda3ffe5c028.gif",
    "industry": "Information / Computer / Technology",
    "about": "Om Sai Trade is an ISO Certified foremost supplier and trader of telecommunication goods, equipment and electronics equipment in Nepal. We are an acknowledged and distinguished leader in the fiber cables supplier, rectifier, solar charge controller and battery market. Its products are manufactured in a contemporary facility. Products are highly efficient, compact, aesthetic, intelligent, reliable and virtually noiseless."
  },
  {
    "companyName": "Pandora Group Of Companies",
    "logo": "https://merojob.com/media/cache/14/a7/14a793e2d5c6bf50326af2718c8c319d.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Pandora Group of Companies is an international media company having been institutionalized in 2020 by four young and dynamic entrepreneurs. With the experience of more than 5-years in the field, we have become one of the leading media houses in Nepal. The majority of our services are provided to clients based in the United States of America. We at Pandora represent a number of websites all related to Hollywood celebrities."
  },
  {
    "companyName": "Pashupati Kattha Mills",
    "logo": "https://merojob.com/media/cache/16/53/165308221d7d50701866be2f48bec1ca.jpg",
    "industry": "Manufacturing / Engineering",
    "about": "Pashupati Kattha Mills Pvt. Ltd. is an export oriented manufacuring entity incorporated in Nepal. Its factory is located at Jeetpur-Simara SMC, Ward No. 07, Bara, Province No. 2, Nepal."
  },
  {
    "companyName": "Pioneer Trade Concern",
    "logo": "https://merojob.com/media/cache/57/b6/57b675cc2a05ad9329e9a058c0d198c5.jpg",
    "industry": "Retail / Shops",
    "about": "We are a leading Business House responsible for getting International fashion to Nepal since last 15 years. We are the Authorized Franchise Partner for International Brands such as:\n\nPeter England: India's leading men’s wear brand\nPuma: German Sports Wear Brand\nMeters/bonwe: Leading Casual Wear brand from Shanghai\nVan Heusen: Premium Formal Wear Brand from USA\n\nWe believe that building a strong relationship between a brand and their customers’ needs continuous hard work over the period of time."
  },
  {
    "companyName": "Rojgari Services",
    "logo": "https://merojob.com/media/cache/77/0b/770b4f90f9a6519f841e3ca2231de4e7.jpg",
    "industry": "Other",
    "about": "Rojgari Services Private Limited, registered in 2012 is a FDI company after being a part of the IFC’s Global SME Ventures initiative with investments from the IFC of the World Bank Group. Rojgari Services is a leading Hiring Management Solution provider for blue-collar workers in Nepal with the main objective of providing work connectivity opportunities between employers and workers in the most convenient and systematic ways."
  },
  {
    "companyName": "SabKura Consultancy",
    "logo": "https://merojob.com/media/cache/72/74/7274a450b6e0d14e27d1ba74d1ed7ebb.jpg",
    "industry": "Consulting / Legal",
    "about": "Welcome to our Consultancy\n\nSabKura Education Consultancy is one of the pioneers for abroad education counselling in Nepal. We are registered under The Ministry of Education, Science & Technology and fulfil all of the technical and certification requirements along with attaining the global certification of training which have possessed us with the knowledge to lead the counselling industry. We specialize in counselling destinations like Australia, the USA, United Kingdom, Canada, Netherland and India. And along with the high visa success rate, we also are proud of our students who have been successful in their careers through our counselling and guidance. That makes us possibly the best education consultancy in Nepal."
  },
  {
    "companyName": "Sabre Travel Network Nepal",
    "logo": "https://merojob.com/media/cache/f2/a5/f2a57495285be9638bb17e4488c53f09.jpg",
    "industry": "Software Companies",
    "about": "Sabre Travel Network Nepal is located in front of the British Embassy, Lainchaur Kathmandu, Nepal aims to provide quality service to satisfy customers’ needs. A professional dedicated team is always there to assist trade partners with any travel-related requirements that’s why our customer support remains open at weekends and other public holidays and even provides off-time service at 9779802047725/ 9779802047726 after the office and can enjoy our an emergency service towards our agents. Similarly, Sabre Travel Network Nepal understands the local needs of trade partners and provides products that can add value to their business so that agents will be benefited to generate maximum revenue."
  },
  {
    "companyName": "Samata Foundation",
    "logo": "https://merojob.com/media/cache/26/7f/267fcc3bf69f746ce7ad554afa20a755.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Samata Foundation is a leading think tank committed to the development of the marginalized community through research and evidence-based informed policy advocacy. Established in 2009, the Foundation is widely recognized as a hub for Dalit studies and its contributions to promoting equity, inclusion, and rights of marginalized groups in Nepal and the South Asia region."
  },
  {
    "companyName": "Sankata Wine And Beverage Pvt Ltd",
    "logo": "https://merojob.com/media/cache/f2/a3/f2a3bbe71ba8c25786b27e1c75617bb8.jpg",
    "industry": "Manufacturing / Engineering",
    "about": "One of the leading manufacturing company in the beverage and Liquor field.  Canvas wine is the top selling brand in the field of the liquor field. our company was established in the year 2016 under the company act 2063. it has been serving the best quality in the nation"
  },
  {
    "companyName": "Saras Beverage",
    "logo": "https://merojob.com/media/cache/9c/f9/9cf99dfeb5a36cc9f2751f7ec16a053e.jpg",
    "industry": "Beverage and Liquor Industries",
    "about": "Saras Beverages Private Limited is a recently established beverage company based out of Nawalpur District focusing on producing and marketing Carbonated Beverages throughout Nepal."
  },
  {
    "companyName": "Sea links Travels & Tours",
    "logo": "https://merojob.com/media/cache/d3/1f/d31f4749c714f1b2dd5965120f8096cd.jpg",
    "industry": "Travel Agents / Tour Operators",
    "about": "Coming from a humble beginning in the year AD 2007 with a Travel Agency – Sealinks Travels and Tours, the company has since then taken quantum leaps to become one of the leading travel agencies in Nepal. Since the inception of the company, commitment to innovation and excellence in quality of services has been the hallmarks of the company that may be one good reason to expand our service wings under the name of Sealinks Holidays for Outbound and Inbound luxury and leisure travel group.\n\nWe are proud to share that currently Sealinks Travels and Tours; became one of the leading agencies in Nepal. It has its operation office in Nagpokhari, Kathmandu has grown into one of the best travel brands in Nepal. We offer the complete range of travel related services including Ticketing (International and Domestic), Inbound and Outbound Tours, Trekking, Car Rentals, and Helicopter Charter, Mountain Flights and all kinds of adventurous activities and many more."
  },
  {
    "companyName": "Shailung Group of Companies",
    "logo": "https://merojob.com/media/cache/d5/20/d5201a699626ed1a9b4e0d1d45b06bab.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "The Shailung Group of Companies was founded in 1985 with the vision to build a better world. With five operating companies in five core related sectors, we strive to build a better tomorrow for Nepal and the world. Our expertise and focus is in Construction, Hydropower, International trading, Factories and Industries.\n\nShailung Construction\n\nShailung Construction is among the leading construction companies in Nepal with a glorious history of more than three decades of unparalleled contribution to nation building in terms of building and infrastructure projects.\n\nShailung Power\n\nShailung Power  was established to develop, construct and operate power projects both in Nepal as well as internationally. The company on its own and through its subsidiaries has a large portfolio of power generation capacity, both in operation as well as capacity under development.\n\nShailung Enterprises\n\nShailung Enterprises was established mainly for importing and supplying goods and materials to our own company Shailung Construction. The company has been at the forefront in supplying quality construction materials to the construction industry in Nepal. Our vision is to scale up and emerge as the largest trading body in Nepal and expand beyond to the rest of the world by 2020.\n\nShailung Investment\n\nShailung Investment was launched to support upcoming technical and non-technical startups around the world. We partner with innovative founders with unique insights, from inception through all phases of growth. Our portfolio and endeavours encompasses ventures from large state-of-the-art factories, huge real estate ventures, hospitals and hotels and resorts.\n\nShailung Agro\n\nShailung Agro was established contribute towards the development of Nepal’s agro potential and to partner with governmental, commercial entities and farmers in realizing strategic food security and achieving long-term agricultural growth, food sustainability and medicinal development in Nepal"
  },
  {
    "companyName": "Shalimar Group",
    "logo": "https://merojob.com/media/cache/bb/22/bb22f678e88f51127d017529ffd21f04.jpg",
    "industry": "Construction / Real Estate",
    "about": "Shalimar Group, a leading conglomerate of Nepal has diversified interests in various sectors of the nation. Established in the early 1940's, Shalimar Group’s presence is pervasive over Nepal. Primarily involved in the production of construction materials, Shalimar Group has since deviated into various sectors including local and national development. Shalimar Group stands committed to quality and sources its inspiration from the strong values the members of the group embody. The group prides upon its corporate values, work ethics, strong customer relations, and its role in the acceleration of national development."
  },
  {
    "companyName": "Shikhar Organization Limited",
    "logo": "https://merojob.com/media/cache/8b/5f/8b5f237c3758c62dd215ff505687aa30.png",
    "industry": "E-Commerce/ E-Business",
    "about": "Shikhar Organization is a Corporate House that contribute to a lot of sectors of Business including commodity items, Machinery, branded items, and many more Fast-Moving Consumer Goods (FMCG). The idea of the Shikhar organization is far-fetched. In other word, It’s not only a profit-making firm but a life making process."
  },
  {
    "companyName": "SkillsFactory Nepal",
    "logo": "https://merojob.com/media/cache/6c/8c/6c8c2f6d7ae30258817c35ecef89baba.jpg",
    "industry": "Training Institutes",
    "about": "SkillsFactory Nepal was established in 2015 and is a skills training organization affiliated to Council for Technical Education and Vocational Training (CTEVT). SkillsFactory Nepal is registered with the Office of the Company Registrar, Kathmandu and Ministry of Education, Nepal. It is a unique entity in the field of technical and vocational training in Nepal. It not only provides training as is usually done but also supports its trainees for employment and entrepreneurship post training. In addition, we provide services of placing the skilled manpower with individual and institutional clients.\n\nThe core team of SkillsFactory Nepal consists of highly dedicated and professional members with proven experience in the fields of education, innovation and entrepreneurship. With more than two decades of combined experience in this field, the team is dedicated to build this institute as a ‘Centre of excellence in the field of technical and vocational education in Nepal’."
  },
  {
    "companyName": "SKR Group",
    "logo": "https://merojob.com/media/cache/a7/a6/a7a6299f452f625afd66abdf2a93d84c.jpg",
    "industry": "Architecture / Interior Design Firm",
    "about": "SKR Group has been dedicated in providing the highest service to the Clients in Design and Build Industries. Its registered Head Office is in Sanepa Height,Lalitpur.\n\nSKR Group specializes in the management, coordination and delivery of all types of Building Construction Works."
  },
  {
    "companyName": "Subisu",
    "logo": "https://merojob.com/media/cache/5c/30/5c30204ec621ba2cfeb2517c200075f6.jpg",
    "industry": "ISP",
    "about": "Subisu Cablenet Limited was established in 2001. It has 1800 plus full time staff of which 950 plus are technical and 850 plus are non technical and the rest working to provide better services and products to 250,000+ customers. Subisu primarily provides cable & Fiber internet and Digital TV services through a HFC network. High speed internet and 280+ TV channels that it offers provides a strong spine to Nepal’s educational, entertainment, professional and other sectors. The first and the only cable internet service provider in the country and the only cable operator in Nepal to have ISO 9001:2015 and 27001:2013 certifications."
  },
  {
    "companyName": "Sudeep International",
    "logo": "https://merojob.com/media/cache/10/f0/10f0ba9bd0093175bd4ec0a4113625f2.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "Sudeep International was established on 1994 and we have been serving the healthcare sectors (hospitals, research institute, medical center, INGO , NGO)on Nepal for more than 25 years by supplying high quality medical and laboratory products. We are dedicated in the field of laboratory equipment and renowned as complete laboratory solutions in Nepal."
  },
  {
    "companyName": "Teach For Nepal",
    "logo": "https://merojob.com/media/cache/d1/7f/d17f858a81b3b5eee3c2ac4c4602e470.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Teach For Nepal is an education movement with the vision to provide quality education to all children by transforming exceptional Nepalese university graduates and young professionals into inspirational teachers in classrooms and lifelong leaders. TFN invests in its Alumni post-Fellowship to sustain their leadership growth towards an Alumni Movement of collective leadership for systemic change in education in Nepal.\n\nLearn More: www.teachfornepal.org"
  },
  {
    "companyName": "Tech Central",
    "logo": "https://merojob.com/media/cache/36/ba/36ba25fa15aa03cae2f2e046e7a00b64.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Tech Central is a global firm with a diverse portfolio of online brands and more than 20 years of expertise in digital media and online marketing. And we're on the lookout for talented digital media professionals, creative authors, and topic experts to join us in our goal to share information that changes the world for the better."
  },
  {
    "companyName": "Telemko Autolink",
    "logo": "https://merojob.com/media/cache/a1/e9/a1e9ca469c61dc90ea414580b59a55a0.jpg",
    "industry": "Information / Computer / Technology",
    "about": "We are telematics-based company. We provide transport management system based on GPS tracking and real-time vehicle monitoring and control. We provide world class hardware and software technology with exceptional customer service. We help our customers to reduce vehicle’s expense and increase revenue with our solutions.\n\nAlong with it we provide SAAS based software services to our customer mainly in transportation sector."
  },
  {
    "companyName": "Thakur International",
    "logo": "https://merojob.com/media/cache/43/65/4365046a171f3e700ede9b42298d1b69.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Thakur International is a reflection of our initial idea that connects three major hoops: the environment, the information technology, and the business. The anticipation of the future and its pessimistic visualization was a reason for us to input the efforts in order to clear the fog from our home planet future’s outlook and present the idea of this company’s officialization. From the moment it has officially established, in 2013, the company showed the potential to grow and to go outside of the Nepal’s borders. We are aware that we have the supporters all around the world: even if they don’t have a direct contribution to this company, their silence is a proof of the acceptance and support."
  },
  {
    "companyName": "The Association of Chartered Accountants of Nepal",
    "logo": "https://merojob.com/media/cache/10/79/1079a6bafe9d5e035ed8261a41c95dc1.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "The Association of Chartered Accountants of Nepal (ACAN) was established in 2034 with a non-profit objective. ACAN believes in promoting knowledge and creating awareness of the changes taking place in the economy by organizing workshops, seminars and talk programs of professional interest to help the professionals and members of this association to be competitive in the business arena. ACAN aims at developing, promoting, protecting the accounting profession, making its members united, and protecting their interest."
  },
  {
    "companyName": "Themattic Info Pvt. Ltd",
    "logo": "https://merojob.com/media/cache/36/d3/36d3abf8f6ba259e850a9dd2807e03f4.webp",
    "industry": "Software Companies",
    "about": "We have been creating WordPress themes since 2016. Ever since we released our first theme, we’ve been continuously working on better themes, functionality, and designs based on our client's needs. We specialize in clean, well-coded, and user-friendly responsive WordPress themes that are easy to use, customizable, and optimized for all."
  },
  {
    "companyName": "ThemeGrill",
    "logo": "https://merojob.com/media/cache/e9/2f/e92fd4ca7adb4bb1695a2d6af9c12f49.jpg",
    "industry": "Software Companies",
    "about": "ThemeGrill (themegrill.com) is one of the leading WordPress Themes/Plugins webshops in the world (yes, not just of Nepal). Our themes/plugins have been loved by people all around the globe. Currently, our themes empower more than 400,000 sites and get over 5000 plus downloads on a daily basis.  \n\nThemeGrill is a team of the young and energetic people. Here, we not only work in a fun way but also help each other for the growth and development of an individual’s potential. So, if you are a young enthusiast desiring to take your career higher in the WordPress industry, ThemeGrill is the right place for you."
  },
  {
    "companyName": "Third Pole Research And Consulting Pvt.Ltd",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Consulting / Legal",
    "about": "Research and Consulting ."
  },
  {
    "companyName": "Top Nepal International",
    "logo": "https://merojob.com/media/cache/aa/3f/aa3ffceeb15fa9fad74dd7e98888e282.png",
    "industry": "Information / Computer / Technology",
    "about": "TOP Nepal International P. Ltd is an ISO 9001:2015 (QMS) Certified, Digital Web Media agency based in Sukedhara, Kathmandu and collaboration with different organizations from the USA, Canada, Portugal and many more. We are more than 70+ working team. Our mission is to build a flexible, Stress free and responsible workspace where you can contribute your time. We strongly believe that \"Employee is the real partner without Investment.\""
  },
  {
    "companyName": "Trinity International College",
    "logo": "https://merojob.com/media/cache/ec/3c/ec3c3b819b83d1e5e8343832798682eb.jpg",
    "industry": "Education - School & Colleges",
    "about": "Trinity International SS & College is the leading College in Nepal for qualitative +2 NEB and Cambridge A Levels at the higher secondary stage. It also offers graduate level programs: Tribhuvan University BSc CSIT, BBM, BCA, BBS, and BA. Trinity stands for academic accomplishment. The College has a congenial environment, state-of-the-art infrastructure, and reputed faculty. Managed by a devoted team of professionals advised by outstanding national and foreign advisors, the institution ensures student requirement and academic support go hand in hand. Trinity and its programs are hugely popular. Doing +2 or A Levels here after SEE is the wish of many of the best students from all over Nepal and even abroad. Our graduate programs are now in great demand."
  },
  {
    "companyName": "Trishakti Cable Industries",
    "logo": "https://merojob.com/media/cache/2d/0a/2d0affeef4c1ea2d2ab1775e82bf2cb6.jpg",
    "industry": "ISP",
    "about": "Trishakti Cable Industries is one of the best wire manufacturing company in Nepal. P.VC. House wiring Cable, Flexiblex Multi Strand Cable, Auto Cable, Telephone T.V Cable, Power Cable, Concentric Cable, Control Cable, and Copper strip, Stay Wire, ABC cablex etc."
  },
  {
    "companyName": "Tulips Technologies",
    "logo": "https://merojob.com/media/cache/cc/e9/cce93538cedda75df9bf683c6bd9f0cc.jpg",
    "industry": "Software Companies",
    "about": "We are a socially responsible IT outsourcing company working in the latest technologies with main customer base in Sweden. Our top priority is to work in the projects with positive social impact. Our team of experts love to work in contemporary technologies which poses lot of challenges.\n\nWe are highly focused on high-end web development, mobile apps and web applications. It has all been successful due to our dedicated team who are talented, challenge-lovers, and on top of that who keep customers’ needs in the highest priority."
  },
  {
    "companyName": "UBA Solutions",
    "logo": "https://merojob.com/media/cache/93/30/93307f9880c93b674dd3046dc2114233.jpg",
    "industry": "Software Companies",
    "about": "UBA Solutions incorporated on February 12, 2006, is one of the pioneer IT companies of Nepal. UBA Solutions is a Monotype Partner Company working in collaboration with Monotype Inc. since 2009. Monotype Inc. is a US-based multinational company whose headquarter is in Boston, MA; and has offices in India, USA, Korea, UK, Germany, China, Japan and Nepal.\n\nAt UBA Solutions, we offer an entrepreneurial environment where technology professionals thrive and where individual contributions really count. Our employees create and help shape some of the most cutting edge technologies every day.\n\nAs a partner of Monotype, our engineering teams use best in class advanced techniques and tools in Continuous Integration, LAMP, Node.JS, AWS, Reactjs and automated test solutions in the entire spectrum of solutions in areas like cloud services, e-commerce, embedded systems, digital advertising and brand engagement."
  },
  {
    "companyName": "Unitech Media",
    "logo": "https://merojob.com/media/cache/77/98/7798bc0eb3bf51486f220116bffa788a.jpg",
    "industry": "Designing / Printing / Publishing",
    "about": "Unitech Media was established in 2012. Back then, we were a media team when ads used to be either print or broadcast. As digital world has overtaken the grip in every business and communication, we came with vision to make Nepal a Digitally smart county. Now we are an active Branding Company handling every ad medium and brand identity, including diverse modern platforms of Digital Marketing.\n\nWe have evolved as potential mass exposure station, which stands for overall solution regarding corporate identity, branding and activation with extremely creative components for online as well as offline media. We are extensive media server founded to provide holistic and fine edge service to our clients and enhance values regarding digital marketing in Nepal.\n\nVISION TO MAKE NEPAL A DIGITALLY SMART COUNTRY"
  },
  {
    "companyName": "United Mission to Nepal",
    "logo": "https://merojob.com/media/cache/d9/ff/d9ff5c880ca496ac40bef0827839b513.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "United Mission to Nepal (UMN) is an international development organisation which aims to enable the poorest people living in poverty to transform their lives, leading towards fullness of life. As we serve the people of Nepal, multicultural teams of Nepali and volunteer expatriate staff work alongside local organisations in eight districts (six clusters and two hospitals), building partnerships that lead to healthy, dignified, and empowered individuals and transformed communities."
  },
  {
    "companyName": "Vaishali Trade Links",
    "logo": "https://merojob.com/media/cache/df/05/df05a21f5c3f293e5731a5986dc881a3.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "Vaishali Trade Links Pvt Ltd is an import trading company that imports 4-wheeler commercial vehicle tires and distribute all over Nepal."
  },
  {
    "companyName": "Vedanshee Infrastructure",
    "logo": "https://merojob.com/media/cache/06/44/06443377542759b7d92f5b4a039055b2.jpg",
    "industry": "Construction / Real Estate",
    "about": "Vedanshee Infrastructure Pvt. Ltd., a subsidiary of Kalika Group and Kalika Construction, is looking for future leaders in the following position:"
  },
  {
    "companyName": "Verisk Nepal",
    "logo": "https://merojob.com/media/cache/e6/90/e690017b1e4983b38a17745f4c68262f.jpg",
    "industry": "Software Companies",
    "about": "Verisk Nepal is the software development and information technology (IT) service support center for Verisk Analytics. We’re a dedicated team of software and IT professionals who provide technical support to Verisk’s businesses. At Verisk Nepal, we help our internal clients focus on their business solutions while we focus on the technology. Verisk Nepal is a wholly owned subsidiary of ISO, a Verisk Analytics business."
  },
  {
    "companyName": "Vertical Biodiversity Fund",
    "logo": "https://merojob.com/media/cache/f7/31/f731120cf2ac8809e1846e6a70ba5736.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "The Vertical Biodiversity Fund (VBF) is a non-profit company (a hybrid entity) based in the Eastern Region of Nepal registered in 2017. We are working with farmers, youth, and local communities across a vertical gradient from Koshi Tappu to Kanchenjunga to protect the natural environment and to support farmers to grow organic and nutritious fruits and vegetables. In collaboration with KTK-BELT, the goal of the VBF is to become the Nepali operational entity to run the “Vertical University project” in collaboration with other local partners and stakeholders."
  },
  {
    "companyName": "View9",
    "logo": "https://merojob.com/media/cache/20/97/2097bd4b768614cc959a44ac050d6e8b.png",
    "industry": "Information / Computer / Technology",
    "about": "View9 is a passionate and award winning team of creative thinkers and digital experts united to provide high quality and trustworthy services in the areas of web, software and mobile apps. We work with business of all sizes, from small startups, medium sized businesses delivering both B2B and B2C digital solutions. With our offices in Kathmandu, Brisbane, Sydney and New York, we have been able to serve clients of large geographic spans."
  },
  {
    "companyName": "Whats Next",
    "logo": "https://merojob.com/media/cache/b2/80/b28094c7f16cfbe4490e86f2dfd2f142.jpg",
    "industry": "Finance Companies",
    "about": "We are a dynamic investment group with many business portfolios in Nepal. \n\nCurrently we are looking for a person who is passionate, committed, self-motivated and efficient to join our team to lead the business."
  },
  {
    "companyName": "WhiteHat Engineering Inc.",
    "logo": "https://merojob.com/media/cache/00/25/00259cfb628129c94bf623fd188e68e5.jpg",
    "industry": "Information / Computer / Technology",
    "about": "We are a USA-based blockchain startup technology company. We are a crypto tax product that helps individual cryptocurrency investors and accountants with their tax filings. We have thousands of customers and have processed over $1B of transactions. We are a venture backed, 15-person team, established in 2017. We work with Big 4 accounting firms, large CPA firms, wealthy investors, and everyday traders. We are growing fast and are looking for great team members!"
  },
  {
    "companyName": "Wongchhu Peak Promotion",
    "logo": "https://merojob.com/media/cache/cf/a8/cfa8616a4081813b57145ec6a086ace7.png",
    "industry": "Travel Agents / Tour Operators",
    "about": "Wongchhu Peak Promotion was founded by the late Mr. Wongchhu Sherpa, who had many years of experience in the field of mountaineering expeditions, trekking, filming & tour packaging. Wongchhu Peak Promotion is one of the leading government recognized trekking and mountaineering agency in Nepal. We rely on \"May all who enter as our guests leave as our friends & families\".."
  },
  {
    "companyName": "World Distribution Nepal",
    "logo": "https://merojob.com/media/cache/b9/03/b90390cb5cfa8ea3acc3ef2fc10277bb.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "World Distribution Nepal Pvt. Ltd. (WDN) is a company established in 1995 by a team of young and energetic novices’ with an intention of developing computer software along with IT products and solutions. By now, the company has grown into one of the largest IT solutions company offering IT products, solutions and services in the country and the overseas. With the mission to ensure quality products and services we have been offering our products and services in various sectors like the financial services, manufacturing, telecom, utilities, government, non-government, INGOs, projects and other service provider industrial sectors.\n\nWDN is a premier ‘Technology Solution Provider and Business System’ to small, medium and large enterprises in Nepal. WDN is also an industry leading enterprise and telecom solutions provider, in partnership with Oracle Corporations, Dell Computers, Dell EMC, Toshiba, Cisco systems, Diebold Nixdorf, SafeNet, NBS technologies, Juniper and F5. WDN provides industry-leading products, Converged/Hyper-converged, Cloud Services, open standard based, cost effective business integration services to integrate desired IT components developed across different platform. WDN is also capable of handling large-scale projects and government tenders, also liaising large overseas enterprises. Henceforth, few in our name lists successfully executed are Access Network, Fixed Intelligent Network, GSM, transmission, Billing and provisioning and Customer care, Value added services, AVL Tracking system, Land mapping, SMS gateway, and many more.\n\nWDN's impressive list of clients include Financial Institutions, Basic fixed and cellular operator projects, Utilities companies, Governmental Organizations, UN organizations, Embassies, Donor agencies, INGOS and NGOs."
  },
  {
    "companyName": "WorldLink Communications",
    "logo": "https://merojob.com/media/cache/b4/1b/b41bb9fd52055ca0496f0de8e9b44d8d.jpg",
    "industry": "ISP",
    "about": "WorldLink is the largest Internet and Network Service Provider in Nepal and one of the most prominent IT companies. Founded in September 1995 with the aim of providing Internet and IT services by its present Chairman and Managing Director, Dileep Agrawal. WorldLink started off by providing store-and-forward e-mail services over a dial-up link to the Internet in the US. In March 1997, WorldLink started providing full Internet access over a dedicated leased-line to the Internet backbone in the US through Teleglobe International. From September 1999 till June 2008, WorldLink has been connecting to the Internet over a direct satellite uplink through its own VSAT terminal, thereby completely bypassing Nepal Telecommunications Corporation, the local PTT.\n\nWorldLink serves households, small and medium-sized enterprises (SMEs) and enterprise clients. It is the fastest-growing private ISP in the country and has a presence in 67 districts out of country’s 77 districts. Currently Worldlink has around 300,000 household subscribers spread across the country. The company plans to reach all the local bodies by end of 2023.\n\nSince 2012, WorldLink has rolled out a fibre to the home (FTTH) network, which it intends to expand across Province 3 and 4 towns and rural areas at affordable prices."
  },
  {
    "companyName": "Wrief Consultancy",
    "logo": "https://merojob.com/media/cache/bf/d2/bfd20c33b2d6ae2d32b9735d30b61b33.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "WRIEF PVT. LTD. is a leading consultancy in the Canada Immigration field that has been playing vital role in serving right guidance and professional counselling as a good guardian since last 11 years. WRIEF always believes and applies highly reliable and well experienced professional services to the people for achieving successful outcomes forever. Our concern is not to believe on only just collecting an application, providing unprofessional information and leading our valued customers in unreliable way to promote the business. Regarding the fact, WRIEF announces to all abroad opportunity seekers to choose a right platform in the right time to become a permanent resident in your dream land “Canada”. This is really a vigorous opportunity to immigrate to Canada under the Saskatchewan Immigrant Nominee Program (SINP) Application sub category International Skilled Worker: Occupation In-Demand. It is informed that there is no any CAP system and deadline for the application processing. So, do not make any delay to apply as offered"
  },
  {
    "companyName": "WSP USA Solution",
    "logo": "https://merojob.com/media/cache/2d/b6/2db6270c5a398b98f73b9bbac739f24a.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Skills for Employment Programme (SEP) seeks applications from suitable candidates under the following position:"
  },
  {
    "companyName": "Yagiten Pvt. Ltd.",
    "logo": "https://merojob.com/media/cache/7c/ca/7cca4c34cdf981a3852426e0ebbbb1ab.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Incepted in 2010, Yagiten  (Pvt) Ltd is a leading Development & Design expert company providing superior Software, Web, Mobile Application and Creative Designing solutions and services to companies globally. Having a strong Technology Development and Innovation center in Nepal and with more than 250+ satisfied clients worldwide, ranging from startups - fortune 100+ companies across diverse industries, Yagiten has made its mark as a well-established and sound company driven by the industry’s highly professional and trained individuals and is surely headed in becoming a leading organization which facilitates, enhances and provides measurable business value to customers through most effective uses of technology and Resources to organizations globally.\n\nHighly skilled intellectual personnel, most having substantial work experience in diverse areas of Information Technology make up our team. Our management ensures that each individual excels in their specific assigned tasks by working closely with them. Only those individuals are hired who not only possess strong technical and analytical skills, high intellect, sound work ethics and integrity but also who have confidence, decision making abilities and above all the drive to excel whether it is at the management level or at a technology/software development position."
  },
  {
    "companyName": "ZenNepal",
    "logo": "https://merojob.com/media/cache/c4/58/c458d3a1841bcf68a34998e9e1d3b299.png",
    "industry": "Travel Agents / Tour Operators",
    "about": "Zen Nepal is one of the reputed Travel Agency located at Thamel, Kathmandu.Zen Nepal seeks application from enthusiastic, competent and qualified candidates for the following position:\n\nFor more details please visit our website: http://zennepal.com/ or http://zentravels.com/"
  },
  {
    "companyName": "ZTE Corporation",
    "logo": "https://merojob.com/media/cache/9c/31/9c31deabba321f4551b786af1c2462d0.jpg",
    "industry": "Multinational Companies",
    "about": "ZTE Corporation is China's largest listed telecommunications equipment provider specializing in offering customized network solutions for telecom carriers worldwide. The company develops and manufactures telecommunications equipment for fixed, mobile, data and optical networks, intelligent networks and next generation networks as well as mobile phones. ZTE has been listed on the Shenzhen Stock Exchange since 1997. Today, ZTE has become an important global player in the telecommunications industry with products deployed in over 40 countries and regions including Cyprus, Bangladesh, Thailand, USA, Russia, Egypt, Kenya, Congo, Zambia and Hong Kong. ZTE's respected position as a forward looking global organization within the industry is also reflected by membership of, and participation in, a variety of International Organizations of Standardization. ZTE was the first Chinese individual manufacturer member of 3GPP2 (3rd Generation Partnership 2) and has become a sector member of the International Telecommunications Union (ITU). ZTE is committed to the future of the telecommunications industry, and will continue to develop and expand its global operations to ensure that partners everywhere will have the most effective solutions both now and in the years to come."
  }
]