[
  {
    "companyName": "ABC Consulting",
    "logo": "https://merojob.com/media/cache/0a/f7/0af75ff6ff2ba30716aa0da548d90e1d.jpg",
    "industry": "Research Firms",
    "about": "Consulting firm for Information Technology."
  },
  {
    "companyName": "Academia International College",
    "logo": "https://merojob.com/media/cache/5f/4c/5f4c6bdf2961f99c756276f9b7aacd83.jpg",
    "industry": "Education - School & Colleges",
    "about": "Academia International College, affiliated with Tribhuvan University, is one of the premier institutions dedicated to providing quality education in a fully-integrated, multicultural environment. The College occupies spacious area at Lalitpur with excellent facilities. In our Graduate School, we are one of the pioneer institutes in Nepal to introduce B.Sc. CSIT program offered by Tribhuvan University.\n\nAcademia International College is committed to achieving excellence in the academic development of students and professionals. We strongly believe that the Academic Programs at Academia is going to acquire a distinguished reputation of being the most rigorous and fulfilling course in this category."
  },
  {
    "companyName": "Agile Solutions",
    "logo": "https://merojob.com/media/cache/f3/7b/f37b015c85005e53719bf43d930d3fdf.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Agile Solutions is a professional IT and business consulting company that delivers proven and innovative business solutions to increase the customers’ productivity optimizing processes, technologies and people. It offers a set of Consulting, Technology and Outsourcing services, specialized by Industries, using the Microsoft Dynamics ERP/CRM platform and Business Intelligence/Data Analytics applications in the entire business processes life-cycle."
  },
  {
    "companyName": "Agni Equipment Pvt. Ltd.",
    "logo": "https://merojob.com/media/cache/db/84/db840b21e2d84945efd9ae058eeed56a.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "Agni Equipment Pvt. Ltd., was established in 2018. It is a part of Agni Group of companies.\n\nOur core business is in the field of Tools & Equipment (Sales, Spares & Service) for the purpose of Construction & Demolition, Automotive, Carpentry, etc. Agni Equipment Pvt. Ltd. is the sole authorized distributor in Nepal for the following brands:\n\nMILWAUKEE TOOLS\nAEG POWER TOOLS\nBLACK MAX\nHUSQVARNA (Light Compaction & Concrete)"
  },
  {
    "companyName": "Alfa Beta Institute",
    "logo": "https://merojob.com/media/cache/9d/bb/9dbb9ace3ad93e192dcef73a8f298a9c.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Alfa Beta has gloriously completed 30 years in the field of International Education Consulting and is proudly representing more than 300 institutions from over 18 countries. Since its establishment, the organization has been dedicated to helping students make the right choice of their education and future careers globally. \n\nAs a member of the AIRC and Prometric authorized Service Provider, we follow a very strict guideline of operations and have developed our working procedures accordingly. In these years we have grown to ten centers across the country and an onshore center in Sydney Australia. We are today the largest study abroad and test preparation center in Nepal touching and changing the lives of over ten thousand students annually.\n\nAwarded with “Nepal’s No.1 Business Partner” for 2017, 2018 and again in 2019 by IDP IELTS we have also been trusted by global organizations such as Pearson and ETS who have authorized us to run their test centers at our premises. \n\nWe believe that there is a tremendous potential in every individual and all that is needed to tap this potential is to give the individual the space to grow and explore."
  },
  {
    "companyName": "Alliance Human Resources",
    "logo": "https://merojob.com/media/cache/0d/5a/0d5abefe4f867ac4afefd73886a987c5.jpg",
    "industry": "Manpower Recruitment",
    "about": "Alliance Human Resources Pvt. Ltd. (AHR) with Recruiting License Number 690/063/064 was registered in 2006 AD at the Company Registrar’s office in Kathmandu, Nepal. We are duly authorized by the Department of Foreign Employment, Ministry of Labor and Social Security of the Government of Nepal to carry out recruitment of Nepalese manpower for foreign employment.\n\nSince our inception, we have extensively partnered with local, regional and multinational companies in GCC & Middle East, South East Asia, Far East, North Africa and Europe. Today, we specialize in manpower sourcing, vetting, industrial skills training, visa services, regulation & compliance, diagnostic services, and travel management serving four major domains:"
  },
  {
    "companyName": "American Online Service and Consultant",
    "logo": "https://merojob.com/media/cache/68/c2/68c2ec9b0370a0c61bd9ac0221c578d5.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "UAS VISA Consultant"
  },
  {
    "companyName": "Annofi Technologies",
    "logo": "https://merojob.com/media/cache/9d/88/9d88712508f200b48f7accd3564133fc.jpg",
    "industry": "Information / Computer / Technology",
    "about": "We are an IT Startup company inspired to innovate. As we live through an era where our interactions with our environments and surroundings are changing with the availability of technologies that are here to make our life easier and better. We want to participate in this opportunity to serve our community and environments with products that are relevant and have a significant impact while conducting their way of life."
  },
  {
    "companyName": "Aqore Software",
    "logo": "https://merojob.com/media/cache/e9/41/e941fcf1d5ad45e0da10119d816da1bc.jpg",
    "industry": "Software Companies",
    "about": "Aqore is a company founded by 2 successful software entrepreneurs with a proven record of building an international product used by thousands of users in the US and Canada. \nCompany is in process of procuring resources to build yet another product targeted for international market. \nWith a work hard/play hard motto we expect employees to grow with the company. Selected group of individuals will be working in multiple small agile startup teams.\n\nRun and managed by people with cumulative 50 years of industry and technical experience.\nCollaborative expertise in enterprise level product delivery, migration and security solutions\nOffer best solutions to clients to support their industry goals.\n\nEmployee Benefits:\n\nCompetitive Salary\nMedical Insurance\nLunch Allowance\nTeam Building events\nSports events\nCIT Option\nFlexible work environment\nVarious Skill Development Training\n\nWork Culture:\n\nYoung and dynamic work culture\nWork hard, play hard\nRight person for the right job\nGrow with us\nPassionate, committed and creative culture"
  },
  {
    "companyName": "Asian Paints (Nepal)",
    "logo": "https://merojob.com/media/cache/48/c0/48c0b03514c0e60506b80cc642a818e9.jpg",
    "industry": "Multinational Companies",
    "about": "Asian Paints (Nepal) Pvt. Ltd. started its operation in 1983. It is a subsidiary company of Asian Paints Ltd. in India. It is the largest paint company in Nepal with its manufacturing facility located at Hetauda Industrial Estate.\n\nCertified under ISO:9001:2015,ISO:14001:2015 & ISO 45001:2018, the company also has certification of approval for most of its products from Nepal Bureau of Standards and Metrology.\n\n \n\nThe company has been a clear pioneer of innovation in Nepal. It leverages its worldwide experience to deliver products of international quality & range to the Nepali consumers at a reasonable price. Asian Paints manufactures complete range of decorative products. The outlets are spread across all the major towns of Nepal."
  },
  {
    "companyName": "Aspark Systems",
    "logo": "https://merojob.com/media/cache/16/fa/16fa004bd1039db1b27fc8ab9b2dad99.jpg",
    "industry": "Software Companies",
    "about": "Aspark Systems is an IT company that is specialized in software development and IT solutions. We are based in Kathmandu since 2021, providing different IT solutions, mobile app development, website development, eCommerce development, HR software service, and LMS web application. With the connection of the best programmers and Software Engineers in Nepal, we have a great team that can transform any ideas into customized software at the most affordable price. We are actively developing software and applications using Django, Flutter, MERN, Figma and many more. We pride ourselves on creating high-quality, robust systems that can be tailored to any client's individual requirements. Our team has extensive experience of working with clients at every stage of their ideas and products, from the initial concept to deploying it worldwide."
  },
  {
    "companyName": "Ayaan Traders Pvt. Ltd",
    "logo": "https://merojob.com/media/cache/72/cf/72cfaf18240bb22646d6e52bebb0a4fb.png",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "- Trading Company\n\n- Import and distribution all over Nepal\n\n- Life Style Brand"
  },
  {
    "companyName": "Bhanu Secondary English Boarding School",
    "logo": "https://merojob.com/media/cache/3a/85/3a85f3857a2cbc9a755a7dd3f0666a56.png",
    "industry": "Education - School & Colleges",
    "about": "Bhanu Secondary English Boarding School is the first private English medium school around the surrounding which is going on with keen and clear vision about the qualitative education since its origin time. This School has cared enviable niche at the summit of good school through the clear aim, objectives and sincere labor and dedication of the team of academia excellent manpower .\n\nThis school is situated on out skirts of the bazaar area and quite .Here students do labor thought out every year heaving the Concept of learn and serve with the company of friendly local and out teacher.\n\nThe school has excellent infrastructure. It has modern academic buildings with spacious classrooms, Laboratories, library, administrative offices, and hostel buildings. Moreover with the sincere labor and dedicated academic excellent, trained manpower modern technologies, e-classes, smartboards, sports etc are available for the overall development of our students."
  },
  {
    "companyName": "bhawani shankar motors pvt.ltd",
    "logo": "https://merojob.com/media/cache/c0/bb/c0bb0c071bb97672f80b60925b96deb3.png",
    "industry": "Automotive Sales, Support & Service",
    "about": "Bhawani Shankar Motors Pvt. Ltd. is a group of emerging professional organizations. Together we have united for a noble goal to replace clean Green vehicles in place of polluting vehicles.\n\nThe management of this company values producer’s effort in producing innovative products and assure the utmost possible return on their valuable products.\n\n\nThis company is the most trustable and most reliable platform for the producer to sell their innovative electric vehicles."
  },
  {
    "companyName": "Bhim Tech",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Information / Computer / Technology",
    "about": "We are Bhim Tech. We Make Your Online Presence Matter.\n\nWe build websites.\n\nWe do Digital Marketing.\n\nWe build brand and values around trust and honesty."
  },
  {
    "companyName": "Big Mart",
    "logo": "https://merojob.com/media/cache/c8/5e/c85eae7198c52beefc51f6adb0e65937.jpg",
    "industry": "Retail / Shops",
    "about": "BIG MART is a chain of supermarkets operating in various parts of Kathmandu, Lalitpur and Bhaktapur. With some explosive growth targets, Big mart is in constant lookout to expand its ever growing team of professionals. We are currently looking for exceptional people who are willing to take on responsibility and play an active role in our success as we continue to grow."
  },
  {
    "companyName": "Bindu Hardware and Sanitary",
    "logo": "https://merojob.com/media/cache/33/52/3352d488d95df0cbae7192d4221d9063.jpg",
    "industry": "Retail / Shops",
    "about": "Bindu Hardware and Sanitary is the Nepal’s largest multi-brand showroom, where we strive to delight customer with our wide array of products, and excellent services since 26 yrs. It’s main office is located on the heart of the city at Koteshwor.\n\nWe are happy to say that we have been able to serve our customer on this regard since two decades. We are dedicated to assist our customer in selecting the best product for them and also provide the best class quality items in a comparative price. One thing has always remained constant our commitment to quality and satisfaction of customer. With over 26 years of experience in this business, we have a wealth of experience to advise you on your choice of product.\n\nTremendous change along with greater experience leads us to establish our-self as Nepal’s largest multi-brand showroom. Distribution of brand has been expanded along with proactive and after sales service. Customer have various option of selecting items from different brands, design, size, price and quality.\n\nRegarding our products we are the distributors of different multinational companies like  Jaquar, Kohler, Nepatop, NITCO and Somany. Beside this we are directly importing sanitary and tiles like Octiva, Simora, Navarang, Motto, Vida, Elica,& Elegant from different countries."
  },
  {
    "companyName": "Biocomp Nepal Pvt Ltd",
    "logo": "https://merojob.com/media/cache/cf/f4/cff4c2124f95ab1e6b9faa2e3dfccab5.jpg",
    "industry": "Other",
    "about": "Biocomp Nepal Pvt. Ltd. is a social enterprise in Lalitpur working in waste management and recycling. Our mission is to introduce sustainable waste management solutions and create new innovative products from recyclables for the local market. Biocomp is growing its business in the production of organic fertilizers and expanding to the collection and recycling of solid waste such as plastic. Biocomp has a vacancy for an accountant to support us in all aspects of accounting, financial reporting, banking, data management, legal compliance and to make our administrative systems ready for scale up.\n\nBiocomp currently has an all male management team, therefore we specifically encourage women to apply for this position."
  },
  {
    "companyName": "Bird Conservation Nepal",
    "logo": "https://merojob.com/media/cache/cc/16/cc167193af8ead80865c67c338e776c9.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Established in 1982, Bird Conservation Nepal (BCN) is the leading organization in Nepal, focusing on the conservation of birds, their habitats and sites. It seeks to promote interest in birds amongst the general public, encourage research on birds and identify major threats to birds' continued survival. As a result, we are the foremost scientific authority providing accurate information on birds and their habitats throughout Nepal. We provide scientific data and expertise on birds for the Government of Nepal through the Department of National Parks and Wildlife Conservation (DNPWC) and work closely in birds and biodiversity conservation throughout the country.\n\nBCN is a membership-based organization with a Founder President, patrons, life members, friends of BCN and several supporters. Our membership provides strength to the society and is drawn from people of all walks of life from students, professionals and conservationists. Our members act collectively to set the organization's strategic agenda.\n\nWe are committed to showing the value of birds and their special relationship with people. As such, we strongly advocate the need for peoples' participation as future stewards to attain long-term conservation goals.\n\nAs the Nepalese Partner of Birdlife International, a network of more than 110 organizations around the world, BCN also works on a worldwide agenda to conserve the world's birds and their habitats."
  },
  {
    "companyName": "BI-SOLUTIONS",
    "logo": "https://merojob.com/media/cache/50/22/50223ac15c6e8481cebae62e4eae701f.jpg",
    "industry": "Information / Computer / Technology",
    "about": "BI-SOLUTIONS is looking for a dynamic and competitive candidates for the following position:"
  },
  {
    "companyName": "Bitskraft",
    "logo": "https://merojob.com/media/cache/f9/96/f996f42f4c49dabf186bb1c7ff1bc138.jpg",
    "industry": "Information / Computer / Technology",
    "about": "BitsKraft is a global provider of software-based innovation engineering services using disruptive technologies such as Machine Learning & AI, Big Data, the Cloud, the Internet of Things (IoT), Blockchain and Serverless Computing. With experts in Java, Python, JavaScript frameworks, Microservices and containers such as Docker and Kubernetes. Bitskraft has mastered the tools and process needed to successfully implement disruptive technologies. BitsKraft serves companies in Financial Services, Healthcare, Retail, Media, Recruitment and Technology industries."
  },
  {
    "companyName": "Bodhisattva Vihara (BV)",
    "logo": "https://merojob.com/media/cache/f5/e2/f5e285671da0013b570754614b3b9bf4.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Bodhisattva Vihara (BV), a Buddhist Monastery based in Budhanilkantha, Kathmandu is established to provide traditional Buddhist training also concentrating on a full modern education system. Our monastery is looking for following candidate for immediate appointment"
  },
  {
    "companyName": "Bravo Connecting Digitally",
    "logo": "https://merojob.com/media/cache/ac/5c/ac5c8f2325a3e92ad7cee5636feabd42.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Group  of company"
  },
  {
    "companyName": "Brihaspati Vidyasadan",
    "logo": "https://merojob.com/media/cache/f9/5e/f95e28243925015bd4cbe6611a41ebdc.jpg",
    "industry": "Education - School & Colleges",
    "about": "Situated in the heart of Kathmandu valley, Brihaspati Vidyasadan (BVS) is ranked amongst the top 10 schools of Nepal. Consistently for the past 36 years, BVS has delivered high academic standards in SLC and strives to combine traditional and progressive pedagogy. With high emphasis on sports and extra curriculum, students from BVS excel in plethora of fields including sports, academics and arts. To support the students learning, BVS has excellent infrastructure and highly experienced team of teachers and coordinators. Every student is special at BVS. With more than 100 teaching staff at school, every child is provided with care and guidance they need. \n\n Vision: \n\n Imparting quality education and nurturing human values. \n\nMission: We explore the potential of individual students and promote excellence in all walks of life. \n\n We fulfill our mission by, \n\nOffering a rich academic, co-curricular and extra-curricular experiences that require active participation and personal commitment, extending learning beyond the traditional classroom. \nA balance of emphases on mind, body and spirit encouraging students to grow into a healthy, happy, caring and whole adults ready and unafraid to lead. \nStriving on building self-confidence and empowering students with skills, knowledge and enthusiasm to be life-long learners."
  },
  {
    "companyName": "Brilliant Lighting Industry",
    "logo": "https://merojob.com/media/cache/f3/9b/f39b76550a60ecfee42c994d1d5ae172.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "BRILLIANT LED is a leading manufacturer, importer and distributor of lighting and electrical products such as LED Panel Lights, LED Surface Lights, LED COB Downlighters, Flood Lights, Street Lights, LED Strips. Our entire range of products are manufactured in our in house state of the art of facilities. We have a wide dealer network and dedicated service points spread across Nepal."
  },
  {
    "companyName": "Broadway Infosys Nepal",
    "logo": "https://merojob.com/media/cache/af/36/af36b7e1355ad7320b4234d7d49b2197.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Broadway Infosys Nepal is one of the best inclusive computer training institutes in Kathmandu, Nepal. Established in 2008, our professional IT Training and Development center has been employing experts in this field to impart professional education to trainees. We offer well-structured complete professional training in various programming languages, graphics & multimedia, web designing as well as development and hardware, networking training that is based upon the current recruitment needs in the IT market.\n\nTo summarize, Broadway Infosys is a complete learning institute that not only provides training on various IT courses but also prepares students to smartly handle the real working environment. We are dedicated and committed towards:\n\nProviding quality IT training to the aspiring IT professionals\nAvailability of highly qualified and experienced instructors\nAssigning project works as per the nature of the courses\nConducting regular project work evaluation sessions\nIdentifying trainees’ skills and knowledge gaps\nTaking corrective actions to enhance trainees’ skills\nProviding internship and job placement facilities to the trainees\nBuilding long-term trustful relationship with the trainees\n\nSince establishment, we have successfully established and maintained network with more than fifty IT and other companies which has made us able to offer and provide our students with internship and job opportunities."
  },
  {
    "companyName": "Buddha Tech Private Limited",
    "logo": "https://merojob.com/media/cache/39/a0/39a00c6baf47cea53b007281b02ea838.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Buddha Tech, a sister company of Buddha Air was established in November 2021 to promote digital transformation as businesses around the world are constantly under pressure to add creative, technologically driven and real-time capabilities to their systems in order to respond to market opportunities in a globally connected, on-demand environment with rapid improvements in Internet technologies.\n\nAt Buddha Tech, our mission is to accelerate digital excellence with best-in-class bespoke solutions. Our expertise rests in collaborating with clients to update infrastructure, enable teams to accomplish more, and assist in developing solutions to boost lifetime value."
  },
  {
    "companyName": "Bugv Software Technologies",
    "logo": "https://merojob.com/media/cache/57/1a/571a282f641ba0bb168c309a0dab2ebf.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Bugv is the vulnerability coordination and bug bounty platform that connects businesses with penetration testers and cybersecurity researchers. Bugv is founded with the vision to improve the security infrastructures in the country. We partner with the global hacker community to surface the most relevant security issues of our customers before they get exploited by others."
  },
  {
    "companyName": "Builders mart nepal",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Construction / Real Estate",
    "about": "It is an e-commerce company."
  },
  {
    "companyName": "Business Interest Group of Industries Ltd.",
    "logo": "https://merojob.com/media/cache/5a/fa/5afa62a9c27f6ca84f4d0e8683bc465e.jpg",
    "industry": "Rice, Edible Oil and Pulse",
    "about": "Business Interest Group of Industries Ltd. - BIG Industries was established in February 2021 to serve society through healthy and hygienic agro products and promote   entrepreneurship culture by investing in diversified sectors. The company has envisioned integrating, professionals, experts, farmers and the public through inclusion in ownership and community empowerment."
  },
  {
    "companyName": "BVS Nepal",
    "logo": "https://merojob.com/media/cache/f2/6e/f26eb65860f5678107b94ee2aede54a2.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Burn Violence Survivors – Nepal, established in 2008, is one of the few organizations working specifically on prevention, protection, advocacy, curative and long-term recovery and rehabilitation of burns survivors. BVS-Nepal helps and supports survivors of burns accidents and violence, such as attempted homicide attacks, normally using kerosene or acid and cases of self-immolation and attempted suicide, often stemming from domestic violence. We have been able to help more than 8500 burns victims, till date, through medical and surgical, counseling, nutrition and physiotherapy since the inception of the organization. BVS-Nepal has successfully provided life skills and vocational trainings to thirty female burns violence survivors, to enable them to start a new life."
  },
  {
    "companyName": "Canon Higher Secondary School",
    "logo": "https://merojob.com/media/cache/72/14/72145467c7f052a4a4556ff4413b560e.jpg",
    "industry": "Education - School & Colleges",
    "about": "Canon Higher Secondary School is established in 2053 B.S. It is located at Sukkhanagar, heart of Butwal city. The school has +2 level in sceince, management and humanities\n\nCanon H.S.S always focuses on quality education with aim of providing best result.Quality education aims at developing a balanced set of capabilities of children they require to become economically productive, develop sustainable growth."
  },
  {
    "companyName": "Capital Designs Inc.",
    "logo": "https://merojob.com/media/cache/e3/f2/e3f20fc5cf3540f9b31fe81e0eb4b1a1.jpg",
    "industry": "Designing / Printing / Publishing",
    "about": "We are a USA and UK based company, that supply Teeth Whitening Kits globally. We love Nepal for its hard-working people, and we know the wi-fi is now MUCH better in Nepal than a few years back. Thus, we are expanding into Nepal. We have a lot of experince with hiring great team members in Nepal."
  },
  {
    "companyName": "Care Nepal",
    "logo": "https://merojob.com/media/cache/3e/53/3e53addd3389ab2946e7ae4e114035a2.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "CARE is an international NGO with local staff and community partners in more than 90 countries. We create local solutions to poverty and inequality and seek dignity for everyone every day and during times of crisis. CARE puts women and girls at the center of everything we do because they have proven to be the best hope for creating lasting change in the world. CARE has been operational in Nepal since 1978 and works in partnerships with government and non-government stakeholders across the spectrum of humanitarian action and long-term development programs CARE Nepal hereby invites applications, for the below mentioned position, from interested Nepali candidates."
  },
  {
    "companyName": "CEDB Hydropower Development Company Limited",
    "logo": "https://merojob.com/media/cache/5d/ab/5dab007986cfb8dff59599af39a3c28d.jpg",
    "industry": "Hydropower / Alternate Energy",
    "about": "CEDB Hydropower Development Company Limited (CHDC), a public limited company incorporated under the prevalent laws of Nepal on Mangsir 15, 2066 (November 30, 2009). CEDB Hydropower Development Company Limited (CHDC) was founded by the then Clean Energy Development Bank to provide equity investment for hydropower projects to meet energy needs of the nation. CHDC is currently mandated to invest in and develop Hydropower Projects. It has got four hydropower projects in operation and three projects at construction and development stages.\n\nProjects Under Development/ Construction\n\nDordi-1 Hydro Electric Project (12 MW) (Lamjung)\nRukum Gad Hydropower Project (5 MW) (Rukum)\nKasuwa Hydropower Project (45 MW) (Sankhwasabha)"
  },
  {
    "companyName": "Cellapp",
    "logo": "https://merojob.com/media/cache/95/96/9596724f94f077e21744ff2dd2a6d83a.jpg",
    "industry": "Information / Computer / Technology",
    "about": "We are Tech Incubators. We create local iMpact and Social Good Projects Involving Information Technology, Innovation, and Data.\n\n\nWe hold expertise with 11+ years of experience and a portfolio in the Global Tech Industry. Our Services wing develops products that accelerate business\n\n\nWe have been deploying world-class Innovation Technologies to Governments, Business Houses, and Startups.\n\nOur Recent Products/Startups:\n\nSmartPalika - स्मार्ट बन्दैछ नेपाल!\nSubhaYatra - Travel Nepal Catalogue\nXoomERP, etc."
  },
  {
    "companyName": "Chaudhary Group",
    "logo": "https://merojob.com/media/cache/cd/12/cd1290da339255cf9463b588368e6c9d.jpg",
    "industry": "Multinational Companies",
    "about": "The Chaudhary Group is Nepal’s first multinational conglomerate, also to be recognized by the Forbes Asia Magazine. Established in 1933, the enterprise is driven by its vision to take Nepal to the world and establish the Himalayan nation as a force to reckon with in the global business map. The enterprise comprises of 167 companies and 79 brands across 24 countries, with a strong and highly skilled employee strength of over 13,000 + professionals. Chaudhary group, operates across a diverse set of verticals which includes FMCG, electronics, education, cement, energy, hospitality, real-estate development, financial services, telecom and construction. The company has been pioneers of many notable industry firsts in Nepal, some of them being - the first real estate company to introduce modern housing concepts, the first Private commercial bank, first integrated industrial park and the first electronics company in Nepal. Globally known for its iconic FMCG brand ‘WAI WAI’, its FMCG vertical CG Foods was the first production food company from Nepal to be awarded the ISO 9001. The group over the years has marked a phenomenal global growth story driven by rapid expansion under the leadership of Chairman Dr. Binod K. Chaudhary and the next generation of the Chaudhary family. Beyond business, the company has also established a strong identity for its CSR Arm- The Chaudhary foundation, which celebrates 25 years of providing relentless community service by driving progress and prosperity for the people of Nepal. A respected global philanthropist, Mr. Binod shares the dream of supporting Nepal through Chaudhary Foundation in its journey from being an underdeveloped nation to a developing country by 2022."
  },
  {
    "companyName": "China Communication Construction Company",
    "logo": "https://merojob.com/media/cache/2f/ee/2fee3092aeb1c4b77aa6e56e04607df1.jpg",
    "industry": "Construction / Real Estate",
    "about": "CHINA COMMUNICATIONS CONSTRUCTION COMPANY LIMITED (“CCCC” or the “Company”), initiated and founded by China Communications Construction Group (“CCCG”), was incorporated on 8 October 2006. The Company (including all of its subsidiaries except where the content otherwise requires) is the ﬁrst large state-owned transportation infrastructure group entering the overseas capital market.\n\nThe Company and its subsidiaries (collectively, the “Group”) are principally engaged in the design and construction of transportation infrastructure, dredging and heavy machinery manufacturing business. It covers the following business aspects: port, terminal, road, bridge, railway, tunnel, civil work design and construction, capital dredging and reclamation dredging, container crane, heavy marine machinery, large steel structure and road machinery manufacturing, and international project contracting, import and export trading services. It is the largest port construction and design company in China, a leading company in road and bridge construction and design, a leading railway construction company, the largest dredging company in China and the second largest dredging company (in terms of dredging capacity) in the world. The Company is also the world’s largest container crane manufacturer.\n\nCCCC, Nepal branch would be responsible for the construction of Mugling-Pokhara Highway Improvement Phase. The  objective  of the  project  is  to  widen  and  upgrade  the  road from  existing  double  lane  to  four  lane  bituminous  paved  standard to cater to increased traffic  load and provide smooth, easy and quick access eliminating existing traffic congestion and reduction in roadway accidents. The whole section of the road is rapidly being developed as urban area and forms the only major gateways to Pokhara, famous tourist center in Western Development Region."
  },
  {
    "companyName": "CloudHero",
    "logo": "https://merojob.com/media/cache/50/ca/50ca08269b91614b66e76f605ac65c50.png",
    "industry": "Software Companies",
    "about": "We help companies around the world to deliver better software, and scale faster through Containers, Kubernetes and Cloud Computing.\n\nAt CloudHero, we’re more than just the most innovativeIT consultancy. We are your trusted partners, technologists, experts and innovators.\n\nWe have hands-on expertise in implementing infrastructure-as-code,configuration, management, deploy and manage multi-cloud Kubernetes clusters, operational processes, observability and monitoring."
  },
  {
    "companyName": "ContentioLab",
    "logo": "https://merojob.com/media/cache/51/c6/51c63e806517c467fde7d09dd60df016.jpg",
    "industry": "Information / Computer / Technology",
    "about": "We are a research-oriented company that specializes in writing services like content writing, ghostwriting, and technical writing. Contentio Lab is the best in the market offering high-quality services by experienced writers, experts, and professionals."
  },
  {
    "companyName": "Creative Solutions",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Education - School & Colleges",
    "about": "This company provides varities of services in education sector for its clients."
  },
  {
    "companyName": "Cynical Technology",
    "logo": "https://merojob.com/media/cache/e4/2f/e42f8323ca5db2c66983d3c8a0016be2.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Cynical Technology is a cyber-security startup company with skillful expertise in application penetration, network penetration, security auditing and compliance that focuses on solving issues of concern to management in regards to cybersecurity. The firm serves as digital risk adviser to businesses,  governments, and institution around the country."
  },
  {
    "companyName": "Daayitwa",
    "logo": "https://merojob.com/media/cache/c9/55/c9556ee81954601457ce3677a3bcd54e.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "NEPAL aspires to graduate from least developing country to a lower middle-income country by 2030. However, the development community’s excessive focus today on socio-political empowerment has not yielded the desired economic transformation. In reaching the 2030 national target, shall we wait for institutions of power to become accountably productive or shall we bolster innovations of people to bring inclusive prosperity? And, shall we strengthen grassroots-government collaboration in shaping an equal and enterprising future? DAAYITWA ABHIYAAN strives for an enterprising Nepal where every individual has opportunities for a prosperous future. Focused on promoting economic empowerment, we aim to nurture an enterprising mindset - which is about working hard, taking risks, and being creative - in development change-agents. Driven by principles of economic justice, community engagement and financial sustainability, the Abhiyaan comprises four organizations. \n\nDaayitwa - an NGO that promotes domestic youth employment by accelerating rural youth entrepreneurs to create jobs and supporting the government to implement evidence-based enterprise development policies. \nNepal Leadership Academy - a non-profit company that develops an enterprising mindset in change-agents by growing their leadership and management capabilities. \nGovernance Lab - a for-profit research firm that enables the government and the private sector to make decisions by conducting evidence-based research and connecting researchers and decision-makers. \nDaayitwa-US - a US-based non-profit that engages and empowers Nepali diaspora in the US as change agents and strengthens local and global collaboration to promote socio-economic development in Nepal. \n\nIn the last 9 years, we have accelerated 85 rural youth entrepreneurs (45 women) in 3 provinces (Province 3, 4 and 5) to embrace innovation, access investment, grow income and create employment. Leveraging the grassroots learning, we have supported 141 youth trained in 30 countries around the world to support 51 government organizations and 24 parliamentarians with entrepreneurship and employment policy research. We have conducted more than 60 leadership courses for over 700 participants to build their capacity to lead teams and architect innovative solutions. We have conducted research on various topics such as MSE growth, dignity of labor and COVID19-related financial and health issues in order to support federal and provincial governments to make evidence-based policy decisions. We have organized Nepali diaspora and friends of Nepal to financially support more than 100 NGOs to grow their social impact. At Daayitwa Abhiyaan, we are determined to continue accelerating business, policy and civic entrepreneurs to promote employment, entrepreneurship and economic growth, while shaping a campaign that nurtures an enterprising mindset in the nation."
  },
  {
    "companyName": "Dalit JanKalyan Yuba Club Lahan",
    "logo": "https://merojob.com/media/cache/56/47/56476ee7416fca52b576d89e176d2cdf.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Dalit Jan–Kalyan Youth Club (DJKYC) is a social development organization established in Lahan Municipality Ward No.-10 Gudigaw, formed by dalits which has been continuously implementing Dalit Empowerment campaigns after getting its legally registration in 2001 in activeness of dalit youths, DJKYC, organizing Right-based campaign programs like grouping meeting, discussion, workshop, interaction, training, opposition, slogan, rally and unviewed for social justice along public advocacy on Dalits collective issues eg. Caste-based discrimination and untouchables, mainly issues of rights and rights related to Human Rights with Dalits, poor, Women and children has been promoting through ever circulating result oriented campaign of them. In that's way, it has been circulating awareness campaign, empowerment campaign and income generating. Dalit Jan kalyan Youth club has targeted transformation of current conflict of country in peace, conflict victim women, men and children for awareness generating  campaign, skill Development training for income generating, organizing for peace through group formation and mobilization and micro-finance program. It has been affiliated in SWC (social weffare council) at 2001 and in Eastern Region Dalit NGO federation (DNF) at 2003.\n\nVision :\n\n·        Building of caste-base and gender discrimination relief social, empowerment,\n\n·        Human Rights and good governance progressive, equity society.\n\nMission :\n\n   To guard rights of Dalit, women and children and human rights through  empowering Campaign by  conflict management and skill building according  to needs in related areas/sector for establishment of social just peaceful equity society and by organizing and rising to back warded and right deprived Dalit since years poor and disadvantaged family and mobilizing pressure group.\n\nGoal :  \n\n         To promote for peace, development, social transformation and establishment of equity society along  financial enlistment by implementing saving and credit mobilization, education, awareness, human  right, social justice and skill development training.\n\nObjectives:\n\n           DJKYC has designed following objectives to achieve its own goal.\n\nF     To implement campaign against caste-base discrimination and untouchability.\n\nF     To implement Dalit empowerment program for sustainable peace.\n\nF     To advocate for social justice.\n\nF     To work needed in sectors of awareness, security of human rights, development of Republican society and good governance.\n\nF     To organize Youth, Dalit and disadvantage group women and men in equity society building for social transformation.\n\nF     To guide Dalit and disadvantage family for access incensement in resources and means and for management of reservation.\n\nF     To attempt alleviation of domestic women violence existing in society, doorway, witch custom, child marriage and Multi-marriage tradition, conservation through women empowerment group.\n\nF     To enroll Dalit, disadvantaged and conflict victim family's children participating in child class through \"Rights of all in Education\" program.\n\nF     To mobilization financial credit and saving in low interest rate implementing \"Micro-finical program\" by group for poverty alleviation in rural area and organizing stilled training of Dalit and disadvantage women group.\n\nF     To circulate result-oriented program for right of Dalit and conflict victim group according to need.\n\nProgram Implementation Strategy :\n\nF     To utilize program in community by planning with coordination of NGO, INGOs & Local stakeholders.\n\nF     To manage properly for regular evaluation Monitoring and supervision at period of implementing program with coordination of sonar organization .\n\nF     To form and mobilize group / organization for capacity building in direct participation of target community personnel's .\n\nF     To advocate in side of target community for their right adoption.\n\nF     To conduct Right – base program for access in resource and means by coordinating directly eighth beneficiaries group of community.\n\nF     To collect and mobilize regular saving for improvement of social & economical status eighth medium of group.\n\n \n\nFuture Planning for Capacity Building :\n\nF      Community, Origination and mobilization\n\nF     Ownership alienation to community.\n\nF     Affiliation of target community in group.\n\nF     To organize right base training and work shop forming network of organized groups.\n\nF     To provide equal opportunity in several activities for capacity Building of community .\n\nTarget Group :\n\nF     Dalit, Poor, Women & Children\n\nF     Conflict victim family.\n\nF    Youth and Adoleschense\n\nF    Harwa Harawa community\n\n \n\nSupervision, Monitoring and evaluation :\n\nF     By site / location visiting of target area/\n\nF     By group meeting , gathering, discussion.\n\nF     By interacting with stakeholders.\n\nF     By personal meeting & discussion.\n\nF     Evaluating outcomes through public Audit, workshop, review meeting.\n\nF     Letting evaluation & monitoring of effectiveness and transparency of program through PRRP.\n\n \n\nwho will  implement?\n\nF     stakeholders,\n\nF     Beneficiaries community,\n\nF     Member  of  Executive Board  of  organization  ,\n\nF     Representatives  of Donor Agency or organization,\n\nF     Local Agency    and Administration\n\n \n\nExperience  and working capacity  of organization  ( Shade value) :\n\nF     This organization has experience that institution   formation according to right based approach   (RBA) , networking  and campaignize programs for Dalits'  rights have  been more effectively , result -oriented   and successful. This  organization  has following functional  capacity:\n\nF     Having advocacy  training  received Human   Resource.\n\nF     Having capacity to form network and organize meeting , discussion  , interaction, workshop and so on .\n\nF     Having HR for implementing  or conducting workshop.\n\nF     Having women legal literacy training (TOT) received   resource.\n\nF      Having conflict management or transformation training (TOT) taken trainer.\n\nF     Having attendance of Micro Finance Program implementing capable resources/HR."
  },
  {
    "companyName": "Daraz",
    "logo": "https://merojob.com/media/cache/ea/e8/eae85182b1b44978e931f9f2943f2986.jpg",
    "industry": "E-Commerce/ E-Business",
    "about": "Daraz is South Asia's leading online shopping and selling platform present in Pakistan, Bangladesh, Sri Lanka, Myanmar and Nepal. We currently operate an ecosystem of 50,000 sellers serving 10 million consumers with more than 20 million listed products.\n\nIn May 2018 Daraz was acquired by Alibaba Group, and we are proud to carry our part of the mission to 'make it easy to do business anywhere'. As part of the Alibaba ecosystem, we are leveraging Alibaba’s global leadership and experience in technology, online commerce, mobile payment and logistics to drive growth in our markets. Together with Alibaba, we are ready to empower entrepreneurs in the region and to fulfill our promise to offer our customers the best selection of products with a high level of convenience.\n\nWe currently have approximately 3,000 employees in across countries and business units."
  },
  {
    "companyName": "Deal Ayo",
    "logo": "https://merojob.com/media/cache/7e/44/7e440083fd6df585fe692a5fea3497fd.jpg",
    "industry": "E-Commerce/ E-Business",
    "about": "Deal Ayo Private Limited a trusted and easy to use online shopping store in Nepal that offers a surprising, and exciting, range of top quality products, at affordable prices. We provide a level of customer service that we believe is second to none. Our aim is to make Deal Ayo people's first choice when they are looking for top quality and affordable online shopping in Nepal."
  },
  {
    "companyName": "Deloitte",
    "logo": "https://merojob.com/media/cache/fb/6d/fb6d55c372b50622fabc353991fedeac.jpg",
    "industry": "Consulting / Legal",
    "about": "“Deloitte” is the brand under which tens of thousands of dedicated professionals in independent firms throughout the world collaborate to provide audit & assurance, consulting, financial advisory, risk advisory, tax and related services to select clients."
  },
  {
    "companyName": "Desire Nepal Treks Travels and Tours Pvt ltd",
    "logo": "https://merojob.com/media/cache/7b/11/7b112bbef6dcb661f5f9022de1344e8c.jpg",
    "industry": "Travel Agents / Tour Operators",
    "about": "Desire Nepal, founded by group of dynamic, young and energetic tour experts who are involve in this field for over a decade. We are government registered company, specialized in the adventurous activities, Inbound tours, Outbound tours , trekking and expedition as well as   domestic and international flight tickets all around the world. We intend to provide National and International travel services under single management through our respective designated experts . \n\nThus, our vision is to make the persisting exchange of cultural, social, economic status between Nepal and foreign countries equipping them with their needful travel services, and establish itself as Quality brand."
  },
  {
    "companyName": "Digital Home International",
    "logo": "https://merojob.com/media/cache/f9/46/f946e2e172cb527acdae896d07177807.jpg",
    "industry": "Business Supplies and Equipment",
    "about": "Digital Home International Pvt. Ltd. is Nepal’s first and the only SET TOP Box Manufacturing company with the largest market share in the industry and growing. Currently, the company is expanding itself to the electronics division with the aim to create a happier home. Moreover, the company's vision is to deliver the best user experience, quality and reliability with innovative products and services. Through innovation and development, we aim to exceed the expectation."
  },
  {
    "companyName": "Diyalo Technologies",
    "logo": "https://merojob.com/media/cache/83/e0/83e056adec6adf1c6011ca141154f526.jpg",
    "industry": "Software Companies",
    "about": "Diyalo offers a wide range of custom IT enabled services. We have outstanding experience in delivering custom database development, distributed and networked application design as well as development of various web components and projects.\n\nWe are a group of IT Professionals driven towards implementing the best of the technology and providing solutions for various disciplines with the help of Information technology.  We are the market leader in providing IT and technology based supplier rationalization, building on a culture of delivering significant cost-savings, innovation solutions and excellent customer service as part of the process.Our Major Service is to provide development and design related to technology to help you enhance your business . Our dedicated team consistently delivers superior quality products and services."
  },
  {
    "companyName": "Docskool",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Media / Publication (Newspaper, Magazines)",
    "about": "Docskool is a film support platform  working in the avenues of festival programming, film talent trainings, workshops. Founded in 2008 in Nepal as a garage run company, Docskool works actively across South Asia with its office in Kathmandu."
  },
  {
    "companyName": "Dream Construction Pvt.ltd",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Construction / Real Estate",
    "about": "We are a construction company comprising experienced team of young, passionate and energetic Engineers, Architects and Builders, devoted to serve Nepalese society. The main goal of our company is to make excellently designed residences easily available to all the population. We provide Consultation service, Design development, 3D visualization, estimation and cost analysis, interior design, home remodeling, complete construction and smart home services."
  },
  {
    "companyName": "Dzango Technologies Limited",
    "logo": "https://merojob.com/media/cache/35/7d/357ddd0b31d7662827e33973e002b0a5.png",
    "industry": "Information / Computer / Technology",
    "about": "We are a boutique software engineering who specialize in building dedicated dev teams for startups."
  },
  {
    "companyName": "EBPearls",
    "logo": "https://merojob.com/media/cache/78/12/7812ee5c7575e9c67d851e001001846c.png",
    "industry": "Information / Computer / Technology",
    "about": "EB Pearls was established in 2005 and is a full service digital solution agency. EB Pearls has offices in Sydney (Australia) and Lalitpur (Nepal), and it houses around 100 staffs across all offices. We, at EB Pearls, hold expertise in website, eCommerce, and mobile applications development.\n\n\nOur values pronounce solving digital solutions regardless of complexity and quality of services and product to the highest standard.  In such, the pivot to our success is the pool of competent people who own EB Pearl’s values and exhibit strong competence on quality of services, robust business system/process, top-notch technical capabilities, and utmost client’s satisfaction. As EB Pearls is at primary growth stage, we emphasis on cost-effectiveness while taking ambitious goals to grow our business. This stimulates us toward the establishment of strategic and holistic People Operations function at EB Pearls."
  },
  {
    "companyName": "Education Asia",
    "logo": "https://merojob.com/media/cache/2d/e5/2de5f8f3d06d3b7cfaf6ccc657afe9d4.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Education Asia a multi-national education consultancy with offices in Nepal, India & Australia, is hiring some highly dynamic & experienced staff in Kathmandu office for the following posts:"
  },
  {
    "companyName": "E-Signature Pvt. Ltd.",
    "logo": "https://merojob.com/media/cache/24/a4/24a4e1ceb8e3342a6678a2a4c818374f.jpg",
    "industry": "Information / Computer / Technology",
    "about": "We are full stack mobile/ web apps development company with over with 12 years of Industry Experience"
  },
  {
    "companyName": "EuroKids International",
    "logo": "https://merojob.com/media/cache/4c/e6/4ce61f0af09902ce8328885f0c5e7ee9.jpg",
    "industry": "Education - School & Colleges",
    "about": "Eurokids is Nepal’s No.1 & largest pre-school chain with more than 1475 pre schools throughout the world. At Eurokids, we look at education as an inviting journey in to the world of intellectual, emotional and spiritual learning, we have chosen the path of educating our children as opposed to just schooling them, we understand that children need to explore be engaged have fun and be empowered to discover new worlds of learning.\n\nWe offer an excellent career path and very attractive remuneration. The school provides an ideal academic environment with an international standard teacher student ratio."
  },
  {
    "companyName": "Eurokids Tinkune",
    "logo": "https://merojob.com/media/cache/af/9f/af9fd880573dbb673179c8cadede4b33.jpg",
    "industry": "Education - School & Colleges",
    "about": "Eurokids is Nepal’s No.1 & largest pre- school chain with more than 1325 pre- schools throughout the world. At Eurokids, Tinkune, we look at education as an inviting journey into the world of intellectual, emotional and spiritual learning. We have chosen the path of educating our children as opposed to just schooling them, we understand that children need to explore, be engaged, have fun and be empowered to discover new worlds of learning. We offer an excellent career path and very attractive remuneration and training from international trainers. The school provides an ideal academic environment with an international standard teacher student ratio. We are looking for:"
  },
  {
    "companyName": "Euro School",
    "logo": "https://merojob.com/media/cache/06/3c/063c760c924f2776a537b93c90674486.jpg",
    "industry": "Education - School & Colleges",
    "about": "Euro School is one of the reputed schools in Kathmandu following the progressive teaching learning approach within the framework of National Curriculum of Nepal aligned with International Primary Curriculum (IPC). At Euro School, we strive to achieve a balance between academics and co-curricular activities; shaping the mind of young learners to be a responsible individual.\n\n \n\n We are looking for qualified and trained professionals with good interpersonal skills to join our team."
  },
  {
    "companyName": "Euro School Koteshwor",
    "logo": "https://merojob.com/media/cache/8d/37/8d375451f93cb8f22fe059471954cc30.jpg",
    "industry": "Education - School & Colleges",
    "about": "Euro School, Koteshwor is one of the sister branches of Euro School, Hattigauda. It was established in 2018 and was previously located at Tinkune. We adhere to the  quality education and cater to the modern needs of students and parents."
  },
  {
    "companyName": "Executive Search- merojob",
    "logo": "https://merojob.com/media/cache/8d/67/8d678f2446654fbb2044fcac3013483c.jpg",
    "industry": "Manpower Recruitment",
    "about": "Executive Search Service of merojob specializes in recruiting best fit candidate (Usually Senior/Top level Position) for the client organization in various industries. We are also involved throughout more of the hiring process, conducting detailed interviews and presenting candidates to the client organizations selectively. Our process, involves analyzing the need of roles, screening and approaching right candidate, conduct preliminary interviews, facilitating the overall process from interview to selection.\n\nPlease be assured that your information are strictly kept confidential with merojob (Executive Search) and any details of your application shall only be shared to client only after proper consent.\n\nOn behalf of one of our client we are currently recruiting for the below mentioned position for our client industry."
  },
  {
    "companyName": "Expert Education and Visa Services",
    "logo": "https://merojob.com/media/cache/3b/b7/3bb759b72ebcb58cb3058877c45fee92.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Expert Education and Visa Services (EEVS) is a leading education and migration consultant agency with a global presence in 14 countries. We specialise in providing a wide range of services to students aspiring to study in Australia, Canada, UK and the USA.\n\nSince 2003, our team of registered migration agents, qualified education counsellors, career counsellors, solicitors and taxation experts have provided end-to-end services to more than 70,000 and counting international students and helped them materialise their study abroad dreams."
  },
  {
    "companyName": "Felt and Yarn",
    "logo": "https://merojob.com/media/cache/a1/7b/a17b222fd072cd1622cc153d3164145b.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "Felt and Yarn is a proud provider of premium quality, ethically produced, and eco-friendly handcrafted felt supplies ranging from home decor, cozy shoes, novelty cat caves, rugs, yarns, and many more! Our fine quality wool is processed by hand from local sheep and meticulously dyed and felted into gorgeous and whimsical items with love, from start to finish. Whatever you need, from themed holiday decor, colorful felt balls, to natural cat and dog toys; we have the perfect felted fun for your home.\n\nOur production is centered around employing local household Nepalese women, providing them with training, fair wages, and a safe working environment, by choosing Felt and Yarn you choose to support sustainable, eco-conscious craft and make upskilling the people of our remote villages possible. Thank you, enjoy our soft, colorful products!"
  },
  {
    "companyName": "FHI 360 Nepal",
    "logo": "https://merojob.com/media/cache/c1/2f/c12faf5169ca51c63fb3189498880b83.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "FHI 360 is a nonprofit human development organization dedicated to improving lives in lasting ways by advancing integrated, locally driven solutions. Our staff includes experts in Health, Education, Nutrition, Environment, Economic Development, Civil Society, Gender, Youth, Research and Technology– creating a unique mix of capabilities to address today’s interrelated development challenges. FHI 360 serves more than 60 countries, all 50 U.S. states and all U.S. territories."
  },
  {
    "companyName": "Fishtail Tours & Travels",
    "logo": "https://merojob.com/media/cache/11/87/1187db7c7f96bbcf89d8a39705581c36.jpg",
    "industry": "Travel Agents / Tour Operators",
    "about": "Since its establishment in 1990, Fishtail Tours & Travels has positioned itself at the forefront of the tourism and hospitality industry by offering the widest coverage of local and international destinations at affordable prices. We boost a total employee strength of over 100 providing services in Leisure Tours, Soft Adventure and Adventure Tours, Pilgrimage, Cultural & Historical Tours, Study & Educational Tours, Festival & Honeymooners Special Tours, Senior Citizen and Wedding Special Tours, Trekking & Mountaineering, Wild River Adventure Tours, MICE Tours, Holy Mt. Kailash & Mansarovar Yatra & all other travel and tour related areas."
  },
  {
    "companyName": "Foundation for Development Management",
    "logo": "https://merojob.com/media/cache/b4/37/b437b605e3becafb7ede33b1b303ccae.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Foundation for Development Management (FDM) (www.fdm.com.np) is a private limited company registered under the Company Act of Government of Nepal in 2000 as a development support organization. Over its past two decades of operation, FDM has conducted a number of assignments pertaining to Research, Monitoring and Evaluation (M&E) and Institutional Development. Having served over 35 national and international clients comprising of government, non–government and donor organizations, FDM primarily works under the thematic areas of education, health, governance, child rights, DRR and GESI. FDM is based in Kathmandu, Nepal and has 15 full-time program staff, over 100 consultants and pool of enumerators spread over 67 districts. In its two decades of operation, it has successfully completed more than 100 M&E and research assignments.\n\nFDM is currently looking to hire in the following positions:"
  },
  {
    "companyName": "Fusion Global Logistics Pvt Ltd",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Logistic / Courier/ Air Express Companies",
    "about": "We are logistics company based in Kathmandu providing logistics services to/from various parts of the world. We are now seeking a new batch of employees for our new office."
  },
  {
    "companyName": "Genius IB World School",
    "logo": "https://merojob.com/media/cache/55/0e/550ed1845f3d6c7c6724092412f590d3.jpg",
    "industry": "Education - School & Colleges",
    "about": "Genius IB World School has been authorized for International Baccalaureate Primary Years Program (IBPYP) since September 2018. The school has been led and managed by highly experienced and dedicated education professionals who believe in progressive learning approach to provide opportunities to our children where they excel not only academically but also socially, emotionally and physically. We value our student’s individuality and believe that all children should be given equal opportunity and encouragement to reach their highest potential.\n\nWe invites application from self motivated, dynamic, competent and experienced Nepali citizens interested to pursue their career in the academic institutions for the following positions:"
  },
  {
    "companyName": "Gharbazar.com",
    "logo": "https://merojob.com/media/cache/90/1f/901f416753f7a02118813aea184aa8de.png",
    "industry": "Real Estate - Property Management, Rental and Hiring",
    "about": "Gharbazar.com provides online services to sell, buy or rent properties. It is online marketplace platform for those who want to deal in their properties directly with the seller and buyer. It is a bridge between the buyers and sellers.\n\nSell your property at gharbazar.com!"
  },
  {
    "companyName": "Global Academy of Tourism and Hospitality Education",
    "logo": "https://merojob.com/media/cache/e1/00/e10078d392e421261e8cf4841a70bdcc.jpg",
    "industry": "Education - School & Colleges",
    "about": "Global Academy of Tourism & Hospitality Education (GATE) is an award winning International  Hotel Management School based in Kathmandu Nepal, offering world-class hospitality  education since 2007 affiliation with world famous Ecole Hôtelière de Lausanne, EHL  https://www.ehl.edu/"
  },
  {
    "companyName": "Global Space Pvt. Ltd.",
    "logo": "https://merojob.com/media/cache/19/6e/196efad6bafabf5d9d905b1eae2e810c.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Educational Consultancy for Test Prep Courses, Study Abroad Services, Migration Services, and Visa Services Consulting"
  },
  {
    "companyName": "Glory Homes",
    "logo": "https://merojob.com/media/cache/63/f0/63f0edec7e378dc1a35518c43bf04b96.jpg",
    "industry": "Hardware / Network Companies",
    "about": "Glory Homes is seeking to recruit a dedicated and qualified candidates for following position:"
  },
  {
    "companyName": "Goes Educational Consultancy",
    "logo": "https://merojob.com/media/cache/ae/ef/aeefe6743a0430f08fd93f012f67bdac.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Goes Educational Consultancy is a reputed and recognized educational organization which is registered under Ministry of Education which  was founded 12 years ago and has been recruiting the students in the abroad for higher studies."
  },
  {
    "companyName": "Gorkha Brewery",
    "logo": "https://merojob.com/media/cache/7b/a1/7ba18f1c854d3d0fadff3ce9fc2e07e2.jpg",
    "industry": "Manufacturing / Engineering",
    "about": "Gorkha Brewery (P) Ltd  part of the Carlsberg Group, presents an opportunity for individuals to team up with us. The extraordinary success of the company is the result of excellence in every arena and adding that extra bit every time are the talented and diverse team who work with the company. This is an invitation to people who have a passion for excellence and seek the opportunity to explore their skills.\n\nWe vision to become stronger together. Our heart lies in local power brands with our core strength being a part of Carlsberg group. #WHOWEARE #SomethingsBrewing"
  },
  {
    "companyName": "Guru Travels Ltd.",
    "logo": "https://merojob.com/media/cache/18/16/1816f4db2c18865b94f64338c751f78c.jpg",
    "industry": "Travel Agents / Tour Operators",
    "about": "We are the Nepal's #1st Public Limited Travel in the sectors of Tourism. Based on strong value-based industrial foundation, we got established to contribute the nation's tourism sector at large, in the sectors of Inbound and Outbound Holidays, Domestic and International Ticketing, MICE, Expeditions and Adventurous Activities, and Other Thematic Tourism Activities.\n\nAs a professional workplace, we solicit competent & responsible members and wish to promote our employer brand through them. We regard our team members as our brand ambassadors and their contribution as the key to our business success."
  },
  {
    "companyName": "Habitat for Humanity International Nepal",
    "logo": "https://merojob.com/media/cache/f9/16/f916fe44f825a01455fc98f34730241d.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Habitat for Humanity International Nepal's vision is a world where everyone has a decent place to live. Habitat Nepal operates as part of an international network with a common objective of reducing poverty and eliminating substandard housing and homelessness from the world."
  },
  {
    "companyName": "Hamro Academy",
    "logo": "https://merojob.com/media/cache/a3/a2/a3a2c293e8c6fa1e2d580625209b0813.png",
    "industry": "E-Commerce/ E-Business",
    "about": "Welcome to Nepal's Best learning platform. We are an innovative education platform connecting our highly regarded and experienced faculty members and the students from different parts of the world through the electronic media. We envision any person located at any place can get access to the best faculty and highest quality education. We have developed a secured yet user friendly platform for both students and teachers which includes video lectures, notes, test series and live sessions.\n\n\n\n\nWe aim to establish ourselves as the market leaders in the online education industry through our student friendly notes, creative teachers and innovative learning methodology provided via our web platform and mobile app."
  },
  {
    "companyName": "Hansikar Technologies",
    "logo": "https://merojob.com/media/cache/8a/33/8a33b5b96674cca8c98679d7a4e92593.png",
    "industry": "Information / Computer / Technology",
    "about": "Hansikar is a leading digital marketing agency established in 2018 and has served over 50 clients. We are primarily focused on designing result-driven online marketing strategies (including SMM, SEO, Ecommerce SEO, local SEO, PPC, Content Marketing, Video Marketing) for ensuring accelerated growth in client’s business and improved conversion rates. \n\nOur passionate and professional team is comprised of highly data-driven individual and creative thinkers who take both quantitative and qualitative approaches to achieve desired success.\n\n\nLearn more about us in this link."
  },
  {
    "companyName": "Healing Together Nepal",
    "logo": "https://merojob.com/media/cache/10/9a/109aa2d7fda5ba6eb506014aec622309.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Healing Together Nepal builds the power of everyday people to disrupt generational cycles of trauma and violence. Our mental health and trauma-informed care workshops and support groups democratize access to community-centered, peer-led healing resources—so communities disproportionately impacted by trauma can reclaim their inherent strength, wisdom, resilience, and power to heal themselves and others. \n\nTo date, we've facilitated trainings with 500+ community leaders from various districts of Nepal, who support over 10,000 trauma survivors in their communities. \n\nWe are seeking a passionate, highly self-motivated, multi-talented professional who can assist in administration and trainings, so we can grow and scale our impact and co-create the movement for mental health and healing justice in a way that is thoughtful, equitable, adaptable, and sustainable in the midst of a rapidly changing environment. \n\n\nOur ideal candidate has a proven track record of executing and completing projects from start to finish, with a real knack for working around obstacles to get things done, while maintaining a sense of humor, grace, and humility, and prioritizing relational care and alignment with our Guiding Principles. \n\nWe encourage and seek applications from individuals who identify as women, BIPOC, and/or are members of the LGBTQ community. Applicants shall not be discriminated against because of race, religion, sex, national origin, ethnicity, age, disability, political affiliation, sexual orientation, gender identity, color, marital status, or medical condition. \n\nThis position reports to the Country Director and includes regular collaboration with our team members in Nepal and abroad. Responsibilities include, but are not limited to the following:"
  },
  {
    "companyName": "Himalayan Business Group",
    "logo": "https://merojob.com/media/cache/0a/5d/0a5d1517b7e6234b1fbe5fc0b6cefe0f.png",
    "industry": "Immigration & Education Consultancy",
    "about": "Education and Consultant Service- Study in Australia"
  },
  {
    "companyName": "Himchuli Academy",
    "logo": "https://merojob.com/media/cache/0c/2b/0c2bf29140cd01a8515dc1af7edd4483.jpg",
    "industry": "Education - School & Colleges",
    "about": "Himchuli Academy is a firmly established, a reputed educational institute in Bhaktapur. It is located in Dhunchopakha in Madhyapur Thimi Municipality ward no. 7. We believe that education is simply the soul of a society as it passes from one generation to another.Himchuli highly emphasizes on ECA for students over all development."
  },
  {
    "companyName": "Himgaatha Multipurpose Cooperative Ltd.",
    "logo": "https://merojob.com/media/cache/c7/e3/c7e3a71bbd8c61872ef8df4039282f42.jpg",
    "industry": "Finance Companies",
    "about": "Multipurpose cooperative"
  },
  {
    "companyName": "HLE Nepal",
    "logo": "https://merojob.com/media/cache/b8/16/b816c3df7e036f1f0b0b9f12588feb92.jpg",
    "industry": "Multinational Companies",
    "about": "Home Loan Experts is the top specialist mortgage company in Australia with rapidly growing offices in Sydney and Kathmandu. Having settled over $5 billion home loans, we are the leading financial service provider in Australia. \n\nWe exist to get tough loans approved; that's why our customer service is the best!\n\nHLE Nepal Pvt. Ltd is an extension of Home Loan Experts. Our office in Kathmandu has 400 happy and energetic team working to provide the best customer service and our team of brilliant tech team focuses on building world-class fintech products. \n\nWe believe in employee growth and offer amazing career advancement opportunities for our employees. \n\nIf you want to be part of this please visit our website https://hlenepal.com.np/\n\n**We regret that only shortlisted candidates will be contacted.**"
  },
  {
    "companyName": "Horizon Associates Pvt Ltd",
    "logo": "https://merojob.com/media/cache/c5/39/c5398b2f94333d0c63091fb5cdea4c48.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "We are educational consultancy located in Dillibazaar 29,Kathmandu Nepal.\n\nWe specialise in counseling in abroad study and visa documentation"
  },
  {
    "companyName": "Hotel Marshyangdi",
    "logo": "https://merojob.com/media/cache/17/a8/17a85d1f81b4d2b861f855d6539f0cdc.jpg",
    "industry": "Hotels / Resorts / Restaurant",
    "about": "Located at the heart of City, Thamel, 25 minutes from the international airport, 10 minutes from Kathmandu Durbar Square, Freak Street and 20 minutes from The Monkey Temple, Hotel Marshyangdi, a 3 star yet an affordable hotel have been serving tourists and corporate houses with comfortable 95 rooms since more than 25 years. Despite of being in the heart of the city, Hotel Marshyangdi has a beautiful garden restaurant where guests can enjoy their leisure time with coffee and snacks. The hotel is famous for its services and the state of the art facilities. We welcome you to our hotel situated in the heart of Thamel and look forward to serving you in the future."
  },
  {
    "companyName": "Hotel Shambaling",
    "logo": "https://merojob.com/media/cache/92/d1/92d14e5605abc0d340a41da1a152c31a.jpg",
    "industry": "Hotels / Resorts / Restaurant",
    "about": "A dream project of Dawa Sigrist and Sonam Sherpa, Shambaling Hotel is a tribute to their Tibetan heritage.\n\nTo fill in a void of a mid-range hotel along with world-class hospitality with a Tibetan touch, they envisioned this project in 2010.\n\nOne of Boudha’s first guesthouse used by pilgrims from Tibet, the property dates back to the early seventies. Approximately 20 minutes from the international and domestic airport, the hotel is quietly tucked away from the busy streets and fairly close to the peaceful realms of Buddhist heritage sites.\n\nTwo years in the making, the once guest house for pilgrims now houses Shambaling Hotel for the spiritually inclined, where old traditions meet modern amenities."
  },
  {
    "companyName": "Hulas Iron Industries",
    "logo": "https://merojob.com/media/cache/58/c6/58c634fd1c9309d7f31ac40ca198e44b.jpg",
    "industry": "Manufacturing / Engineering",
    "about": "Hulas Iron Industries is part of Golchha groups of companies, growing, changing and challenging, the world of Steel & Iron manufacturing with the dynamic vision for better life that embraces different skills, continuous innovation, and develop employment in Nepal."
  },
  {
    "companyName": "Human Rights Protection and Legal Service Centre,HRPLSC-Nepal",
    "logo": "https://merojob.com/media/cache/39/ce/39ce5ee1775ee58baf4dbbe8223bae5c.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Human Rights Protection and Legal Service Center, HRPLSC-Nepal is a province based NGO registered on 2000 in DAO of Western Rukum under the Social Organisations Registration Act, 1978. HRPLSC envisions a just and equitable society wherein everyone exercises his or her fundamental rights in a fear free environment. It has been working in the Lumbani and Karnali province area of Human Rights protection and promotion, Good governance and Social Accountability, Conflict transformation and peace building through awareness building activities, advocacy campaigns and community mobilization."
  },
  {
    "companyName": "Ideal Concern Pvt Ltd",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Software Companies",
    "about": "Ideal Concern is a software development and IT consultancy company located in Nepal. We are specialized in providing IT solutions that improve and transform the way businesses work. We are also a proud member of one of the most prestigious and oldest business"
  },
  {
    "companyName": "IEC College of Art and Fashion",
    "logo": "https://merojob.com/media/cache/cf/69/cf691a189eefe885ec7bc92c5b06ad7b.jpg",
    "industry": "Education - School & Colleges",
    "about": "IEC is the first to introduce Fashion Design & Interior Design courses in Nepal. IEC College of Art & Fashion is the venture of IEC School of Art & Fashion, one of the most trusted name in the education field from last 25 yrs in Nepal. We offer excellent opportunities for development and a progressive career path for all our staff members."
  },
  {
    "companyName": "iKreate Technologies",
    "logo": "https://merojob.com/media/cache/52/32/5232261898dd3a5f73ca46c035a4e634.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Software Development Company, Information Technologies."
  },
  {
    "companyName": "Incessant Rain Animation Studios",
    "logo": "https://merojob.com/media/cache/d4/e9/d4e9d0d2c701aa5cfc2b0c3f8dca7428.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Incessant Rain Animation Studios (IRAS) is a one-stop creative solution for quality digital animation and flawless visual effects along with a diverse team of artistic minds and technical talents.\n\n\nWe work hand in hand to create ideas that go beyond this world. We combine our passion and excitement with our client’s needs into a collaborative and creative approach that meets every project’s budget and time constraints.\n\nThrough our collective efforts, we envision to entertain and fascinate the world with a unique range of unforgettable stories and exciting characters, giving life to dreams and wings to the imagination."
  },
  {
    "companyName": "INFICARE",
    "logo": "https://merojob.com/media/cache/86/40/864011000a22178fe9c95b11ea0e4f99.jpg",
    "industry": "Software Companies",
    "about": "Inficare was established in 2005 with the intention of introducing something new, unique, and modern into the world of IT, by a team of business and technology experts within the banking and remittance industry. We provide completely tailored software development & consultancy services for financial institutions, and in doing so, utilize state-of-the-art tools and technologies and best-of-the-breed processes and methodologies to ensure quality delivery. Our competent team has experience dealing with over 100 banks and financial institutions, all the while staying up to date with the international monetary trends and compliance regulations. Additionally, the collective expertise of our intercontinental client network enables an extra boost for implementation, even in unchartered territories."
  },
  {
    "companyName": "InfoDevelopers",
    "logo": "https://merojob.com/media/cache/5a/6a/5a6a6708bee397c9ca59b5b333865b7d.jpg",
    "industry": "Information / Computer / Technology",
    "about": "At InfoDevelopers, we continuously work to ensure that our services are maintained at the highest possible level of reliability and satisfaction. We are not successful until every customer start achieving return on their investments from reduced production costs and streamlined processes. InfoDevelopers provides innovative, quality, cost effective IT Services and Software solutions for business process automation and re-engineering. Established in 2002 AD, the Company has been promoted and managed by professionals having long working experience in banking and IT sectors. We have 150 staff members who are currently working with us."
  },
  {
    "companyName": "Innovate Nepal Group",
    "logo": "https://merojob.com/media/cache/21/c6/21c68f71741d95abe803004a3fbab1b4.jpg",
    "industry": "Education - School & Colleges",
    "about": "Established in 1996, we are one of the fastest growing group into international education in Nepal offering world-class IT and Business courses for Bachelors’ & Masters’. We, ING are expanding our footprint into various locations.\n\nWe believe that building and providing value to our employees, students and partners are of utmost importance. Therefore, we are continually striving to provide them with top-notch result and support that ensures satisfaction.\n\nWe value the human capital and plan the career growth of an employee in a streamlined manner to fit his/her aspirations and organization’s requirements. With us, working in a friendly atmosphere is valued.Our goal is to give talented individuals a vibrant and opportunity driven growth who are looking at fast paced career. Come and be a part of our ambition driven team."
  },
  {
    "companyName": "Innovate Tech",
    "logo": "https://merojob.com/media/cache/7b/e0/7be09a1fd52681eadb7cb74b36e9402d.png",
    "industry": "Information / Computer / Technology",
    "about": "Innovate Tech is a new synergy envisioned and curated by technologists, serial entrepreneurs, and thinkers with a proven track record. A tech company at its heart, we are on the brink of revolution, changing the way education is perceived.\n\nWe have art, science, media, technology, and human-centered thinking as a core part of our culture. We convert an idea into reality and an impactful one.\n\nCome join us in innovating the future of learning."
  },
  {
    "companyName": "Innovative Business Pvt. Ltd",
    "logo": "https://merojob.com/media/cache/45/f9/45f9789df2ff45be659781524b70e982.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "Trade Company\n\nDeals with export and import of different category products.\nSells in the market with the e-Commerce platform."
  },
  {
    "companyName": "Innovative Multipurpose Co-operative",
    "logo": "https://merojob.com/media/cache/ba/e4/bae483b4eb44a531a95874bf3e7f4296.jpg",
    "industry": "Finance Companies",
    "about": "Innovative Multipurpose Co-operative Ltd. is leading financial institution located at gothatar kathmandu.We provide best financial services through our strongly motivated team,continuously  working to serve our customer and provide customer satisfaction."
  },
  {
    "companyName": "IRRI Nepal",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "NGO / INGO / Development Projects",
    "about": "The International Rice Research Institute (IRRI) is the world's premier research organization dedicated to reducing poverty and hunger through rice science, improving the health and welfare of rice farmers and consumers, and protecting rice-growing environments for future generations."
  },
  {
    "companyName": "ITONICS Nepal",
    "logo": "https://merojob.com/media/cache/c7/c2/c7c25e32f0748f8216370b056ba83e37.png",
    "industry": "Information / Computer / Technology",
    "about": "Empowering Everybody to Innovate\n\nOur data-driven innovation software platform helps organizations around the globe to identify emerging technologies, trends, and market potentials and translate them into powerful growth strategies.\n\nWorld's Leading Platform for AI-Powered Strategy & Innovation\n\nITONICS is a leading SaaS provider of systematic innovation management. Together with our clients, we shape the future. Our AI-powered platform combined with a systematic framework to steer innovation efforts helps companies to identify emerging technologies, trends and market potential and to translate them into customized growth strategies.\nWorking with global teams to innovate new products, services, and business models, ITONICS professional services inspire, guide, and accompany organizations on their innovation journey. With more than 125 experts on five continents, we support innovation leaders such as adidas, AUDI, BMW, CISCO, Intel, Johnson & Johnson, KPMG and SAP."
  },
  {
    "companyName": "IT Training Nepal",
    "logo": "https://merojob.com/media/cache/b8/70/b870d58f438ef343153d9b9d16beff90.jpg",
    "industry": "Training Institutes",
    "about": "IT Training Nepal is one of the best computer training institute of Nepal located at core of the Capital city, Kathmandu. Here, we enable students to solve real time problem with ineractive learning methodologies. Project work, internships, job assistance are some of the key facilities to secure a professional spot in the blooming Information and Communication technology industry. Students are engineered in the field of software development; the learning is done in an integrated approach like class interaction, individual assessment, face to face sessions, multimedia through which students can expand their knowledge in Computer science and Information technology Management systems. We are a truly professional training institute. Fast track courses provided by us will also help students get training in ashort period of time."
  },
  {
    "companyName": "Joshi Builders & Company Pvt. Ltd.",
    "logo": "https://merojob.com/media/cache/d4/e8/d4e84d34e72e5b57a0b3a474862a46b1.jpg",
    "industry": "Construction / Real Estate",
    "about": "Joshi Builders & Company is an ‘A’ class construction company having experience in highway construction, irrigation and river training, road and drainage for more than 2 decades. JBC is one of the leading construction company in far-west Nepal in terms of turnover and number of project completed. \n\nThe company has completed various major projects under Departments of Roads, Department of Urban Development and Building Construction, Department of Water Induced Disaster Management and Department of Irrigation. The company believes in total professionalism and quality leadership in its work. JBC is in its rapid growth and market expansion phase nationwide through its young and dynamic leadership and using its excellent professional relationship with other major construction company of Nepal."
  },
  {
    "companyName": "JourneyDMC",
    "logo": "https://merojob.com/media/cache/f8/03/f803ebb9239c12d5aea4591fc2f88ea3.jpg",
    "industry": "Travel Agents / Tour Operators",
    "about": "Journey DMC is an Destination Management Company started since 1998 in the heart of the Himalayas . We have been operating trips in Nepal, Bhutan, Tibet and India. We have delved into all areas of tourism and travel management in the country. Being enthusiastic and dedicated travel professionals, we are able to assist with planning various holidays offering invaluable advice depending on the time of the year, time available with the clients and their budget. All our team members are being from local community and have dedicated several years in the tourism industries we have an intimate knowledge of the region and have best connection (personal as well as business) with all tourism industries in the country. We are capable of offering any services you require for your clients from arrival until final departure in Nepal, Bhutan, Tibet and India. Our main strength is quality man power.We are a  ground handling company  for cultural tours, customized itineraries, incentives, spiritual journeys, Yoga & meditation trips, student programs, jungle safari, adventure trips, Heli sightseeing & trek, rafting, mountain biking.We have offices set up in Nepal, Tibet, Bhutan and India which acknowledges our deep-rooted interest in these destinations and they are the best in the fields. Our knowledge and experience in the Himalayas make us reliable and trusty partners. On a journey with us there will be plenty of all that is good and desirable: magnificent scenery, excellent equipment, knowledgeable guides, ethnic cuisine, study vehicles, maximum safety, clean environs and cheerful disposition Journey DMC not only give you the sights view we focus on rituals, festivals and a local life of the people from that area. According to your interest we design the programmer. As tour is an exploration, to see a rituals, values and norms of local community.Such occasions provide the best insight into the customs, traditions and costumes of the people in that particular area. Whether your interest lies in participating in festivals, rites and rituals or admiring urban works of art or simply visiting spiritual and historical sites, we will accommodate you according to your passion and interest.\n\nhttps://www.journeydmc.com"
  },
  {
    "companyName": "JSS Life Science",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Chemical and Medical Suppliers",
    "about": "Dealers of Laboratory Equipments, Chemicals, Medical Goods, Biotechnology Goods, etc in Nepal"
  },
  {
    "companyName": "Kanchan Engineering Consultancy Pvt Ltd",
    "logo": "https://merojob.com/media/cache/85/06/8506177aba213530626b2614d6aa4f99.jpg",
    "industry": "Engineering Firms",
    "about": "Reputed Engineering Firm with:\n\nMore than 18 yrs in Operation\nWorking in the field of environment engineering, EIA, IEE, Policy level advisory etc\nOther related works"
  },
  {
    "companyName": "Kantipur Education Development Council",
    "logo": "https://merojob.com/media/cache/56/48/5648182a2e53bda82c4e3069077a73be.jpg",
    "industry": "Designing / Printing / Publishing",
    "about": "Dedicated to the betterment of Nepal’s quality of education, Kantipur Education Development Council (KEDC) one of the leading publisher of educational materials for basic education was founded in 2002 (BS 2059)."
  },
  {
    "companyName": "Kantipur English High School",
    "logo": "https://merojob.com/media/cache/eb/54/eb5433f5e117d4336a67615235dcc510.jpg",
    "industry": "Education - School & Colleges",
    "about": "Kantipur English High School, an English-medium school, prides itself with its long and rich tradition of Academic Excellence.\n\nIt aims to build up children for the challenges ahead with programs that are both relevant and progressive, as a result, preparing children for life and not just for earning a living."
  },
  {
    "companyName": "Kantipur Holidays",
    "logo": "https://merojob.com/media/cache/d5/03/d503e5cda0765151d9aaee8133732777.jpg",
    "industry": "Travel Agents / Tour Operators",
    "about": "Kantipur Holidays is an online travel distribution company established to facilitate our customers with extensive services to plan a perfect solution to an exquisite holiday destination. Through our services you can effortlessly devise your holiday in any location, within the best possible price ranges. As a leading travels and tours firm within Nepal, we assure the ultimate solution to our customers' itinerary, no matter how exclusive they are. We are driven by a zealot and industrious professional team along with an exhaustively maintained IT structure. We are committed to assist our clients with smart travel choices, offering peculiar holiday packages and extensive hotel list at your desired destination within competitive prices. It is our earnest motive to make your trips convenient and memorable."
  },
  {
    "companyName": "Kathalaya Inc.",
    "logo": "https://merojob.com/media/cache/22/05/22058047ee699656658254709eb9cec9.jpg",
    "industry": "Designing / Printing / Publishing",
    "about": "Kathalaya Inc. Pvt. Ltd. is a publication house with an aim to develop reading skill and habit among children through library establishment, developing activities that support reading and producing colorful children books. Kathalaya has worked in developing quality story books and fill the void of quality and diverse set of books specifically focusing on the children in Nepali language. Kathalaya Inc. has managed to publish over 350 colorful pictorial titles of stories, poems and original work (drawings and themes) of students and supplied to various schools, libraries, NGOs/INGOs and book stores in the country. Kathalaya has tied up with Scholastic India for “Time to discover”, Usborne Publication for Science Encyclopedia and Arvind Kumar Publishers, India. Kathalaya has acquired rights to translate renown titles form world- wide like companies Hachette UK, Les-400 coup Canada, Gemser Publicatin-Spain, Opal- Sweden, Gylendle- Denmark etc."
  },
  {
    "companyName": "Kathmandu Infosys Educational Consultancy",
    "logo": "https://merojob.com/media/cache/be/6d/be6de5bf5ad953d7046c66b712616edf.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "“KIEC formally known as Kathmandu Infosys is Nepal's must searched education consultancy, Established in the year of 2006, having served a plethora of students, taking them one step closer to achieving their dreams. Our team at KIEC, pride ourselves on working round the clock, finding bespoke solutions that are unique to every individual student, based on their background and qualifications. We thrive in reaching the unsurpassed pinnacle of giving a wide array of options to the students, that they can choose from while suggesting what's best for them, and that's what makes us Nepal's number one education consultancy.\n\nWe have successfully branched out all over Nepal, with offices in Sydney and Melbourne, so that no student is deprived of their right to international top-class education. We have the finest counselors, who are always updated with the new immigration regulations, staying one step ahead of the game. Our Learning Center hosts the best IELTS, PTE, SAT & GRE classes in Nepal, with proficient teachers having decades of experience, that understand the needs of each student. We are honored to be Nepal's number one education consultancy and are always ready to be at your service any time of the day!”\n\nOnce you will be in any KIEC offices, we assured you that you will \"Get More\"."
  },
  {
    "companyName": "Kedia Organisation",
    "logo": "https://merojob.com/media/cache/ce/7a/ce7acb592cf161f4be7423bfe21ed099.png",
    "industry": "Construction Material and Equipment",
    "about": "Established in 1909 AD, Kedia Organisation is one of the oldest and most esteemed business conglomerate of the country. The organisation has been practicing a synergistic combination of family ownership and professional management. \n\nKedia Organisation continues to make significant contribution in various financial sectors such as Banking, Non-life and Life Insurance, Mutual Funds, as well as in industrial sectors such as Cement, Steel, Concrete Pavers and Tiles, Safety Glass and several other sectors. \n\nThe organisation believes in uplifting the society and it has actively been doing this through several CRS activities over the years."
  },
  {
    "companyName": "Khalti Digital Wallet",
    "logo": "https://merojob.com/media/cache/32/27/3227642d60ceadc3a94c418c71ea9609.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Khalti is a mobile wallet, payment gateway & service provider in Nepal. Launched in January 2017, Khalti is one of the leading online payment solution in Nepal. It allows users to pay for a range of services like basic utility payments, hotel bookings, movie and domestic flight tickets, events and many more. It is operated and owned by Sparrow Pay Pvt. Ltd. \n\nWe offer payment solution to over hundreds of merchants across Nepal and provide seamless payments using ebanking, smart banking, cards, and wallet. Being not just limited to mobile app users, Khalti has more than 8000 POS and Agent Network providing Khalti services to end users.\n\nKhalti is home to some of the brightest minds in the country, which includes a team of highly skilled developers and interactive marketers. Our solution-oriented approach makes us reliable for any and all kind of service you might require from Khalti with the best user experience possible.\n\nOur goal is to simplify lives of people by bringing financial inclusivity to every individual in Nepal and take the payment industry from offline to online through best practices."
  },
  {
    "companyName": "Khantze & Co.",
    "logo": "https://merojob.com/media/cache/d2/95/d295adb0b6ce912b7c85aafae51fc9bd.jpg",
    "industry": "Garments / Carpet Industries",
    "about": "Top 10 Carpet Manufacturer and Exporter."
  },
  {
    "companyName": "KOSHISH",
    "logo": "https://merojob.com/media/cache/44/29/44291ffc3d39a89efd16fe3b08d97654.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "KOSHISH is a nongovernmental organization, as a national self-help organization it is working in the field of mental health and psychosocial wellbeing in Nepal. The word \"KOSHISH\" means \"making an effort”. KOSHISH works in a twin-track approach; advocacy and service delivery. Since 2008, advocacy for inclusion and dignity of people with mental health and psychosocial issues and transforming lives of people living in vulnerable conditions has been at the forefront of KOSHISH’s goals with UNCRPD, 2006 at its core."
  },
  {
    "companyName": "Krish Home Studios",
    "logo": "https://merojob.com/media/cache/29/f5/29f5ca40304d60626679d71494932c70.jpg",
    "industry": "Architecture / Interior Design Firm",
    "about": "Established in 1997, Krish Home Studios has played a pivotal part in providing its esteemed customers with top-notch interiors and building materials to make their dream home happen. By delivering products ranging from doornobs to bathroom commodes and everything in between, Krish Home Studios hopes to help bring the customer's loftiest building ideas into a reality."
  },
  {
    "companyName": "Leading Dairy Industry",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Poultry / Dairy / Veterinary",
    "about": "Sujal Dairy P. Ltd."
  },
  {
    "companyName": "Lifestyle Apparels",
    "logo": "https://merojob.com/media/cache/d3/32/d332758679742aa1382c30199434f957.jpg",
    "industry": "Retail / Shops",
    "about": "An apparel retail mega store operating at Satdobato, Lalitpur and Pokhara is seeking to recruit dedicated and qualified candidates for following position:"
  },
  {
    "companyName": "Luzon Technologies Inc.",
    "logo": "https://merojob.com/media/cache/9f/ff/9fffde13a9cb24fdd7c7d6fc1053265e.jpg",
    "industry": "Software Companies",
    "about": "As a software development and Information Technology recruiting company, specializing in both applications development and infrastructure support, LuzonTech offers services in these two major areas. Luzon Technologies’ IT staff resources are the best way to enhance your IT staff and improve productivity without overstraining your budget. The contract staffing and recruiting services available through LuzonTech will supply you with the best IT talent available. Their services will augment your workflow, support new initiatives and help you meet project deadlines. Each individual is specialized in one or more specific areas which mean you gain access to expertise that you may not have had access to through your existing internal workforce."
  },
  {
    "companyName": "Magnus Pharma",
    "logo": "https://merojob.com/media/cache/cf/24/cf247565cb80341ba7b7b4d39f410833.jpg",
    "industry": "Pharmaceuticals / Healthcare",
    "about": "Magnus’s journey began with the vision to induce changes in the field of health care through innovation and creativity. Over the last few years, we have emerged out as one of the Nepal’s most admired pharmaceutical names among medical fraternity, for quality and creativity in our products and services. Today, we are one of the Nepal’s fastest growing pharmaceutical company with strong presence all over Nepal. Our success and incessant growth lies in impactful execution of successful and strategic moves made in the areas of formulation and development, marketing and product promotion. We use cutting edge technology and innovation to fulfill."
  },
  {
    "companyName": "Makesworth Accountants",
    "logo": "https://merojob.com/media/cache/e2/32/e23209de1a51999389063036eb7e119e.jpg",
    "industry": "Audit Firms / Tax Consultant",
    "about": "Makesworth Accountants is a reputable and leading firm of accountants and tax advisors based in the UK. Our team members are all highly competent professionals providing proactive and trustworthy advice to businesses, individuals, contractors, and SMEs. Our service includes account preparation to payroll, business advice to tax planning, corporate tax, VAT, and outsourced accounting to the UK and International Clients. We offer everything one would expect from a great accountancy firm. \n\nWe pride ourselves on providing our clients with attentive & personal service. While we have ambitions for growth we can guarantee that our high-quality service levels remain unchanged. We tailor our services and shape them to fit our clients’ needs because ultimately we are focused on helping our clients prosper.\n\nWe have embraced technology at the heart of our services and kept ourselves up-to-date with information to help the business grow.\n\nOur principle – resting on our core values of reliability, proactivity, integrity – is simple: To help our clients grow by investing in a team of talented & qualified accountants and innovative technology.\n\n\nOur professionals understand that time is valuable and we have partnered with leading cloud-based accounting software & apps to ensure that your investment in Makesworth is well returned, giving our client peace of mind and confidence required.\n\nMakesworth Accountants Pvt Ltd is a recently established branch office in New Baneshwor, Kathmandu, Nepal to help support the work of UK Practice. Hence we are always looking to recruit the right candidate with the right attitude who has the potential to become a high-quality accountant and also experienced individuals to become part of this growing and successful accounting firm. \n\nWe are one of the globally approved employers of ACCA so our candidates can qualify as ACCA members once they complete the minimum number of periods working in our company provided they have completed the ACCA exams. We belive in our team and always invest in their professional and personal training and development."
  },
  {
    "companyName": "Mills Berry International Pre-school",
    "logo": "https://merojob.com/media/cache/16/b2/16b24ad03984044acec100643026c34c.jpg",
    "industry": "Education - School & Colleges",
    "about": "The Millsberry School is a successful family of leading co-educational School providing an outstanding educational experience for students aged 6-18. Millsberry, the Secondary School, is one of the Kathmandu’s leading co-educational day schools; Millsberry international Pre-schools, are a day pre-school for pupils aged 2 to 6, which are situated in five different locations of Kathmandu valley, established in 2004. At MBS all aspects of our educational processes are carefully designed to cultivate and stimulate the intellectual, social, and personal development of the most important stakeholders at this institution; the students. Our students learn the International level curriculum in corporate with Nepal Govt. curriculum, in separate streams. As we are here to serve a global community, we assist internationally-mobile families in making a smooth transfer to any school system or graduate to universities world-wide."
  },
  {
    "companyName": "National Institute for Competitive Exams",
    "logo": "https://merojob.com/media/cache/ad/7d/ad7d3881e593cb13cc5e8cd8966be678.jpg",
    "industry": "Education - School & Colleges",
    "about": "National Institute for Competitive Exams (NICE) is an educational institution determined to be a solution for every government job aspirants. It runs both the online and physical preparation classes for competitive examinations, particularly conducted by Public Service commissions, Teachers Service commission, Banking Service and other government institutions. NICE invites applications from smart and dynamic candidates for the given positions:"
  },
  {
    "companyName": "Nepal Japan Educational Centre",
    "logo": "https://merojob.com/media/cache/52/d0/52d0b0d729ef19f295dffad60e958e46.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "We are a consultancy"
  },
  {
    "companyName": "Nepal Warehousing Company Limited",
    "logo": "https://merojob.com/media/cache/7d/af/7daf8233894f2ca219e4962d0aa63eab.jpg",
    "industry": "Agriculture, Forestry, Fishing and Poultry",
    "about": "Nepal Warehousing Company Ltd. is one of the largest private undertakings in the agriculture sector of Nepal which has been established with the objective to address gaps in agribusiness value chain. Nepal Warehousing Company Limited is broad-based with equity participation from Nimbus Group, Shikhar Insurance, NMB Bank, Team Ventures, Shreenagar Agro, True North Associates Investment Pvt. Ltd and other prospective public limited companies. In addition to modern storage, NWCL will facilitate transportation, assist in seeking finance, insurance and marketplace services to farmers, millers and traders.\n\nIn its early stage, the business will be managed with technical support from India’s largest operator of warehouses – National Commodities Management Services Limited, a Fairfax Company. NWCL has started to build large scale grain warehousing unit in over 12 Bighas land in three locations of the country viz Sunsari, Parsa and Kapilvastu which will allow farmers and alike to test, dry, and store their grains. The warehousing units will also provide auction centers along with warehouse receipt financing, allowing farmers to avail of financing based on the value of their stored grains. The company plans on building and operating at least one major warehouse in each of the seven states in Nepal."
  },
  {
    "companyName": "Nest Construction and Engineering",
    "logo": "https://merojob.com/media/cache/7d/51/7d511a52088ca6c9759d7325ded50091.jpg",
    "industry": "Construction Material and Equipment",
    "about": "Nest Construction Company and CLC block manufacturer is looking for qualified candidates for following position."
  },
  {
    "companyName": "New Business Age",
    "logo": "https://merojob.com/media/cache/9e/ea/9eeac47de027b6bb60d6e4995a1101c6.jpg",
    "industry": "Media / Publication (Newspaper, Magazines)",
    "about": "New Business Age Pvt. Ltd is a well-established media house of Nepal (set up in year 2001), which has been publishing, since 2001, New Business Age, an English Monthly and since 2005, Aarthik Abhiyan, a Nepali National Business Daily. Their websites are www.newbusinessage.com and www.abhiyandaily.com."
  },
  {
    "companyName": "Newspaper Posting",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Advertising Agency",
    "about": "-"
  },
  {
    "companyName": "NIBC Educational Foundation",
    "logo": "https://merojob.com/media/cache/2a/da/2adaa96d0a77179847931e895e5205d4.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "NIBC Educational Foundation is one of the leading educational consultancies in Nepal, which empowers thousands of Nepalese students to make right career and college/university decision. Our vision is to be the go-to career, test preparation selection & college/ university selection platform, for students considering higher education abroad.\n\nWe are looking for self-driven, result-oriented professional individuals for the following position:"
  },
  {
    "companyName": "NIC Asia Bank",
    "logo": "https://merojob.com/media/cache/1e/df/1edfcc597dffc7c083686d78bec6425f.jpg",
    "industry": "Banks",
    "about": "NIC ASIA Bank is one of the most reputed and No. 1 commercial bank in the country in terms of brand equity, risk-assets, deposit volume, and footprints. The Bank is currently on a lookout for a dynamic, result oriented, pragmatic, self-motivated and passionate candidates to join us in following position:"
  },
  {
    "companyName": "Orbit International",
    "logo": "https://merojob.com/media/cache/96/7c/967ce2f1cad5cde76056d60e82a96062.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "Orbit International is part of the prestigious Reliance Group Nepal that includes Reliance Cement Ltd, Reliance Paper Ltd., Yeti Flooring, Siddhartha Bank ltd. among others. Since 2009, Orbit International has added two new appliances brands within its portfolio - Haier and Digitron. Haier is the largest appliances brand in the world while Digitron is Orbit International’s own OEM brand."
  },
  {
    "companyName": "Oxford Travel & Tour",
    "logo": "https://merojob.com/media/cache/35/b8/35b80a605d9e74c5a29b8e90adff8081.jpg",
    "industry": "Travel Agents / Tour Operators",
    "about": "Oxford Travel & Tour"
  },
  {
    "companyName": "Pandora Group Of Companies",
    "logo": "https://merojob.com/media/cache/14/a7/14a793e2d5c6bf50326af2718c8c319d.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Pandora Group of Companies is an international media company having been institutionalized in 2020 by four young and dynamic entrepreneurs. With the experience of more than 5-years in the field, we have become one of the leading media houses in Nepal. The majority of our services are provided to clients based in the United States of America. We at Pandora represent a number of websites all related to Hollywood celebrities."
  },
  {
    "companyName": "Pantum Nepal",
    "logo": "https://merojob.com/media/cache/41/b4/41b44635dbf7699b8dce6efa46a15d26.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "Pantum is an international Brand that develops, manufactures, and sells laser printers and toner cartridges that are made in China for worldwide clients. Partum’s branded laser printers have advanced core technologies and provided users with reliable, cost-effective, and ecologically friendly printing solutions. The company includes a mission to provide users with solid, cost-effective, and ecologically friendly printing solutions.\n\nPantum is a new brand that has shown significant progress in the printing industry and market penetration around the world in a very short period. Pantum printers are currently marketed and distributed in China, the USA, Europe, Middle East, South Africa and spread over 40 countries and regions. Pantum sales branch companies and service centers have been set up in China, the USA, and Europe.\n\nPantum goal is to be the driving worldwide supplier of printing a solid solution, fetched successfully and naturally neighborly. We are always growing and idealizing our item line, which contains a single function, multifunction, and high-speed duplex printing. Printers are focused towards the government, enterprise, hospital, banking, SMB, SOHO users and so on. Our goal is to give rise to a New Era for Printing."
  },
  {
    "companyName": "Prabidhi Labs",
    "logo": "https://merojob.com/media/cache/ff/c9/ffc9a737ce5d3f8d488126940469e78a.jpg",
    "industry": "Software Companies",
    "about": "Prabidhi Labs is a full-service integrated IT firm that provides a wide range of services including website design and development, mobile app development, search engine optimization, e-commerce solutions, digital marketing, and more! We have a wide client base and extensive expertise working with both the private and governmental sectors, with a track record of delivering cost-effective and high-quality results and outputs. Our teams are located in Nepal, the United States, and Australia. When necessary, we choose to rely on the essential talents and expertise from others, as well as from around the world, via our links/network. We work with the best creative and technical artists from a variety of cultures and viewpoints, and we have the production power to ensure quality with managed scheduling, resulting in improved cost-effectiveness, higher quality, and production speed."
  },
  {
    "companyName": "Prashadi Multipurpose Co-operative Ltd.",
    "logo": "https://merojob.com/media/cache/5f/d3/5fd3752d5a0903ab373d236091386f13.jpg",
    "industry": "Finance Companies",
    "about": "We are a Finance company established on 2077 B.S. Currently we are operating from our head office which is located in Jhamsikhel. In near future we are also planning to expand our company to Bhaktapur and Kathmandu too. We are constantly thriving towards our goals and objectives which would help our customers, employees and as well as the nation overall."
  },
  {
    "companyName": "Raintree Tours and Travel Pvt. Ltd",
    "logo": "https://merojob.com/media/cache/21/2d/212dd264e59e126653178e4611ea935d.jpg",
    "industry": "Travel Agents / Tour Operators",
    "about": "Raintree Tours and Travel Pvt. Ltd. is a local investment and a prominent tour operator managed by experienced professional team handling outbound and inbound travel business. Furthermore, the company provides recreational and business travellers with professional service and consultation. RTTPL will position itself as a specialist in the field of cultural and adventure travel with the team of professional and expert trekking and tour guide with the long experience in tourism sectors."
  },
  {
    "companyName": "Rapid Web Solution",
    "logo": "https://merojob.com/media/cache/01/e2/01e27c4ec856d936eb8a88e74bec0fa2.jpg",
    "industry": "Information / Computer / Technology",
    "about": "We are a multi-national company with over 400+ staffs in all our offices across the globe. We have more than 40+ staffs in Nepal. We work in all type of small to large websites for clients all over the world."
  },
  {
    "companyName": "Rays Incorporate Pvt Ltd.",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Chemical and Medical Suppliers",
    "about": "We are supplier of Medical and Lab equipment."
  },
  {
    "companyName": "Relief Nepal",
    "logo": "https://merojob.com/media/cache/65/65/656588f716561d79d5e2917cf90260b4.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Relief Nepal  is a non-profit making, non-governmental, non-political, social development organization of Sindhuli district. It was established in 2008 AD with the core objective of vulnerable and marginalized people especially women, children, youth and people living with marginalized condition are empowerment and participated in decision process about the issue affecting their livelihood. It has successfully implemented Livelihood, Child Rights, WASH, Education and DRR projects in five districts. In partnership with World Vision International Nepal (WVIN), Relief Nepal is implementing \"Integrated Protection and Sponsorship Programme and KISHORI project(s)\" in Tinpatan Ward no.,4, 5, 6, 7, 8, 10, 11, Fikkal Rural Municipality- Ward no. 2, 3, 4, 5 and Golanjor Rural Municipality- Ward no. 1, 2, 3, 4, 6 of Sindhuli districts. We are looking for a qualified, competent, dynamic, Leadership and visionary qualitative candidates for the effective execution of the project at field which will be carried out in partnership with World Vision International Nepal for the following positions:"
  },
  {
    "companyName": "Rolling Stones School",
    "logo": "https://merojob.com/media/cache/d6/bc/d6bc8347ab8a5a0ef45ee2ae54c9c4d2.jpg",
    "industry": "Education - School & Colleges",
    "about": "The Rolling Stones School is an English medium school that gives emphasis on Early Childhood Development Programs and Arts & Music."
  },
  {
    "companyName": "Rudrabinayak Saving and Credit Cooperative Ltd.",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Banks",
    "about": "Rudra Binayak Saving & Credit Cooperative Ltd is a co-operative organization registered under the cooperative act 2048, which co-ordinates and  provides financial services among its members."
  },
  {
    "companyName": "Rural Self-Reliance Development Centre (RSDC)",
    "logo": "https://merojob.com/media/cache/3c/a0/3ca046c38d1b52e70a49c448cff6fc24.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "ग्रामीण स्वावलम्बन विकास केन्द्र(आरएसडिसी) २०४८ सालमा स्थापित एउटा गैरनाफामूलक सामाजिक संस्था हो । यस केन्द्रले काठमाण्डौको बूढानीलकण्ठ नगरपालिकाको सहमति र निर्णय अनुसार सोही नगरपालिकाको वडा नं. २ मा दातृनिकायहरुसँग मिलेर “सक्रिय सहभागिता, नविनतम सोचद्वारा प्लाष्टिक पुनः प्रयोग, वातावरण संरक्षण र महिला सशक्तिकरण (Protecting the environment and empowering women through their innovative and active involvement in the plastic recycling value chain - Womenpreneurs4Plastic) परियोजना सञ्चालन गरिरहेको छ । यस परियोजनाको मुख्य उद्देश्य आर्थिक–सामाजिकरुपले पछाडी परेका महिलाहरुलाई वातावरणीय अनुकुलनका लागि सशक्तिकरण गर्दै प्लाष्टिकको उचित व्यवस्थापन सहित उनीहरुलाई उत्पादनमूलक कार्यमा संलग्न गराई स्वरोजगार बन्नमा सहयोग पु¥याउने रहेको छ ।"
  },
  {
    "companyName": "Samata Foundation",
    "logo": "https://merojob.com/media/cache/26/7f/267fcc3bf69f746ce7ad554afa20a755.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Samata Foundation is a leading think tank committed to the development of the marginalized community through research and evidence-based informed policy advocacy. Established in 2009, the Foundation is widely recognized as a hub for Dalit studies and its contributions to promoting equity, inclusion, and rights of marginalized groups in Nepal and the South Asia region.\n\nThe Foundation seeks an experienced Lead Researcher ( Principal Researcher) and an experienced Researcher to carry out a research on “Causes of Climate Vulnerability, Conflict Dynamics and Existing Local Adaptive Capacities of Climate Vulnerable  Dalit Communities in Nepal” for a transnational project on climate change being implemented in Madhesh and Lumbini Provinces."
  },
  {
    "companyName": "Scott Wilson Nepal",
    "logo": "https://merojob.com/media/cache/de/64/de64accbae4b42afc8d6bb416e59957c.jpg",
    "industry": "Research Firms",
    "about": "S.W. Nepal Pvt. Ltd. (Scott Wilson Nepal/ SWN) is a wholly Nepali-owned multidisciplinary research and infrastructure development consulting service, provider. It has leading expertise in Nepal in Third Party Monitoring, capacity building of Local Governments in infrastructure service delivery, and a deep commitment to inclusive social and governance initiatives at different spheres of governance in Nepal. SWN is a choice of international development partners and the Government of Nepal for delivery of quality outputs in design and management of projects and programmes; green infrastructure development; social protection based programmes; field-based research works on social and governance issues including gender-related areas; and monitoring and evaluation of projects and programmes. It has a strong in-house management capability for undertaking the above assignments.\n\nWe encourage potential applicants to visit www.swnepal.com.np for more details on our team, location, and our services."
  },
  {
    "companyName": "Seed Financial Academy",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Education - School & Colleges",
    "about": "Seed Financial Academy is Nepal’s prominent acca center and acca learning provider of professional accountancy qualifications. Seed is a Gold Approved Learning Partner and also a Licensed CBE Center of ACCA, UK. The college is dedicated to provide excellent results under the able guidance of its professional management and dedicated faculty. The highly qualified and experienced faculty is committed to helping students excel in their endeavors."
  },
  {
    "companyName": "SeeLogic International",
    "logo": "https://merojob.com/media/cache/de/92/de92beb2f8b377661cb675da226048f9.jpg",
    "industry": "Software Companies",
    "about": "SeeLogic LTD is an award-winning CRM, ERP and complementary technology advisor who provides unbiased advice on the right solution to meet your business requirements. SeeLogic is one of the leading Microsoft Gold CRM partners, as well as a highly respected Microsoft Gold, Authorised Education Partner. We consult Business Process Mapping, SharePoint, Office 365, Data Migration and Digital Transformation.\n\nFor our clients, this means we provide exemplary advice and support on a wide range of services. For our staff, it means we provide experience and training, grounded in all systems and with multiple methodologies. At SeeLogic we take great pride in our values, and our team is the heart of our organization."
  },
  {
    "companyName": "Service Eye",
    "logo": "https://merojob.com/media/cache/e3/82/e382d03aeb488a79cec7bdeb68ee4f00.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Service Eye Private Limited is an IT Software Development and IT Service Provider Company with various other services that cater to the needs of the people at the cutting edge of information and technology. It aims to solve the day-to-day problems of the customers through mobile Apps/Web (IOS and Android Both Version) in a quick and efficient manner. We are a company dedicated to providing B to B Business Platform (Business X), Digital Transportation (Hello Sawari), Digital Education (Guru Mantra), Online News, and publication of books among others. We design and develop websites, do web hosting, sale and purchase websites, and e-commerce. We aim to innovate our services in the days to come and include other features and other apps.  We aim to provide the best quality services at the most affordable charges.  Our scope of work and services transcends borders."
  },
  {
    "companyName": "Shoyambhu Motor Pvt. Ltd.",
    "logo": "https://merojob.com/media/cache/cc/44/cc44060cdbadc713f3563f7697295889.jpg",
    "industry": "Repair/ Maintenance Services",
    "about": "Our Company is a service oriented Company as well as Parts suppliers."
  },
  {
    "companyName": "Siddhasthali Rural Community Hospital",
    "logo": "https://merojob.com/media/cache/96/57/9657e5c50935e892fb8719e2917b7848.png",
    "industry": "Hospital / Clinic / Diagnostic Centre",
    "about": "Siddhasthali Rural Community Hospital is a not for profit hospital located in Hetauda, Makwanpur, Nepal. More information: www.siddhasthalihospital.org"
  },
  {
    "companyName": "SK Technology",
    "logo": "https://merojob.com/media/cache/cc/8b/cc8bc27d7439bca8ab5d04c0f88b59e9.png",
    "industry": "Software Companies",
    "about": "SK Technology strives to create strong and well-guided communities in a select group of verticals. We operate one of the largest user-centric communities online with over 1.25 million members throughout our communities today, and continued growth into the future."
  },
  {
    "companyName": "Smart Data Solution",
    "logo": "https://merojob.com/media/cache/7a/0a/7a0a4e229bfac2d7b4149d2f61b18c16.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Smart Data Solutions(SDS) is Minnesota (US) based healthcare workflow automation company with its SDS software development Nepal.\n\nSDS has been managing 450 million healthcare claims transactions annually for over 19 years.\n\nWe specialize in providing US healthcare payers and networks with front-end medical claims processing services and EDI solutions to expedite and streamline operations."
  },
  {
    "companyName": "Sunaulo Parivar Nepal (SPN)",
    "logo": "https://merojob.com/media/cache/d1/52/d15229bcb61711d3b291a2d286535832.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Sunaulo Parivar Nepal (SPN), a local implementing partner of Marie Stopes International in Nepal, is a well-established NGO which is delivering Family Planning and Sexual Reproductive Health services through‐out Nepal via different service delivery channels: Centres, Outreach and Marie Stopes (MS) Ladies. It works in partnership with Marie Stopes International UK (MSI), a global charity for providing reproductive health services across the world with a mission of ensuring individual’s fundamental right to have children by choice not chance.\n\nWe are looking for qualified and competent candidates for the following position:"
  },
  {
    "companyName": "SunBi",
    "logo": "https://merojob.com/media/cache/3c/e8/3ce8512d0e1d582800470bcf3ea942c7.png",
    "industry": "Software Companies",
    "about": "With diverse and strongly qualified professionals acting as the core of the team, SunBi takes pride in its working environment fostering an atmosphere of dynamism, innovative thinking, and mutual respect. We have plenty to offer to our esteemed clients - ranging from a decade of expertise in the concerned field to our eternal effort to introduce innovations in our designs. At SunBi customer satisfaction is our first and foremost priority.\n\nWe seek to work in a deeply knitted manner with our clients, so as to accurately map their ideas to maintain the optimum quality of our designs. We mould our working experience with clients' vision of their designs, making our clients aware of the various choices in the process. We do not just seek to build a \"Pay me; Get your design\" relation but, we look forward to helping our clients understand the whole working process, enabling our clients to decide what they actually want."
  },
  {
    "companyName": "Surshala Music Academy",
    "logo": "https://merojob.com/media/cache/2c/7e/2c7ef93d6095960c7ea1c62307dc6ef5.jpg",
    "industry": "Education - School & Colleges",
    "about": "Surshala Music Academy Pvt. Ltd is leading music academy of Nepal which was established in 2004 AD, officially registered with company registered in 20010 of Nepal with the objective to provide quality music education for children and youth in Nepal Surshala is a first & only music academy affiliated with CTEVT Nepal (Council for Technical Education and Vocational Training) it provides the vocational music courses with the syllabus of CTEVT. It also prioritizes employment through music who aspire music as a career choice with practical and theoretical methods of learning vocal, Instruments and dance. \n\n\n\n\nSurshala Music Academy has a sister organization named \"Sushala Foundation is a non profitable organization which was established in 2014 AD, with the objective to provide quality music education for children and youth in Nepal who comes under financially weak, socially backward, differently abled, and musically talented categories. Surshala music academy and Surshala Foundation together organized musical therapy program \"Surshala Musial Journey\" to more than 12000 during earthquake time, Surshala organized national and international level musical workshop and Singing reality competition \"Surshala Idol Junior\" in 2015 which was supported by Patanjali Ayurved, Nepal and it was also telecast 26th episode on Kantipur Television. Surshala produced many renowned young talents. Surshala's latest productions are Pritam Acharya and Aayush K.C got 1st and second runners up SaReGaMaPa Lil Champs Zee TV India in 2019/20. Surshala organized a training workshop on Music Education for children in collaboration with UNESCO Office in Kathmandu and Nepal National Commission for UNESCO. Surshala provides opportunities to potential children, youth and adults through music education and recording songs, making videos and unplugged programs on television and youtube. It's conducting culture exchange program in India, South Korea, Uk and many places.\n\nOur Mission\n\n To provide quality music education to the children and youths in Nepal\nTo provide Vocational Music and Teachers Training (Singer/ Musicians) courses affiliated with CTEVT Nepal for youth and people from different communities to generate employment opportunities in the music field.\nTo provide professional trained music teachers to different schools in Nepal\n\nOur Activities\n\nProviding music education (Vocal, Instruments & Dance) for children and youth in Nepal since 18 years.\nProviding \"Music Teachers Training\" (Singer/ Musicians) Vocational Music Training affiliated with CTEVT Nepal for youth to generate employment opportunities in the music field.\nCoordinating and providing \"Music Teachers\" to the different schools and colleges\nSupplying different Musical Instrument to schools, colleges and Recording new songs, Albums, Videos for interested and talented students\n Organizing and participating at national and international level music competition and musical event such as a \"Surshala Idol Junior\", Surshala Studio, Saregamapa Lil champs, ZEE TV, Superstar Singer SONY TV India, Nepal Idol, Voice of Nepal, Voice of Kids Nepal etc."
  },
  {
    "companyName": "SUVI School",
    "logo": "https://merojob.com/media/cache/73/c9/73c922ca26471ed9feb93546e2bba487.jpg",
    "industry": "Education - School & Colleges",
    "about": "SUVI School is an inclusive school that strives to provide quality education to all the children irrespective of their colour, creed, caste, physical abilities, nation, religion or any other entitlement. We believe that every child is different and has unique purpose and capabilities. Respecting the fact, we create an ideal and caring environment where children grow and learn independently as well as develop and flourish mentally, morally, socially and physically."
  },
  {
    "companyName": "TAMARIND GROUP OF COMPANIES",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Banquet / Catering",
    "about": "Group of companies that provides the best services in food and beverage industry."
  },
  {
    "companyName": "Technovate International",
    "logo": "https://merojob.com/media/cache/23/95/23954544162acc3c236132f8e4011ba1.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "Technovate International Pvt. Ltd was established with an objective to provide end-to-end ICT Products and Solutions in Nepal market. Our products and solutions are mainly targeted to Internet Service Providers, Cable TV Operators, Surveillance Solutions Providers, Datacenters, IT Infrastructure Solution Providers, System Integrators and also providing solutions to Telecommunications. Aligning with our mission we thrive to deliver quality products and solutions; and win customers’ trust and confidence through 24/7 after-sales-support with complete ownership to timely addressing the customer problems. We believe in professionalism and ethical business practices and demonstrate integrity to all the stakeholders associated with our business."
  },
  {
    "companyName": "Tech One Global",
    "logo": "https://merojob.com/media/cache/de/a9/dea9248bd3ecaec84c1fd863d30a4c65.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Tech One Global is multinational company with branches in more than 8 countries. For more than a decade, Tech One Global has been committed to offering client-oriented services focused on facilitating efficiency, innovation, and creativity in the field of information technology. From software solutions developments to enterprise software distributions, from document management to business process outsourcing services and from learning solutions to IT certifications, Tech One Global offers a range of products and services that adapt to today’s trends in business and IT.\nTech One Global operate globally and is the Gold Certified Partner of Microsoft in Nepal. \n\n Learn more at www.techoneglobal.com\n\n \n\nWHY JOIN US: Tech One Global believes that the technological revolution gathers its strength from the people. The company’s growing team of employees come from diverse professional and cultural backgrounds. Tech One Global encourages an open workplace that values collaboration, teamwork, and individual growth. Our team members are empowered and take a proactive approach to providing solutions and delivering results."
  },
  {
    "companyName": "Tej And Karan Enterprises",
    "logo": "https://merojob.com/media/cache/c1/d6/c1d6b4d68647645b7c28bcf31a3d38d2.jpg",
    "industry": "Automotive Sales, Support & Service",
    "about": "Tej & Karan Enterprises is a leading house of automobiles dealer and real estate which is under a single proprietorship. It was established on 2046/5/5. It is Nepal's first reconditioned vehicle showroom. It is situated in Milan Marg, Teku-12, Kathmandu. We deal in all kinds of brand new, reconditioned, used four-wheeler vehicles and real estate as well (house, land, and various other properties). We are very much interested in our customer's choice to provide a conditioned vehicle as they hope so, we are eager to know their interests to choose best-conditioned vehicles which they can resell also. We aim to rock the Nepalese market."
  },
  {
    "companyName": "Texas Int'l Secondary School",
    "logo": "https://merojob.com/media/cache/b2/73/b27384e79a3bdde53898f9d9190c6f86.jpg",
    "industry": "Education - School & Colleges",
    "about": "Texas School is Secondary Level School. It is fully an English medium school. It serves quality education to the students."
  },
  {
    "companyName": "Thames International College",
    "logo": "https://merojob.com/media/cache/f2/44/f244381ee0adab16ddb039a0b0454d0a.jpg",
    "industry": "Education - School & Colleges",
    "about": "Thames International College is a premier academic institution offering variety of undergraduate and graduate programs. Located in the heart of the city precinct Baneshwor, a cultural melting point of communities from all over the country, the College caters to the students from all corners of Nepal. The College comprises of two schools: School of Business and Technology and School of Social Sciences and Center for Continuing Education."
  },
  {
    "companyName": "The Accelerating Public and Private Investment in Infrastructure Component (APPIIC)",
    "logo": "https://merojob.com/media/cache/32/a0/32a0a6a72024ece43c708a1f1f079384.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "The Accelerating Public and Private Investment in Infrastructure Component (APPIIC) of the UKAID funded Accelerating Investment in Infrastructure in Nepal (AIIN) programme is managed by IMC Worldwide: A DT Global Company. The UK Government’s Department for International Development through APPIIC supports the easing of constraints that impede investment in infrastructure and Investment Board of Nepal (IBN) in investment promotion, project development and the implementation of private and public infrastructure projects."
  },
  {
    "companyName": "The International Centre for Integrated Mountain Development (ICIMOD)",
    "logo": "https://merojob.com/media/cache/4c/1b/4c1b0e6accb26a4bbc7720f6ae282b31.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "The International Centre for Integrated Mountain Development (ICIMOD) seeks to enable sustainable and resilient mountain development for improved and equitable livelihoods through knowledge generation and regional cooperation.\n\nICIMOD is a regional intergovernmental learning and knowledge-sharing centre serving the eight regional member countries of the Hindu Kush Himalaya (HKH) – Afghanistan, Bangladesh, Bhutan, China, India, Myanmar, Nepal, and Pakistan. Working in partnership with regional and international organizations, ICIMOD aims to influence policy and practices to meet environmental and livelihood challenges emerging in the HKH. ICIMOD provides a platform for researchers, practitioners, and policy makers from the region and around the globe to generate and share knowledge, support evidence-based decision making, and encourage regional cooperation.\n\nICIMOD works through its six Regional Programmes: 1) Adaptation and Resilience Building, 2) Transboundary Landscapes, 3) River Basins and Cryosphere, 4) Atmosphere, 5) Mountain Environment Regional Information System, and 6) Mountain Knowledge and Action Networks. These regional programmes are supported by four Thematic Areas – Livelihoods, Ecosystem Services, Water and Air, and Geospatial Solutions – and underpinned by the Knowledge Management and Communication (KMC) Unit. ICIMOD seeks to contribute to reducing poverty and vulnerability and improving the lives and livelihoods of mountain women, men and children, now and in the future.\n\nThe KMC Unit serves as a resource for the organization through preparation and distribution of technical publications and information materials, media-related activities, outreach events, content development, and maintenance of the internal and external websites, all in line with the ICIMOD branding policy."
  },
  {
    "companyName": "The Leprosy Mission Nepal (TLMN)",
    "logo": "https://merojob.com/media/cache/88/6b/886b4b851a7354e1816b60d486ac8a01.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "The Leprosy Mission (TLM) is a UK based international non-government organization active in 34 countries; started its work in Nepal from 1957 with establishment of Anandaban Hospital in Lele, the sourthern part of Lalitpur. However, from 2005 TLM Nepal has been working as independent NGO in partnership with TLM international and the Government of Nepal to provide specialist tertiary care and technical support for leprosy control programs. It also undertakes internationally recognized research into leprosy and implements disability inclusive community development programs through its own activities and strategic partnership.\n\n\nBeing one of the largest NGOs in the country working in the field of leprosy, TLM Nepal mainly focuses in working with and for people affected by leprosy. Its development interventions focuses in the areas of health, capacity building, education, sustainable livelihoods, community development, advocacy and research working towards equity and inclusion of people affected by leprosy and disability in the development process."
  },
  {
    "companyName": "ThemeGrill",
    "logo": "https://merojob.com/media/cache/e9/2f/e92fd4ca7adb4bb1695a2d6af9c12f49.jpg",
    "industry": "Software Companies",
    "about": "ThemeGrill (themegrill.com) is one of the leading WordPress Themes/Plugins webshops in the world (yes, not just of Nepal). Our themes/plugins have been loved by people all around the globe. Currently, our themes empower more than 400,000 sites and get over 5000 plus downloads on a daily basis.  \n\nThemeGrill is a team of the young and energetic people. Here, we not only work in a fun way but also help each other for the growth and development of an individual’s potential. So, if you are a young enthusiast desiring to take your career higher in the WordPress industry, ThemeGrill is the right place for you."
  },
  {
    "companyName": "TO THE NEW",
    "logo": "https://merojob.com/media/cache/8d/49/8d49c614b2b72dde89f6bb0227f782df.jpg",
    "industry": "Information / Computer / Technology",
    "about": "TO THE NEW is a digital technology company providing digital transformation and product engineering services to ISVs, Consumer Internet, and large enterprises across the globe. We design & build digital platforms and products with Cloud and Data at the focal point by working on cutting-edge technologies"
  },
  {
    "companyName": "Troika International",
    "logo": "https://merojob.com/media/cache/e5/fa/e5fa7fe9f9448fc0c176dd27a576f7d2.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "We are an established trading and import company mainly dealing with medical equipments, surgical goods, and bio-technology products catering mostly to health and hospital segments of Nepal for more than 12 years in the medical field.\n\n We have a vision to promote and distribute such essential surgical/medical products of today's need of high quality, yet of reasonable cost with better service and support to the medical institutions/hospitals in Nepal."
  },
  {
    "companyName": "Truvise Education",
    "logo": "https://merojob.com/media/cache/59/79/5979e5af72a295f05406be9266d728a2.jpg",
    "industry": "Consulting / Legal",
    "about": "Educational Consultants"
  },
  {
    "companyName": "UNFPA Nepal",
    "logo": "https://merojob.com/media/cache/83/dd/83dde201869ce8edfddf4fcf3aec0289.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "UNFPA, the United Nations Population Fund, is a voluntary-funded international organization with a presence in over 150 countries, including Nepal. UNFPA is guided by the Programme of Action of the 1994 Cairo International Conference on Population and Development (ICPD) and the Sustainable Development Goals. Its mission is to ensure that every pregnancy is wanted, every childbirth is safe and every young person’s potential is fulfilled.\n\nThe work of UNFPA is based on the premise that all human beings are entitled to equal rights and protections. We focus on women and young people because these are groups whose ability to exercise their right to sexual and reproductive health is often compromised. Our work is informed by an understanding of population dynamics, human rights and cultural sensitivity.\n\nUNFPA in Nepal\n\nUNFPA support to Nepal began in 1971 and has evolved in response to the changing national contexts. The current 8th Country Programme (2018-2022) is in line with Sustainable Development Goals, ICPD Programme of Action, the UN Development Assistance Framework (UNDAF) for Nepal and national priorities set by the Government of Nepal.   \n\nUNFPA partners with the Government of Nepal, youth and women’s organizations and development partners to advance its mission. Under the 8th Country Programme and in line with its mandate, UNFPA Nepal is working around the following areas:\n\nSexual and reproductive health and rights: UNFPA is supporting national efforts in Nepal to improve the sexual and reproductive health of the most marginalized adolescent girls and women. The Fund is largely focusing on youth aged 15-24 and the most marginalized women addressing both the demand and supply sides of reproductive health services to improve access to information and services on maternal health, family planning, and sexually transmitted infections, including HIV.\n\nGender equality: UNFPA’s support to the Government of Nepal under this overarching theme seeks to ensure that vulnerable groups experience greater self-confidence, respect and dignity. We are building national capacity in the health sector to address gender-based violence (GBV), prevent child marriage and other harmful practices, and working to enhance the knowledge and capacity of men, women and communities to GBV.\n\nAdolescents and youth: Investing in young people, especially the vulnerable and the marginalized, is a priority for UNFPA Nepal. The country has a large adolescent and youth population. Nepal is experiencing a demographic window of opportunity, a ‘youth bulge’. Nepali youth face several development challenges, including access to education, employment, gender inequality, child marriage, youth-friendly health services and adolescent pregnancy. Yet, with investments in their participation and leadership, young people can transform the social and economic fortunes of the country. UNFPA Nepal works with the government and partners to advocate for adolescents and youth’s rights and investments, including education, livelihood skills and health, including sexual and reproductive health.\n \n\nPopulation dynamics: Population megatrends at the national and sub-national levels in Nepal continued rapid population growth, population aging, urbanization and migration — not only frame the entire development debate, they demand a reconsideration and re-conceptualization of what will be the main challenges for a new Nepal. Without an adequate understanding of how Nepal is changing from a demographic perspective, forward-looking planning and agenda setting will be of little value. Keeping this in mind, UNFPA Nepal is working with the government to ensure that national, sectoral and decentralized policies and plans address population dynamics and the interlinkages with gender equality, poverty reduction, the needs of young people, and reproductive health, including family planning."
  },
  {
    "companyName": "United Academy",
    "logo": "https://merojob.com/media/cache/a5/78/a578e7cf3655b342bb73783aacc88539.jpg",
    "industry": "Education - School & Colleges",
    "about": "United Academy follows scientific teaching techniques, enabling students to approach their subjects with curiosity and keen insight. It is committed to bring out the best in students and strongly believes that good education is linked with discipline so that it becomes an integral part of their life. Efficient management at UA creates a congenial atmosphere for quality education. It also provides its own annual academic calendar before the start of the new academic session."
  },
  {
    "companyName": "Veritacore",
    "logo": "https://merojob.com/media/cache/d8/e6/d8e6c07ce1a5735efd36e2fde225dc0c.jpg",
    "industry": "BPO / Call Center / ITES",
    "about": "Veritacore is a unique BPO that exists to provide employment for individuals from disadvantaged communities, and through this, transform their lives via a computer-based career. We believe that the best workplace connects your skills, energy and talent to purpose.\n\nSince 2014, we have been keeping true to our purpose and impacting the lives of hundreds of women and men in Cebu, Philippines.   Our management team comprises of dedicated and experienced BPO professionals who go above and beyond to make a difference in the lives of our employees.\n\nWe are growing rapidly and now over 200 strong - and are making a name as a world-class company for digital media editing.  And we are hiring to support the next exciting phase of our growth into leading digital media technology in our new branch office in Kathmandu."
  },
  {
    "companyName": "View9",
    "logo": "https://merojob.com/media/cache/20/97/2097bd4b768614cc959a44ac050d6e8b.png",
    "industry": "Information / Computer / Technology",
    "about": "View9 is a passionate and award winning team of creative thinkers and digital experts united to provide high quality and trustworthy services in the areas of web, software and mobile apps. We work with business of all sizes, from small startups, medium sized businesses delivering both B2B and B2C digital solutions. With our offices in Kathmandu, Brisbane, Sydney and New York, we have been able to serve clients of large geographic spans."
  },
  {
    "companyName": "Wide Range International",
    "logo": "https://merojob.com/media/cache/0f/26/0f26769166a3f1f757b83d36b8f1a30a.jpg",
    "industry": "Other",
    "about": "Established in 2010, primarily to cater to the needs of students pursuing their higher studies in India, WRI grew leaps and bounds into one of the leading educational consultants of the nation. Today, our area of operations include career counselling, offshoring academic degrees, bringing in reputed universities around the world to conduct their degrees in Nepal."
  },
  {
    "companyName": "WorldLink Communications",
    "logo": "https://merojob.com/media/cache/b4/1b/b41bb9fd52055ca0496f0de8e9b44d8d.jpg",
    "industry": "ISP",
    "about": "WorldLink is the largest Internet and Network Service Provider in Nepal and one of the most prominent IT companies. Founded in September 1995 with the aim of providing Internet and IT services by its present Chairman and Managing Director, Dileep Agrawal. WorldLink started off by providing store-and-forward e-mail services over a dial-up link to the Internet in the US. In March 1997, WorldLink started providing full Internet access over a dedicated leased-line to the Internet backbone in the US through Teleglobe International. From September 1999 till June 2008, WorldLink has been connecting to the Internet over a direct satellite uplink through its own VSAT terminal, thereby completely bypassing Nepal Telecommunications Corporation, the local PTT.\n\nWorldLink serves households, small and medium-sized enterprises (SMEs) and enterprise clients. It is the fastest-growing private ISP in the country and has a presence in 67 districts out of country’s 77 districts. Currently Worldlink has around 300,000 household subscribers spread across the country. The company plans to reach all the local bodies by end of 2023.\n\nSince 2012, WorldLink has rolled out a fibre to the home (FTTH) network, which it intends to expand across Province 3 and 4 towns and rural areas at affordable prices."
  },
  {
    "companyName": "World Vision International Nepal",
    "logo": "https://merojob.com/media/cache/40/a0/40a0400004dbf2b47fb2d1d417f199cb.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "\"World Vision is a child focused relief, development and advocacy organization that has contributed to transformation in the lives of millions of children around the world in vulnerable situations. We are driven by Christian values to serve children and families regardless of their religion, age, gender, ethnicity, class and caste. We are looking for potential Nepalese candidates to fill out the following position:\""
  },
  {
    "companyName": "YCO Solutions",
    "logo": "https://merojob.com/media/cache/bb/9d/bb9d75182446bb8715ac94d7e7b147e1.jpg",
    "industry": "Information / Computer / Technology",
    "about": "YCO Solutions Private Limited is a privately held system integration company that focuses on providing world class technological service to Nepal's capital market. We have been responsible in developing the TMS-NEPSE System from the ground up and integrating it to the capital market. Along with the core development of the system, we also provide hosting services to all NEPSE licensed brokers along with day to day support. We are looking for candidates that have the technological knack and capital market interest to further bolster our core team and provide better service to the citizens of the nation."
  },
  {
    "companyName": "Youngzsoft",
    "logo": "https://merojob.com/media/cache/49/a0/49a06238cbc3a18b07af3a4b8837e49e.png",
    "industry": "Software Companies",
    "about": "Youngzsoft, a company that has been concentrating on server software and network based software develop and related services for more than 10 years. We have finished many products and some of them are very successful such as CCProxy - an easy-to-use and powerful Internet connection sharing software, AA Mail Server - Based on Database, Intranet&Internet mail server software, CCBoot - Diskless boot system...\niCafeCloud - Complete solution for Game Centers"
  }
]