[
  {
    "companyName": "Aakarshan International",
    "logo": "https://merojob.com/media/cache/01/0e/010e017f07ac3d07e7acac714da39658.jpg",
    "industry": "Manpower Recruitment",
    "about": "Aakarshan International Pvt. Ltd is a leading sourcing and recruiting organization, having more than 17 years of expertise in this field and sprinting with the international standard under compliance of the legislation of ISO 9001:2015, seeking sincere, hardworking and creative candidates for following positions.\n\nAakarshan is committed for ethical and responsible hiring . With the 17 years of wonderful legacy in the recruitment filed we believe on mapping the customers journey undergo with the customer culture for work. We are providing manpower from Nepal to; Malaysia, Saudi Arabia (KSA), Qatar, Bahraina, UAE and so on. For more information you can also log on to www.aakarshannepal.org\n\n\n''An Ethical & Responsible Recruitment Organization''"
  },
  {
    "companyName": "AAS OUTSOURCING",
    "logo": "https://merojob.com/media/cache/c1/8c/c18c9410d0e03d0ff493d581dcd42456.jpg",
    "industry": "Audit Firms / Tax Consultant",
    "about": "AAS Outsourcing is working hands-on-hands with AGFS Australia exploring Nepalese and Australian market.\n\nIt is one of the significant emerging entity of Chartered Accountants in Nepal. \n\nSince its inception, AAS has consistently aimed at being recognised by the business community as the leading professional services entity. The company maintains high ethical, professional and technical standards.\n\nIt has a dynamic team of Chartered Accountants and specialised experts from different fields. Partners and staff have diverse working background including resorts, education centres, IT companies, banks, trading and manufacturing entities, medicals and other sectors of business.\n\nOur specialised team of accountants provide a comprehensive range of Assurance, Taxation Services and Corporate Advice to the prospective clients in Nepal. AAS retains professionally qualified and well experienced personnel, who are supplemented with special training in multiple areas, to add value to the organisation."
  },
  {
    "companyName": "A Boutique Property",
    "logo": "https://merojob.com/media/cache/ca/c6/cac6764ce060901ee5fb97e5243fe4e3.jpg",
    "industry": "Hotels / Resorts / Restaurant",
    "about": "18 room experiential boutique property in Bhaktapur set to open late 2022, managed by Thailand based hospitality company.\n\n\t\nReplyForward"
  },
  {
    "companyName": "Ace",
    "logo": "https://merojob.com/media/cache/84/de/84de55aac8cc72224ebeaad930ff3c18.jpg",
    "industry": "Education - School & Colleges",
    "about": "Ace Institute of Management & Ace International Business School - are committed to enhancing learning outcome and experience of students. In the process of strengthening our team of collaborators, we invite applications from individuals with passion for education and creation of learning experiences for students."
  },
  {
    "companyName": "Ace Media and Marketing",
    "logo": "https://merojob.com/media/cache/c2/21/c2210b9bcc36398e9af3d14fc27de9c4.jpg",
    "industry": "Advertising Agency",
    "about": "Ace Media and Marketing is a young and enthusiastic agency designed to meet the needs of result oriented and innovative advertising and public relations for its clients.\n\nAce is now looking for energetic and potential candidates in the field of marketing, design and administration."
  },
  {
    "companyName": "Alfa Beta Institute",
    "logo": "https://merojob.com/media/cache/9d/bb/9dbb9ace3ad93e192dcef73a8f298a9c.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Alfa Beta has gloriously completed 30 years in the field of International Education Consulting and is proudly representing more than 300 institutions from over 18 countries. Since its establishment, the organization has been dedicated to helping students make the right choice of their education and future careers globally. \n\nAs a member of the AIRC and Prometric authorized Service Provider, we follow a very strict guideline of operations and have developed our working procedures accordingly. In these years we have grown to ten centers across the country and an onshore center in Sydney Australia. We are today the largest study abroad and test preparation center in Nepal touching and changing the lives of over ten thousand students annually.\n\nAwarded with “Nepal’s No.1 Business Partner” for 2017, 2018 and again in 2019 by IDP IELTS we have also been trusted by global organizations such as Pearson and ETS who have authorized us to run their test centers at our premises. \n\nWe believe that there is a tremendous potential in every individual and all that is needed to tap this potential is to give the individual the space to grow and explore."
  },
  {
    "companyName": "AL Hayat Management",
    "logo": "https://merojob.com/media/cache/96/24/96247664abfb089d36ca77079159523d.jpg",
    "industry": "Manpower Recruitment",
    "about": "We are pleased to introduce ourselves a major manpower recruitment company in Nepal, has been duly incorporated as a company M/S. “Al-Hayat Management System (P). Ltd.” And registered under Ministry’s of labor Government of Nepal Labor License No: 336/059/60 and also the member of Nepal Association of Foreign Employment Agencies (NAFEA). The main business of the company is to provide educated, experienced and dedicated skilled candidates to a diverse international domestic client."
  },
  {
    "companyName": "Aloi",
    "logo": "https://merojob.com/media/cache/70/01/7001afeabae3569ac05e801333b7f558.jpg",
    "industry": "Software Companies",
    "about": "Aloi Private Limited is a technology company that builds loan insight software."
  },
  {
    "companyName": "AlphaBetaTheta Technologies",
    "logo": "https://merojob.com/media/cache/ac/e5/ace5efc05a9a3104d2145726a4557ca1.png",
    "industry": "Software Companies",
    "about": "Alpha Beta Theta Technologies is an IT services and consulting business. Our purpose is to support our clients to achieve better solutions and outcomes. We are committed to making our clients’ work simpler by providing a wide range of specialized services like web development, software development and IT consulting."
  },
  {
    "companyName": "Aqore Software",
    "logo": "https://merojob.com/media/cache/e9/41/e941fcf1d5ad45e0da10119d816da1bc.jpg",
    "industry": "Software Companies",
    "about": "Aqore is a company founded by 2 successful software entrepreneurs with a proven record of building an international product used by thousands of users in the US and Canada. \nCompany is in process of procuring resources to build yet another product targeted for international market. \nWith a work hard/play hard motto we expect employees to grow with the company. Selected group of individuals will be working in multiple small agile startup teams.\n\nRun and managed by people with cumulative 50 years of industry and technical experience.\nCollaborative expertise in enterprise level product delivery, migration and security solutions\nOffer best solutions to clients to support their industry goals.\n\nEmployee Benefits:\n\nCompetitive Salary\nMedical Insurance\nLunch Allowance\nTeam Building events\nSports events\nCIT Option\nFlexible work environment\nVarious Skill Development Training\n\nWork Culture:\n\nYoung and dynamic work culture\nWork hard, play hard\nRight person for the right job\nGrow with us\nPassionate, committed and creative culture"
  },
  {
    "companyName": "Arsia Group Of Companies",
    "logo": "https://merojob.com/media/cache/10/db/10dbd17cf4be3a79516a76547fe0b7f4.jpg",
    "industry": "Consumer Products / FMCG",
    "about": "Arsia Group of companies is a parent companies of various companies. The companies are scattered around the various places of Nepal, having major business places in Kathmandu, Bhairahawa, Janakpur. The group companies was formed to manage and direct overall companies within the same shareholding of Mr. Nav Raj Pokhrel and Mr. Satish Pokhrel. \n\nOriginating from FMCG and Cement Industry in Nepal, Arsia Group now has become the family of 500 plus employees and 30 plus companies.  Arsia group Group of Companies has invested in more than 11 major sectors of Nepalese economy. Arsia Group now has become one of the leading corporate enterprise in Nepal."
  },
  {
    "companyName": "Aseemit Technologies Pvt Ltd",
    "logo": "https://merojob.com/media/cache/d8/0f/d80f417ce580e122578c318cfddaf845.jpg",
    "industry": "BPO / Call Center / ITES",
    "about": "1. Business Consulting Services\n\n\n2. Business Continuity Technical Solutions\n\n3. Skill Enhancement and Training Services\n\n4. Business Process Outsourcing"
  },
  {
    "companyName": "Asterisk Digital",
    "logo": "https://merojob.com/media/cache/7a/00/7a0079a3677a58e8e38fb15de2fa720d.png",
    "industry": "Information / Computer / Technology",
    "about": "We are start-up software development and digital agency company. We operate from Nepal but will find contact center globally. We would like to welcome wide variety of clients and offer a unique blend of design, creative ideas, marketing, advertising, web development."
  },
  {
    "companyName": "Beema Market",
    "logo": "https://merojob.com/media/cache/0e/57/0e57b1bdb04a80c2479ff99298d61f73.jpg",
    "industry": "Finance Companies",
    "about": "We are a insurance Web aggregator company."
  },
  {
    "companyName": "Begnas Lake Resorts and Villa",
    "logo": "https://merojob.com/media/cache/a2/53/a253c5e224987e252ba4b625553bfa16.jpg",
    "industry": "Hotels / Resorts / Restaurant",
    "about": "Begnas Lake Resort & Villas is located 12 Km East of bustling Pokhara town lies this wondrous paradise – the Begnas lake known for its clear spring-fed water and lushly vegetated surroundings – just the setting for your long-deserved escape to another world! The resort is situated on the southern bank of the lake with every guestroom affording spectacular mountain views"
  },
  {
    "companyName": "BIDH Group",
    "logo": "https://merojob.com/media/cache/95/7a/957a52aa2ad78970a0a805424987b23b.jpg",
    "industry": "Multinational Companies",
    "about": "BIDH Group is an emerging organization that have different verticals of business viz. Medical Supplies , Remittance,  IT, Electronic Items, Automobiles, Mining and many more."
  },
  {
    "companyName": "Bikash Surgical Concern",
    "logo": "https://merojob.com/media/cache/d5/5c/d55ccbbd50d8fd55b5c2ef8db49a25a9.jpg",
    "industry": "Pharmaceuticals / Healthcare",
    "about": "Bikash Surgical Concern, having registered office at Lokanthali, Bhaktapur Nepal and branch office at Tripureshwor, Kathmandu, Nepal is a established Importer and Suppliers of all kinds of Surgical Items, Scientific Equipments, Glass wares, Diagnostics Kits, Chemicals and Hospital Furniture etc. since 2049 B.S 1989 (AD). We are supplying in different kinds of health relative sectors like Government and Non-Government Hospitals, Projects, INGO, NGO, Nursing Homes etc."
  },
  {
    "companyName": "Biomed International",
    "logo": "https://merojob.com/media/cache/24/3f/243f4567df4c2bc6cbe94f1b01586cc0.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "Established in 1998, as an extension of the existing healthcare business since last six decades, we are importer & distributor of all dental products also involved in designing, developing, planning and upgrading treatment centers/clinics, and dental hospitals. Today we are privileged to be known as one of the leading distributors in Nepal with more than hundred reputed companies and more than 10,000 variety of products dental products in our portfolio."
  },
  {
    "companyName": "Brain Tech Service",
    "logo": "https://merojob.com/media/cache/b8/53/b85345d064d16d87aeb041d2a6bcf060.jpg",
    "industry": "Professional, Scientific, Technical Services",
    "about": "Brain Tech outsources legal, medical-legal computer-related services to foreign clientele."
  },
  {
    "companyName": "Bravo Connecting Digitally",
    "logo": "https://merojob.com/media/cache/ac/5c/ac5c8f2325a3e92ad7cee5636feabd42.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Group  of company"
  },
  {
    "companyName": "Bridge Education Foundation",
    "logo": "https://merojob.com/media/cache/2f/d9/2fd9aeb6522d4258ff453ce5a51397d5.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Bridge education foundation is well-established and esteemed educational consultancy based in the heart of Kathmandu, Nepal. Branch offices of Bridge Education Foundation are located at Birtamode, Damak, Hetauda, Simara and Pokhara. We help students to pursue higher education overseas. Motivated by our core values, ethics, expertise and leadership, we are one of the most trusted name in the field of overseas education. Facilitating best educational opportunities in the prestigious universities abroad, we rightly set the academic goals for aspiring students.\nCommitted to the objectives of integrity and excellence, Bridge is an acknowledged leader in overseas educational consultancy in Kathmandu, Nepal. We offer students a choice of thousands of courses at various leading educational institutions in USA, Canada, Australia, UK and Europe."
  },
  {
    "companyName": "Brihaspati Vidyasadan",
    "logo": "https://merojob.com/media/cache/f9/5e/f95e28243925015bd4cbe6611a41ebdc.jpg",
    "industry": "Education - School & Colleges",
    "about": "Situated in the heart of Kathmandu valley, Brihaspati Vidyasadan (BVS) is ranked amongst the top 10 schools of Nepal. Consistently for the past 36 years, BVS has delivered high academic standards in SLC and strives to combine traditional and progressive pedagogy. With high emphasis on sports and extra curriculum, students from BVS excel in plethora of fields including sports, academics and arts. To support the students learning, BVS has excellent infrastructure and highly experienced team of teachers and coordinators. Every student is special at BVS. With more than 100 teaching staff at school, every child is provided with care and guidance they need. \n\n Vision: \n\n Imparting quality education and nurturing human values. \n\nMission: We explore the potential of individual students and promote excellence in all walks of life. \n\n We fulfill our mission by, \n\nOffering a rich academic, co-curricular and extra-curricular experiences that require active participation and personal commitment, extending learning beyond the traditional classroom. \nA balance of emphases on mind, body and spirit encouraging students to grow into a healthy, happy, caring and whole adults ready and unafraid to lead. \nStriving on building self-confidence and empowering students with skills, knowledge and enthusiasm to be life-long learners."
  },
  {
    "companyName": "Cedar Gate Services",
    "logo": "https://merojob.com/media/cache/50/a9/50a96bd1243ac67e22f694608fc305c7.jpg",
    "industry": "Software Companies",
    "about": "Cedar Gate Services Pvt. Ltd (Formerly Deerwalk Services Pvt. Ltd)  is a leading software company in Kathmandu, Nepal, providing software development, software testing, data analytics, IT infrastructure and business process support services to its parent company in the United States. For more information,\nvisit: https://cedargate.com/"
  },
  {
    "companyName": "CEDB Hydropower Development Company Limited",
    "logo": "https://merojob.com/media/cache/5d/ab/5dab007986cfb8dff59599af39a3c28d.jpg",
    "industry": "Hydropower / Alternate Energy",
    "about": "CEDB Hydropower Development Company Limited (CHDC), a public limited company incorporated under the prevalent laws of Nepal on Mangsir 15, 2066 (November 30, 2009). CEDB Hydropower Development Company Limited (CHDC) was founded by the then Clean Energy Development Bank to provide equity investment for hydropower projects to meet energy needs of the nation. CHDC is currently mandated to invest in and develop Hydropower Projects. It has got four hydropower projects in operation and three projects at construction and development stages.\n\nProjects Under Development/ Construction\n\nDordi-1 Hydro Electric Project (12 MW) (Lamjung)\nRukum Gad Hydropower Project (5 MW) (Rukum)\nKasuwa Hydropower Project (45 MW) (Sankhwasabha)"
  },
  {
    "companyName": "ChainLink Engineering",
    "logo": "https://merojob.com/media/cache/9d/1c/9d1c82abbc1599c250c30bb287f39877.jpg",
    "industry": "Hydropower / Alternate Energy",
    "about": "Chainlink Engineering is one of the leading civil construction, Hydropower Construction, repair, maintenance and Steel Structure fabrication and errection company of Nepal. It is a long-term company with the goal of sustainable growth through dedicated service. We observe all the professional ethics and norms including the applicable ones of those stipulated by Engineers and other well-known international association. Our organization has been very much specific about its quality services, high professional standards and timely performance Our company is widely popular for its genuine concepts of design, quality work, timely performance and smooth financial conditions. Creativeness and consumer satisfaction is the main theme of our company and is always motivated by good feedback and commitments from the clients. The qualitative outputs of the company are outcome of sound financial management, reliable human resources management policy, modern organizational structure and efficient process planning for every work"
  },
  {
    "companyName": "China Communication Construction Company",
    "logo": "https://merojob.com/media/cache/2f/ee/2fee3092aeb1c4b77aa6e56e04607df1.jpg",
    "industry": "Construction / Real Estate",
    "about": "CHINA COMMUNICATIONS CONSTRUCTION COMPANY LIMITED (“CCCC” or the “Company”), initiated and founded by China Communications Construction Group (“CCCG”), was incorporated on 8 October 2006. The Company (including all of its subsidiaries except where the content otherwise requires) is the ﬁrst large state-owned transportation infrastructure group entering the overseas capital market.\n\nThe Company and its subsidiaries (collectively, the “Group”) are principally engaged in the design and construction of transportation infrastructure, dredging and heavy machinery manufacturing business. It covers the following business aspects: port, terminal, road, bridge, railway, tunnel, civil work design and construction, capital dredging and reclamation dredging, container crane, heavy marine machinery, large steel structure and road machinery manufacturing, and international project contracting, import and export trading services. It is the largest port construction and design company in China, a leading company in road and bridge construction and design, a leading railway construction company, the largest dredging company in China and the second largest dredging company (in terms of dredging capacity) in the world. The Company is also the world’s largest container crane manufacturer.\n\nCCCC, Nepal branch would be responsible for the construction of Mugling-Pokhara Highway Improvement Phase. The  objective  of the  project  is  to  widen  and  upgrade  the  road from  existing  double  lane  to  four  lane  bituminous  paved  standard to cater to increased traffic  load and provide smooth, easy and quick access eliminating existing traffic congestion and reduction in roadway accidents. The whole section of the road is rapidly being developed as urban area and forms the only major gateways to Pokhara, famous tourist center in Western Development Region."
  },
  {
    "companyName": "Clover Education Consultancy",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Consulting / Legal",
    "about": "Since we offer students a wide range of options across the globe and guide them through this process, we have become a one-stop solution provider for all factors related to cost, specialization, and living arrangements. Depending on your academic and financial preferences, we match students with appropriate institutions. We are always committed to providing education and training from the best institutions in the world.  \n\nWe have had a glorious history of placing numbers of students into a wide range of universities with partial and full financial packages ensuring that the institutions and students are a right-match. We have a notable success in recruiting students into the higher institutions in Australia, Canada, USA, and the United Kingdom. \n\nClover Education Consultancy can provide you with career counseling services if you are trying to make a career or academic decision that you are unsure about. The right guidance from unbiased advice and moral support can help you discover yourself.\n\nIn order to assist you in making an informed decision, Clover's career counseling service provides insight into you, your career, and your education. To facilitate the selection of a suitable career and education, your counselors will consider your personal interests, your personality, and your abilities."
  },
  {
    "companyName": "ContentioLab",
    "logo": "https://merojob.com/media/cache/51/c6/51c63e806517c467fde7d09dd60df016.jpg",
    "industry": "Information / Computer / Technology",
    "about": "We are a research-oriented company that specializes in writing services like content writing, ghostwriting, and technical writing. Contentio Lab is the best in the market offering high-quality services by experienced writers, experts, and professionals."
  },
  {
    "companyName": "COPENNED",
    "logo": "https://merojob.com/media/cache/47/81/478101e24ab8adfbadb2e652818f927f.jpg",
    "industry": "Information / Computer / Technology",
    "about": "We are a group of young, enthusiastic, motivated, and innovative people working together. In our quest of providing the best engineering solutions, we are constantly on the lookout for fresh engineers looking forward to an exciting opportunity. If you would like to work with us feel free to reach to our Human Resource and/or Public Relations Department."
  },
  {
    "companyName": "Corofin",
    "logo": "https://merojob.com/media/cache/31/84/3184da258db497f59115b44c10d8ec19.jpg",
    "industry": "Manufacturing / Engineering",
    "about": "Corofin is seeking qualified candidates for following position:"
  },
  {
    "companyName": "Cresurge Nepal Private Limited",
    "logo": "https://merojob.com/media/cache/8d/3a/8d3afffa918c55ac4b35591c943628e8.jpg",
    "industry": "Retail / Shops",
    "about": "Headquartered in Bengaluru, Kadence spreads its joy of entertainment through its 7 experience stores called Kadence Xperience in Bengaluru, Delhi, Goa, Hyderabad and Nepal. Kadence is now a global organisation with expansion in the USA. Our products are also available through our dealer network of 180 strong and growing. We are also available through the e-commerce portals of Amazon and Flipkart. With a large portfolio of clients and partners, we aim to reach all corners of the Indian Subcontinent and also expand globally."
  },
  {
    "companyName": "CrossOver Nepal",
    "logo": "https://merojob.com/media/cache/88/4b/884b8f79e3deff893019f5a1318d7572.jpg",
    "industry": "Software Companies",
    "about": "We are leading software provider for Hotel Management and  Restaurant Management(Restaurant POS) System. We also provide software for Retail billing(Retail POS), Account and Inventory management and courier tracking and management system for Nepal and international markets. \n\nAlong with that we have development team as offshore development center for our outsourcing clients.\n\nWe design and develop intuitive web,mobile and SEO friendly applications to help companies take advantage of the power in social and business collaboration, mobile applications and next-generation tools for the enterprise businesses.\n\nWe are software development company creating cost-effective custom solutions based on technical expertise to deliver the ultimate in customer satisfaction while also helping each business or company achieve their unique needs.\n\nWe are committed to excellence in our services and work towards delivering high quality IT services to our customers."
  },
  {
    "companyName": "Daraz",
    "logo": "https://merojob.com/media/cache/ea/e8/eae85182b1b44978e931f9f2943f2986.jpg",
    "industry": "E-Commerce/ E-Business",
    "about": "Daraz is South Asia's leading online shopping and selling platform present in Pakistan, Bangladesh, Sri Lanka, Myanmar and Nepal. We currently operate an ecosystem of 50,000 sellers serving 10 million consumers with more than 20 million listed products.\n\nIn May 2018 Daraz was acquired by Alibaba Group, and we are proud to carry our part of the mission to 'make it easy to do business anywhere'. As part of the Alibaba ecosystem, we are leveraging Alibaba’s global leadership and experience in technology, online commerce, mobile payment and logistics to drive growth in our markets. Together with Alibaba, we are ready to empower entrepreneurs in the region and to fulfill our promise to offer our customers the best selection of products with a high level of convenience.\n\nWe currently have approximately 3,000 employees in across countries and business units."
  },
  {
    "companyName": "DHM International",
    "logo": "https://merojob.com/media/cache/a8/63/a863e1e09646cc17c9d240982fb56780.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "DHM International Private Limited is a Business Process Outsourcing (BPO) and Knowledge Business Process Outsourcing (KBPO) Organization specialized in the international trade of all types of Textiles and Steel. \n\nWe take pride in impeccable execution of each and every business process right from facilitation of business development to the after sales services communications on behalf of our prestigious Principals based in China, Hongkong, Vietnam and many other countries.\n\nOver the years we have acquired knowledge and developed processes for all facets of international trade such as data entries of international trade contracts, handling all types of communications for execution of the international trade contracts including follow up for adherence to payment terms, logistics & documentation terms, technical parameters and inspections, processing of accounting entries, financial statements and MIS, human resource acquisition and development processes etc. on behalf of our international clients as per their instructions and requirement. \n\nFor handling business processes of our newly acquired international clients we are looking for young & ambitious, qualified and experienced candidates to join our team of International business specialists. \n\nBright and qualified professionals with master or bachelor  degree in international trade, master of business administration, master of marketing & sales and textiles technology graduates may also be considered for joining our team as Trainees."
  },
  {
    "companyName": "Doosan Enerbility Co. Ltd.",
    "logo": "https://merojob.com/media/cache/fb/7b/fb7b91b2c0c8f11b9eaae2df8d7ceee9.jpg",
    "industry": "Hydropower / Alternate Energy",
    "about": "Doosan Enerbility Co., Ltd (Formerly known as Doosan Heavy Industries & Construction Co., Ltd) is a leading EPC contractor offering a wide range of services ranging from the manufacturing of castings and forgings, power generation systems, and desalination facilities to the construction of power plants. It was founded in 1962, headquarters in Changwon South Korea. Here in Nepal, we are registered as Doosan Enerbility Co., Ltd. Nepal Branch. Doosan Enerbility Co., Ltd is the EPC Contractor for Upper Trishuli 1 (216 MW) Hydropower Project. ​​​​​​​"
  },
  {
    "companyName": "Dzango Technologies Limited",
    "logo": "https://merojob.com/media/cache/35/7d/357ddd0b31d7662827e33973e002b0a5.png",
    "industry": "Information / Computer / Technology",
    "about": "We are a boutique software engineering who specialize in building dedicated dev teams for startups."
  },
  {
    "companyName": "Dzine Folio",
    "logo": "https://merojob.com/media/cache/4d/a0/4da03bd094f36791f9ad74ce2faa7e93.png",
    "industry": "Designing / Printing / Publishing",
    "about": "Dzine Folio is an established and trusted company with corporate package of graphic designing, printing, website development solutions and as well as branding. We’ve provided highly tailored graphic design and web development solutions to satisfied clients across the country.\n\nCreativity is the vital part of our company which leads to success. The value Dzine Folio holds a company means that we believe we have a particular responsibility to promote diversity in all aspects of our work. We also believe in giving best design to each of our clients, building a solid & lasting relationship based on trust and satisfaction.\n\nVision:\n“Give you the best quality designs to build meaningful brands”\n\nMission:\nProvide an excellent quality graphic design service at the best price working diligently in order to improve sales and promotions, through graphic design for print, web & interactive media and as well as for branding.\n\nWho we are:\nWe are an agile Nepalese designing team with a unique multidisciplinary approach, incorporating strategic graphic design, printing, website development and branding."
  },
  {
    "companyName": "EBPearls",
    "logo": "https://merojob.com/media/cache/78/12/7812ee5c7575e9c67d851e001001846c.png",
    "industry": "Information / Computer / Technology",
    "about": "EB Pearls was established in 2005 and is a full service digital solution agency. EB Pearls has offices in Sydney (Australia) and Lalitpur (Nepal), and it houses around 100 staffs across all offices. We, at EB Pearls, hold expertise in website, eCommerce, and mobile applications development.\n\n\nOur values pronounce solving digital solutions regardless of complexity and quality of services and product to the highest standard.  In such, the pivot to our success is the pool of competent people who own EB Pearl’s values and exhibit strong competence on quality of services, robust business system/process, top-notch technical capabilities, and utmost client’s satisfaction. As EB Pearls is at primary growth stage, we emphasis on cost-effectiveness while taking ambitious goals to grow our business. This stimulates us toward the establishment of strategic and holistic People Operations function at EB Pearls."
  },
  {
    "companyName": "Edwise Foundation",
    "logo": "https://merojob.com/media/cache/c6/2d/c62d460855e54505fbd46f24263dfc18.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Edwise Foundation have been providing one of the nation’s best test preparation classes for IELTS, TOEFL and SAT. Our highly experienced instructors have always been able to keep our words of helping students in best possible ways to make sure our students get highest possible scores on those tests.\n\nWe provide best resources to our students to make sure their preparations go smooth. Our library is well equipped with all the books our students need, including all past as well as latest editions.\n\nWe specialize in advising students to study in the United States , Canada, UK and Australia. We have been internationally certified by AIRC and ICEF. Please visit us at  http://edwisefoundation.com for more information."
  },
  {
    "companyName": "Elite Grand School",
    "logo": "https://merojob.com/media/cache/4a/92/4a927b50cfca91fcaa32b0aea99a4b09.jpg",
    "industry": "Education - School & Colleges",
    "about": "Elite Grand School is a co educational school established in 2015 AD and situated at Chuchhepati, Mahankal, KMC - 06, Bagmati, Nepal. The school school is running from grade I to X."
  },
  {
    "companyName": "E-Signature Pvt. Ltd.",
    "logo": "https://merojob.com/media/cache/24/a4/24a4e1ceb8e3342a6678a2a4c818374f.jpg",
    "industry": "Information / Computer / Technology",
    "about": "We are full stack mobile/ web apps development company with over with 12 years of Industry Experience"
  },
  {
    "companyName": "Eunoia Media",
    "logo": "https://merojob.com/media/cache/d3/c5/d3c53bc5736148e0994f2a726be25ec9.jpg",
    "industry": "Media / Publication (Newspaper, Magazines)",
    "about": "We are a media company creating content for global audience."
  },
  {
    "companyName": "Euro School Koteshwor",
    "logo": "https://merojob.com/media/cache/8d/37/8d375451f93cb8f22fe059471954cc30.jpg",
    "industry": "Education - School & Colleges",
    "about": "Euro School, Koteshwor is one of the sister branches of Euro School, Hattigauda. It was established in 2018 and was previously located at Tinkune. We adhere to the  quality education and cater to the modern needs of students and parents."
  },
  {
    "companyName": "Executive Search- merojob",
    "logo": "https://merojob.com/media/cache/8d/67/8d678f2446654fbb2044fcac3013483c.jpg",
    "industry": "Manpower Recruitment",
    "about": "Executive Search Service of merojob specializes in recruiting best fit candidate (Usually Senior/Top level Position) for the client organization in various industries. We are also involved throughout more of the hiring process, conducting detailed interviews and presenting candidates to the client organizations selectively. Our process, involves analyzing the need of roles, screening and approaching right candidate, conduct preliminary interviews, facilitating the overall process from interview to selection.\n\nPlease be assured that your information are strictly kept confidential with merojob (Executive Search) and any details of your application shall only be shared to client only after proper consent.\n\nOn behalf of one of our client we are currently recruiting for the below mentioned position for our client industry."
  },
  {
    "companyName": "FHI 360 Nepal",
    "logo": "https://merojob.com/media/cache/c1/2f/c12faf5169ca51c63fb3189498880b83.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "FHI 360 is a nonprofit human development organization dedicated to improving lives in lasting ways by advancing integrated, locally driven solutions. Our staff includes experts in Health, Education, Nutrition, Environment, Economic Development, Civil Society, Gender, Youth, Research and Technology– creating a unique mix of capabilities to address today’s interrelated development challenges. FHI 360 serves more than 60 countries, all 50 U.S. states and all U.S. territories."
  },
  {
    "companyName": "Flow Tech Pvt. Ltd.",
    "logo": "https://merojob.com/media/cache/53/43/5343a31a0d3a17a21b30905fd4040deb.jpg",
    "industry": "Engineering Firms",
    "about": "An Automation and energy technology company"
  },
  {
    "companyName": "Foodmandu",
    "logo": "https://merojob.com/media/cache/b6/58/b6585f3f31be119355df57e1ef3bef47.jpg",
    "industry": "E-Commerce/ E-Business",
    "about": "Foodmandu is an e-commerce company providing on-demand food delivery service inside Kathmandu, Lalitpur, and Bhaktapur and Pokhara as well. We are the first company in Nepal with innovative concept of connecting foodies with the most popular restaurants in the city and delivering customer's orders at their door-step.\n\nCustomer can order food via our website www.foodmandu.com or our mobile app available on Android and IOS platforms. Having started its operation in 2010, Foodmandu has now grown to 250 plus team members serving 300000+ customers from the widest range of 800 plus partner restaurants.\n\nWe are looking for some energetic individuals with good interpersonal and communication skills for our customer service team. Be a part of the rapidly growing online service company. There are vacancies for following position at the moment."
  },
  {
    "companyName": "Future Hub Education",
    "logo": "https://merojob.com/media/cache/53/98/539839a70ba262959e6d89de933b3e7f.jpg",
    "industry": "Education - School & Colleges",
    "about": "A newly government license approved company located in Nepal, primarily in service for different hotels all over the world. We are educational consultancy based on providing Hospitality trainees (interns) from best of the best institute from Nepal. We collaborate with the different colleges in Nepal and select a quality candidates for our client."
  },
  {
    "companyName": "GCG INTERNATIONAL",
    "logo": "https://merojob.com/media/cache/61/1b/611bc79eaadfeb90e98f31aa8d583874.jpg",
    "industry": "Distribution Companies / Wholesale",
    "about": "GCG INTERNATIONAL\" an American based company that brings premium, classic, protective, exclusive, fashionable glasses in USA and different countries including Nepal of the world."
  },
  {
    "companyName": "General Medical Suppliers",
    "logo": "https://merojob.com/media/cache/6a/3b/6a3b33b265dbdd368f0bcadffa3fe732.jpg",
    "industry": "Distribution Companies / Wholesale",
    "about": "One of the well–established Trading Concern dealing Medical Equipments in Nepal is seeking application from eligible candidates for the following post:"
  },
  {
    "companyName": "Getmandu International",
    "logo": "https://merojob.com/media/cache/73/85/7385a79795dc554c01e2c893082b633b.jpg",
    "industry": "E-Commerce/ E-Business",
    "about": "As the e-commerce company to become a part of the mainstream in Nepal, Getmandu has come a long way. It has built a platform for buyers and sellers from across the country to connect online by making products accessible to more people."
  },
  {
    "companyName": "Ghargharma Doctor",
    "logo": "https://merojob.com/media/cache/36/96/36969ee7e45d813409d76cd9b84a29a4.jpg",
    "industry": "E-Commerce/ E-Business",
    "about": "Ghargharma Doctor Private Limited is a business organization for preventive health care business in Nepal. Our major areas of focus are prevention, treatment, and insurance service to our members through E-Commerce."
  },
  {
    "companyName": "Gurkha Welfare Trust",
    "logo": "https://merojob.com/media/cache/65/c4/65c41c0b0d1ebc28cf9781845251633c.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "The Gurkha Welfare Trust Nepal-GWT(N) is the field arm of Gurkha Welfare Trust UK, a registered charitable Trust working particularly for the ex-Gurkha Veterans and their communities across Nepal. It is a charitable institution, established and registered in the UK in 1969. GWT(N) ensures that Gurkha veterans, their widows and their wider communities are able to live their lives with dignity. We achieve this primarily through the provision of financial, medical and community aid."
  },
  {
    "companyName": "Hansikar Technologies",
    "logo": "https://merojob.com/media/cache/8a/33/8a33b5b96674cca8c98679d7a4e92593.png",
    "industry": "Information / Computer / Technology",
    "about": "Hansikar is a leading digital marketing agency established in 2018 and has served over 50 clients. We are primarily focused on designing result-driven online marketing strategies (including SMM, SEO, Ecommerce SEO, local SEO, PPC, Content Marketing, Video Marketing) for ensuring accelerated growth in client’s business and improved conversion rates. \n\nOur passionate and professional team is comprised of highly data-driven individual and creative thinkers who take both quantitative and qualitative approaches to achieve desired success.\n\n\nLearn more about us in this link."
  },
  {
    "companyName": "Happy Monk Kitchen & Bar",
    "logo": "https://merojob.com/media/cache/2a/6c/2a6c1c06b58375ca2037faebc622aed5.jpg",
    "industry": "Hotels / Resorts / Restaurant",
    "about": "HAPPY MONK BAR AND KITCHEN  is a group of restaurants, bars, and farms at four locations.\n\nOn behalf of one of HAPPY MONK BAR AND KITCHEN, we are currently recruiting for the below-mentioned position."
  },
  {
    "companyName": "Helen Keller International",
    "logo": "https://merojob.com/media/cache/a7/2b/a72ba0b13d0bff0afc8758305672a002.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Helen Keller International (HKI) /Nepal, an International non-profit organization (INGO) works to improve the sight and lives of the vulnerable by combatting the causes and consequences of blindness, poor health and malnutrition through public health approaches, building the capacity of organizations, and contributing to policy changes through systems strengthening and operations research. HKI/Nepal’s nutrition is the largest portfolio. The Assessments and Research on Child Feeding (ARCH) Project, improving nutrition and child survival has been at the core of HKI’s mission for more than 40 years. Applications are invited from interested, committed, dynamic team players and experienced Nepali nationals for the following position:"
  },
  {
    "companyName": "Himalayan Engineering Associates",
    "logo": "https://merojob.com/media/cache/c6/62/c6629074c5bdbc22408b2dd53045544f.jpg",
    "industry": "Engineering Firms",
    "about": "Himalayan Engineering Associates Pvt. Ltd. (HEAPL) was established in 1993 with a mission of providing quality services and customer satisfaction in all kinds of construction works, engineering design, supply and application of construction materials and chemicals. HEAPL is a “Class A” contractor and a pioneer in structural repair, rehabilitation and waterproofing along with various other structural treatment works in Nepal, with a good reputation of over 28+ years."
  },
  {
    "companyName": "Himalayan Java Coffee",
    "logo": "https://merojob.com/media/cache/8e/d5/8ed54634468e78da5adab99ac3e51c5b.jpg",
    "industry": "Hotels / Resorts / Restaurant",
    "about": "Himalayan Java is the first Specialty Coffee shop in Nepal that specializes in hand crafted coffee and bakery since 1999. In its glorious years of establishment, Himalayan Java has diversified from a small individual coffee shop to an international franchising Nepalese Coffee Brand with more than 35 outlets around the world.\n\nHimalayan Java offers 100% Single Origin Nepalese Organic Coffee along with its delicious selection of breakfast, pastries, Pizzas, Sandwiches and Organic Salads. Himalayan Java believes in serving socially responsible coffee with an aim of maintaining a sustainable business ecosystem by supporting local farmers and Nepali Product, while practicing environmentally friendly coffee production methods in its company owned coffee farm located at Fikkal, Illam."
  },
  {
    "companyName": "HoneyGuide Pvt.Ltd",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Travel Agents / Tour Operators",
    "about": "HoneyGuide is a travel company specialising in the Everest Region that sells trek packages and individual services like flight tickets, lodges and guide booking."
  },
  {
    "companyName": "Horse Shoe Incorporated Private Limited",
    "logo": "https://merojob.com/media/cache/c9/4d/c94d6bf8218bf0ea94bfce6ab7082423.jpg",
    "industry": "Hotels / Resorts / Restaurant",
    "about": "Horse Shoe Incorporated Pvt. Ltd. is newly incorporated company that plans to operates in food and beverages industry. We will be operating a full service restaurants (dine in) as well as cloud kitchen at various locations."
  },
  {
    "companyName": "Hospitality World Campus Pvt. Ltd.",
    "logo": "https://merojob.com/media/cache/aa/85/aa8518de5ef87cbd5cc38294e75a7875.jpg",
    "industry": "Education - School & Colleges",
    "about": "We offer internationally certified courses with credit tranfer to Australia, Ireland, UK, USA and many other countries\n\nDiploma in Global Culinary Arts (12 months)\nAdvanced Diploma in Hospitality Management (21 months)"
  },
  {
    "companyName": "Hostingbsp",
    "logo": "https://merojob.com/media/cache/d7/6f/d76ff2eb9f3b8183e228b2708e7b8886.jpg",
    "industry": "Other",
    "about": "We are tourism start up company who is working in tourism sector in Nepal."
  },
  {
    "companyName": "Huaxin Cement Narayani",
    "logo": "https://merojob.com/media/cache/d5/41/d54188aa2ac2ffca98e4af6f8daa90f7.jpg",
    "industry": "Manufacturing / Engineering",
    "about": "Huaxin Cement Co., Ltd. was founded in 1907, known as the cradle of China's cement industry, 110 years ago, for the national and local economic construction has made outstanding contributions.\n\nHuaxin Cement is the first enterprise in China cement industry to pass the GB / T19001-ISO9001 quality system certification. Its credit rating is \"AAA\" and Huaxin Fort is a well-known trademark in China. Huaxin Cement was chosen as the key national projects of the top ten buildings in Beijing in the 1950s, Beijing Asian Games Village, Gezhouba, the Beijing-Zhuhai Expressway, dozens of highways and railroad bridges in the middle and lower reaches of the Yangtze River, and the Three Gorges Project that attracted worldwide attention.\n\nIn recent years, Huaxin Cement has actively changed its mode of development by taking the lead in the cement industry to promote the R & D and application of substitutable raw and fuel fuels, forming an internationally advanced cement kiln co-disposal waste technology and environmental protection solution, Enterprises to the green transformation of enterprises. From a purely engaged in cement production enterprises to develop into a set of cement, concrete, aggregate, environmental disposal, equipment manufacturing and EPC projects, high-tech building materials business of global building materials group in more than 10 provinces and cities nationwide and overseas have 150 Yu Jia molecular company, ranked the top 500 Chinese manufacturing and wealth Fortune 500, ranking the forefront of the domestic industry.\n\nHuaxin Cement Narayani Pvt. Ltd., a Nepali-Chinese joint venture, will be outlaying the amount of $140 million in cement plant in Dhading district as a foreign direct investment (FDI). The company has acquired a limestone mine, the key raw material needed to manufacture cement, at Panikharkha in Dhading. The factory will produce 3,000 tonnes of cement daily and create 1,000 jobs.\n\nCurrently, we are seeking to hire Nepalese Citizen who are result oriented, energetic and talented professionals to join our team who have following qualifications:"
  },
  {
    "companyName": "Hulas Steel Industries Limited",
    "logo": "https://merojob.com/media/cache/7a/cb/7acb05959380fb646db6a1f325c01ecb.jpg",
    "industry": "Manufacturing / Engineering",
    "about": "Hulas Steel Industries Limited Established in 1981 as a joint venture between Golchha Organization, Nepal, and Comcraft LTD, Singapore. Our brand ‘ HULAS’ with the Rhododendron symbol has become synonymous with quality in roofing sheets, aluminum, poles, and structure. “HIPCO” Brand has become the leading brand in Galvanized and Black MS Tubes. Hulas Steel believes in creating sustainable growth by keeping in mind the environmental consequences and minimizing wastes. It also believes in achieving its business objectives ethically, transparently, and with accountability to its stakeholders across the value chain. Hulas is committed to promoting integrated responsible behavior and value for social and environmental well-being."
  },
  {
    "companyName": "Incessant Rain Private Limited",
    "logo": "https://merojob.com/media/cache/d4/e9/d4e9d0d2c701aa5cfc2b0c3f8dca7428.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Incessant Rain Pvt. Ltd. is a one-stop creative solution for quality digital animation and flawless visual effects along with a diverse team of artistic minds and technical talents.\n\n\nWe work hand in hand to create ideas that go beyond this world. We combine our passion and excitement with our client’s needs into a collaborative and creative approach that meets every project’s budget and time constraints.\n\nThrough our collective efforts, we envision to entertain and fascinate the world with a unique range of unforgettable stories and exciting characters, giving life to dreams and wings to the imagination."
  },
  {
    "companyName": "InnoCSR Nepal (Good Bricks System)",
    "logo": "https://merojob.com/media/cache/e7/be/e7bebbd3ad922f6966fbb6cc82319f2b.jpg",
    "industry": "Multinational Companies",
    "about": "InnoCSR is a Korean company established in 2008; we currently provide responsible and sustainable impact technology solutions to public/private sectors in different countries such as Korea, Malaysia, Myanmar, the Philippines, China, and Nepal. With the aim of promoting green technology in Nepal, InnoCSR has established InnoCSR Nepal Office in Kathmandu, Nepal. It has introduced the use of Soil Stabilizer in the brick industry producing non fired bricks, a.k.a. Good Bricks System."
  },
  {
    "companyName": "Innovative Business Pvt. Ltd",
    "logo": "https://merojob.com/media/cache/45/f9/45f9789df2ff45be659781524b70e982.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "Trade Company\n\nDeals with export and import of different category products.\nSells in the market with the e-Commerce platform."
  },
  {
    "companyName": "International Hotel Training School",
    "logo": "https://merojob.com/media/cache/b7/be/b7be891d68faa958ab11ebd7fcb3f1e3.jpg",
    "industry": "Training Institutes",
    "about": "International Hotel Training School is the first hotel training school in Nepal under the leadership of existing dynamic Food & Beverage Director, Executive Chef of 5 star deluxe hotel of Nepal."
  },
  {
    "companyName": "IT Training Nepal",
    "logo": "https://merojob.com/media/cache/b8/70/b870d58f438ef343153d9b9d16beff90.jpg",
    "industry": "Training Institutes",
    "about": "IT Training Nepal is one of the best computer training institute of Nepal located at core of the Capital city, Kathmandu. Here, we enable students to solve real time problem with ineractive learning methodologies. Project work, internships, job assistance are some of the key facilities to secure a professional spot in the blooming Information and Communication technology industry. Students are engineered in the field of software development; the learning is done in an integrated approach like class interaction, individual assessment, face to face sessions, multimedia through which students can expand their knowledge in Computer science and Information technology Management systems. We are a truly professional training institute. Fast track courses provided by us will also help students get training in ashort period of time."
  },
  {
    "companyName": "JAKSON ENTERPRISES NEPAL PVT. LTD",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Automotive Sales, Support & Service",
    "about": "A Leader & Most reputed Company in Diesel Genset & Solar Business in Nepal.\n\n\n\n\nhttps://www.jakson.com/\n\n\nContact no. : 9802025127"
  },
  {
    "companyName": "Jhigu Bazar",
    "logo": "https://merojob.com/media/cache/c3/2c/c32c127a315c2d530152368102af6e62.png",
    "industry": "Software Companies",
    "about": "Find the things you need around, FASTER!\n\nWe are a small passionate startup looking for qualified professionals."
  },
  {
    "companyName": "JobsGlobal.Com Employment Service",
    "logo": "https://merojob.com/media/cache/97/af/97afcb0de94fcbdc5f4932ff82b66129.jpg",
    "industry": "Manpower Recruitment",
    "about": "As one of the largest Global Recruitment Services & Consultancies companies, JobsGlobal.Com is proud to provide to full online solutions for all human resources related issues start from online advanced global CV search system with online access to huge database to online recruitment and larbor news as well as HR media and job communities.\n\nFor more informations please visit our website http://www.jobsglobal.com/"
  },
  {
    "companyName": "K&A Engineering Consulting P.C",
    "logo": "https://merojob.com/media/cache/58/2c/582c0a9cbb9d066ef832baa348929bf2.jpg",
    "industry": "Energy - Utilities - Gas - Electric",
    "about": "K&A Engineering Consulting – White Plains, NY is a people-first organization. We value knowledge and learning. We believe in the power of connection, and collaboration, and we seek to build relationships that mean something. We employ some of the best and brightest in our industry and we work hard to maintain a culture that our people can be proud of. Our company has earned its reputation through challenging work, uncompromising precision and continuous learning and adapting. We strongly believe in building long lasting relationships with our clients and our employees. We love what we do, and our goal is to have the happiest clients and employees in the industry. We deliver a reliable and innovative range of services for dozens of projects around the country. The company’s team members are passionate about engineering, infrastructure, and design, and understand our clients’ business needs and objectives."
  },
  {
    "companyName": "Kanjirowa National School",
    "logo": "https://merojob.com/media/cache/62/f3/62f32f3d3120e21f4b252f84077aeea5.jpg",
    "industry": "Education - School & Colleges",
    "about": "Kanjirowa National Secondary School (KNSS) previously known as Kathmandu Don Bosco School is an independent co-educational institution providing education in a resourceful, friendly and caring environment which was established in 1998. It runs classes from grade 1 to grade 12 by a team of professionals with wide national and international exposures in education.\n\n\nKanjirowa National  Secondary School is looking for the following candidate for immediate appointment."
  },
  {
    "companyName": "Kantipur English High School",
    "logo": "https://merojob.com/media/cache/eb/54/eb5433f5e117d4336a67615235dcc510.jpg",
    "industry": "Education - School & Colleges",
    "about": "Kantipur English High School, an English-medium school, prides itself with its long and rich tradition of Academic Excellence.\n\nIt aims to build up children for the challenges ahead with programs that are both relevant and progressive, as a result, preparing children for life and not just for earning a living."
  },
  {
    "companyName": "Kavya School",
    "logo": "https://merojob.com/media/cache/6f/7c/6f7cb72f9c2715cc3f83ef2b8894e770.jpg",
    "industry": "Education - School & Colleges",
    "about": "Kavya is a coeducational day and boarding school for grades I to X. We welcome and enroll students of all faiths, races, and backgrounds, and offer various need-based scholarships each year. We have a small class size which enables staff to build strong relationship with the children, know their families well and work teachers and parents together as a team for the benefit of the children in our care. Each child is fully supported at each stage of learning.\n\nWe are guided by \"Parents in school\" and \"Teachers at Home\" principle where staff, teachers, students and parents work together in a safe, caring and tolerant community to provide holistic environment with respect and dignity. This enables the students to achieve emotional, social, physical, moral and spiritual development. In this partnership, Kavya focuses on integrity in technology, skills and value to teamwork in diversified community incorporating local brains with global ideas. All members of the school community will model the behaviors expected from the students. In doing this, the school will be a centre of excellence at the forefront of education, community development and environment awareness."
  },
  {
    "companyName": "Khalti Digital Wallet",
    "logo": "https://merojob.com/media/cache/32/27/3227642d60ceadc3a94c418c71ea9609.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Khalti is a mobile wallet, payment gateway & service provider in Nepal. Launched in January 2017, Khalti is one of the leading online payment solution in Nepal. It allows users to pay for a range of services like basic utility payments, hotel bookings, movie and domestic flight tickets, events and many more. It is operated and owned by Sparrow Pay Pvt. Ltd. \n\nWe offer payment solution to over hundreds of merchants across Nepal and provide seamless payments using ebanking, smart banking, cards, and wallet. Being not just limited to mobile app users, Khalti has more than 8000 POS and Agent Network providing Khalti services to end users.\n\nKhalti is home to some of the brightest minds in the country, which includes a team of highly skilled developers and interactive marketers. Our solution-oriented approach makes us reliable for any and all kind of service you might require from Khalti with the best user experience possible.\n\nOur goal is to simplify lives of people by bringing financial inclusivity to every individual in Nepal and take the payment industry from offline to online through best practices."
  },
  {
    "companyName": "KPO and Company",
    "logo": "https://merojob.com/media/cache/41/d5/41d569f86eef14cc06bebaf17a7c8018.jpg",
    "industry": "Information / Computer / Technology",
    "about": "KPO & Company is a Digital Web Media agency based in Australia and collaboration with the different organization from USA, Canada and Europe.\n\nOur team of specialists consistently delivers outstanding results combining creative ideas with our vast experience. We can help you build a sustainable, meaningful relationship with your clients by engaging them with your brand using social media.\n\nWe work in areas as diverse as search engine optimization, social media marketing, email marketing and digital marketing."
  },
  {
    "companyName": "KTK-BELT Project",
    "logo": "https://merojob.com/media/cache/37/4f/374f308bdef1b7b6a43613c7dd621f67.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "KTK-BELT project (www.belt-project.org) was formally launched in 2015 as a collaborative platform for farmers, teachers, and youth in eastern Nepal to carry out community-based biodiversity conservation. KTK-BELT is a 501(c)(3) non-profit organization registered in New York and in Nepal. It operates from an assumption that local farmers possess deeply embedded place-based knowledge of their environments and, therefore, are in the best position to steward local biodiversity and habitats. To implement, we work through Nepali partners called ‘Learning Grounds,’ which are non-profit cooperative associations, led by women and minority groups. For more information, please visit www.belt-project.org."
  },
  {
    "companyName": "Label STEP",
    "logo": "https://merojob.com/media/cache/60/6d/606d72bb8298485656b8120e9e0490a1.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Label STEP Nepal, which was founded in 1997, monitors and validates fair trade standards across the complete line of handmade carpets produced by STEP Fair Trade Partners (licensees/importers). Good working and living conditions, fair salaries, collective bargaining, environmentally responsible production, and the prohibition of child labor are among the 10 STEP Standards. Wherever non-compliance is detected, these compliance criteria are systematically audited, and corrective steps are taken. Label STEP Nepal also conduct the 'Weavers Community Empowerment Program,' which aims to build the capability of weavers via education and training, including financial literacy."
  },
  {
    "companyName": "LeadX Nepal",
    "logo": "https://merojob.com/media/cache/76/9b/769b0d3ec1d8599cb768343b53a1a2a1.jpg",
    "industry": "Training Institutes",
    "about": "LeadX Nepal is a leadership development company. It works with existing and emerging leaders for their holistic, integrated and authentic leadership journeys. Leadx Nepal provides Graduate Research Grants and support internship and returnship for continue 'Knowledge Creation and Transfer'. Furthermore, the company encourages and promote impact investment to support socially conscious business in Nepal."
  },
  {
    "companyName": "Logpoint Nepal",
    "logo": "https://merojob.com/media/cache/d3/7f/d37f446bffed85e74573ef1cef1272d7.jpg",
    "industry": "Software Companies",
    "about": "LogPoint is committed to creating the best SIEM in the world. We protect organizations by transforming their data into actionable intelligence, managing the cybersecurity threat in real-time. Our Modern SIEM with UEBA provides advanced behavioral analytics and ML-driven automation capabilities. Collecting data from across the IT infrastructure, the LogPoint solution supports cybersecurity, compliance, IT operations, and business analytics. In offices throughout Europe, North America, and Asia, more than 250 passionate LogPointers are working together with 60+ certified partners, committed to creating business value for our customers around the globe. And don’t just take our word for it, 1000+ customers agree. LogPoint receives stellar reviews from cybersecurity professionals and is recognized by leading industry analysts. For more information, visit www.logpoint.com.\n\n \n\nLogPoint is growing rapidly, we offer a challenging and exciting international work environment on the cutting edge of cybersecurity technology. We strive to deliver outstanding results in a positive, collaborative, and informal atmosphere with ample opportunity for personal growth and development."
  },
  {
    "companyName": "Lomus Pharma",
    "logo": "https://merojob.com/media/cache/1d/c3/1dc33253f7d08a5a75488fb9f9df751e.jpg",
    "industry": "Pharmaceuticals / Healthcare",
    "about": "Lomus is in its 4th decade of serving pharma market and gearing up to global expanding market with its dedicated vision to develop of innovative drug to target huge diversified medical need. Lomus was the name of rishi, expert on many therapies during the Dwapar yug of Rama regime. Lomus, a private limited company begins its journey as a small scale pharmaceuticals manufacturing unit in 1985 A.D. With rapid expansion with its product ranges during 90s with the professional and management team, Lomus on the top position in the national market since 2002. Lomus , WHO GMP and ISO 9001:2008 and ISO 1400:2004 certified company, manufacture a wide range of products to achieve customer satisfaction through our endeavor to manufacture highly effective and safe pharmaceutical products at highly competitive prices. Lomus enjoy an inevitable reputation among the medical fraternity for its high standard of ethics and quality in national markets and internationals market."
  },
  {
    "companyName": "Lubdhak Research Foundation",
    "logo": "https://merojob.com/media/cache/6a/03/6a039c1564a99b3f2a79544972a3ff68.png",
    "industry": "Other",
    "about": "Lubdhak Research Foundation is an organization based in India. LRF provides intervention using Applied Behavior Analysis to those with the Autism Spectrum Disorder."
  },
  {
    "companyName": "Lucky Thanka",
    "logo": "https://merojob.com/media/cache/30/e4/30e411caa31be47d857f86f76ea6f171.jpg",
    "industry": "Handicraft",
    "about": "The Company deals in all aspects of the Nepalese Crafts including Handicrafts, antiques, handmade paper, pashmina shawl, thangka painting, Gems and Jewellery (Mala and Beads) precious and semi-precious stones, singing bowl, handmade bags.The Company sources and sells products through the Internet and also holds exhibitions. We procure handicraft products directly from the master craftsmen."
  },
  {
    "companyName": "Madi Power",
    "logo": "https://merojob.com/media/cache/db/90/db90584184012d5b58dcabe403b8893d.jpg",
    "industry": "Hydropower / Alternate Energy",
    "about": "Madi Power Private Limited is a joint venture with China International Water & Electric Corp. (CWE), a state-owned enterprise of China. Madi Power Private Limited is the developer of 25 MW Upper Madi Hydroelectric Project located at Kaski District."
  },
  {
    "companyName": "Manaslu Enterprises",
    "logo": "https://merojob.com/media/cache/d4/0c/d40cba44665ef44c1a59ebb029920eb8.jpg",
    "industry": "Advertising Agency",
    "about": "Manaslu Enterprises has produced results for clients in a variety of Schools, Colleges, Banks, Finances, Co-operatives, Manpower's, NGOs, INGOs, Consultancies, Hospitals, Institutes, Government offices etc. We specializes in communicating your message to your consumer in an innovative, memorable way that sets your company, your product or service apart from the competition. We work with a wide variety of products and services in a broad spectrum of categories.\n\nWe are pioneer in performing various services to our clients.\n\nDesigning ID Cards, Business Cards, Books and Ex- Books, Annual Book, monthly newsletter, annual calendar and rest.\n\nNews paper advertisement in and out of valley.\n\nWe even design Memos, Bills, Vouchers and Additional.\n\nWe design prospectus, brochure, leaflet, banners, posters and many other promotional materials.\n\nWe do 3D animation, design company’s logo and websites of all categories.\n\nBillboards in and out of valley.\n\nProduct launch and promotion.\n\nEvents-Concerts/Exhibitions/Product Launches/Press Meet/PressRelease/Road Shows/Seminars\n\nAudio/Video Production ( Radio Jingles and Television commercials )\n\nCorporate activities and hospitality.\n\nMedia purchasing and releasing\n\nQuality print production"
  },
  {
    "companyName": "M AND R SOLUTION",
    "logo": "https://merojob.com/media/cache/9a/42/9a4299b73a0bfcd8c4ab46ddc2d433bd.jpg",
    "industry": "Information / Computer / Technology",
    "about": "M&R Solution is group of company, established with professionals & dedicated team for every project & having more than 8 Year working experience in the local Market & international market demand. This team provide many project according to requirement of Market. Product will be customized according to user requirement & successfully develop the Finance & Inventory Management System according to the marketing requirement. We are a technology & innovation company of Nepal Located at Putalisadak, Kathmandu. Delivering Financial & business Solution software for Small and Medium Businesses."
  },
  {
    "companyName": "Matribhumi School",
    "logo": "https://merojob.com/media/cache/c8/c2/c8c24c07c57196af97d5596d6a1f327a.jpg",
    "industry": "Education - School & Colleges",
    "about": "Established in 1994, Matribhumi School is a co-educational Day Boarding School. Matribhumi’s day boarding educational approach (8:30 am to 5:00 pm) benefits working parents as the educating team helps the students spend time in a safe, caring atmosphere; complete assignments under the supervision of professional educators; and allows parents to spend quality family time with their children. For further details, please visit our website: https://matribhumischool.edu.np/home/"
  },
  {
    "companyName": "MAW Music Pvt. Ltd",
    "logo": "https://merojob.com/media/cache/3b/fb/3bfb24466464ef1b3a141e6b8930561c.jpg",
    "industry": "Retail / Shops",
    "about": "MAW Music is Nepal's leading sound solution provider- whether its musical instruments, recording gear, sound systems for all spaces- we have you covered. We are the authorised distributor for multiple brands in the segment."
  },
  {
    "companyName": "Megha Multipurpose Training Institute",
    "logo": "https://merojob.com/media/cache/3f/39/3f39c245afc0c9ea95fb88b534bb4429.jpg",
    "industry": "Training Institutes",
    "about": "Megha Multipurpose Training Institute Pvt. Ltd. (MMPTI) is a Vocational Training Institute situated in Garuda, Bairiya-9 Rautahat and register under Company Registrar Office on 2069/11/01 BS, Cottage and Small Industry Office on 2065/11/30 BS, MMPTI has institutional accreditation with CTEVT for conducting short term technical and vocational trainings. MMPTI provides training in diverse trades since last eight years in different parts of Nepal.\n\nMMPTI is well equipped with training facilities, logistics, equipment, training materials and bigger pool of trainers. It has good track record of experience in providing trainings in diverse trades, provides better employment linkage with INGOs, NGOs, Consulting Firms, Contractor Firms, Industries, Business Group and Overseas Employment Companies.\n\nMMPTI have accreditation for certified Skill test centers by NSTB/CTEVT on 2074/07/21 for Tailoring-L1, Plumber-L1, Mobile Phone Repair-L1, Motorcycle Service Mechanics-L1, Building Electrician-L1\n\n\n\n\nVision: To develop skilled workforce who can contribute in nation building.\n\n\n\n\nMission:To enhance level of income and improve life style of poor, disadvantage groups, marginalized groups, dalit, indigenous, conflict effected unemployed youth and a person who don’t get a school level education.\n\nObjective:\n\n·      To conduct Vocational, Technical and skill training in various trade.\n\n·      Conduct training need assessment, Conduct rapid market assessment (RMA)\n\n·      Linkage with Technical job provider\n\n·      To conduct Study, Research, Survey, Monitoring and Evaluation.\n\n·      To organize workshop, seminar, interaction and orientation program in different subject\n\n·      To conduct social development activity\n\n·      Design and Develop training curriculum"
  },
  {
    "companyName": "Mercantile",
    "logo": "https://merojob.com/media/cache/5c/fd/5cfd02415a0eb176e2b5e828091bfd7f.jpg",
    "industry": "Software Companies",
    "about": "The company envisages being a leader in the field of Information Technology in Nepal by establishing a communication network across the country. We are leading provider amongst the whole nation, and is well known for the superior performance, reliability and cost effective products. Mercantile is an emerging leader in the world of fluid convergence between technology, communication and business. As one of the largest facilities-based broadband networks, Mercantile leads the way toward a New World of frictionless business with its unique and seamless combination of technology, applications and implementation."
  },
  {
    "companyName": "MeroShopping.com",
    "logo": "https://merojob.com/media/cache/b7/67/b767339d173fa19f82640c7a93067f62.jpg",
    "industry": "Distribution Companies / Wholesale",
    "about": "MeroShopping.com located in Kathmandu requires personnel with proven competence for the following position:"
  },
  {
    "companyName": "Nagarik Aawaz",
    "logo": "https://merojob.com/media/cache/1c/c2/1cc27f7cdd6ab8806e69a3be3fc056ae.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Nagarik Aawaz (NA), is a social organization that engages, encourages and capacitates societal structures of communities to fulfill the vision of just and peaceful Nepal. It is a pioneer organization for conflict transformation and peace prevention of Nepal, established in 2001 A.D. (www.nagarikaawaz.org.np, our official Facebook page: www.fb.com/naforpeace)"
  },
  {
    "companyName": "Ncell",
    "logo": "https://merojob.com/media/cache/a5/ab/a5abcccce075669f88c0911d076d0747.jpg",
    "industry": "Telecommunication",
    "about": "Ncell Axiata Limited (Ncell) is a part of the Axiata Group Berhad, one of Asia’s leading telecommunication groups.\n\nAxiata has controlling stakes in market-leading mobile and fixed operators in the region including 'Celcom' in Malaysia, 'XL' in Indonesia, 'Dialog' in Sri Lanka, 'Robi' in Bangladesh, 'Smart' in Cambodia, and 'Ncell' in Nepal. Axiata is actively spearheading efforts to transform its mobile-centric operations into digital converged companies.\n\nAt Ncell, we are passionate about our values, principles, and our strategic priorities. We believe that having the right talent in the right roles enables execution, improves our customer’s experience, and delivers breakthrough results. This is what makes us a winning team.\n\nAt Ncell, we lay much emphasis on our corporate values: Uncompromising Integrity, Exceptional Performance, Customer at our Heart, Breakthrough Innovation, and One Company - One Family. These values are the most integral part of our business. We carry out our daily business by keeping these values in mind as we, as an organization strongly stand for it.\n\n\nApplicants must have the highest ethical standards, strong leadership skills, excellent judgment, a sense of personal initiative, and problem-solving abilities.\n\nNcell offers a competitive package that is designed to make you feel an integral part of the team and directly involved in the company's success.\n\nNcell is also committed to protecting Applicants' personal data. In Ncell, we take privacy seriously and all our activities are underpinned by our T.R.U.S.T principles of being Transparent, respecting your Rights, in our Use of personal data, through robust cyber Security practices and we take due care when Transfer of data is required. Click the link to know more about applicants privacy https://webapi.ncell.axiata.com/upload/Notice/Ncell_Axiata_Privacy_Notice_for_Candidates.pdf"
  },
  {
    "companyName": "Nepal Cancer Hospital and Research Center (NCHRC)",
    "logo": "https://merojob.com/media/cache/13/0f/130fdead0fd518a60d5590501cdd14c3.jpg",
    "industry": "Hospital / Clinic / Diagnostic Centre",
    "about": "Nepal Cancer Hospital and Research Center (NCHRC) Ltd. is the first ever effort from the private sector, established to provide the highest quality of state-of-the-art treatment and excellent care to the patients and their families from all around the globe. The hospital has a dedicated multidisciplinary team of cancer specialists offering affordable, safe, innovative and compassionate care to cancer patients. In addition to the latest innovative treatments and state-of-the-art equipment, the hospital goes beyond just medicine and opens access to alternative medicine as well."
  },
  {
    "companyName": "Nepal Vending Pvt. Ltd.",
    "logo": "https://merojob.com/media/cache/de/5f/de5f4d77a7f70a41ba37771d6e46c35d.png",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "Nepal Vending Pvt. Ltd. Is the growing Tea and coffee  Vending Services provider in Nepal"
  },
  {
    "companyName": "Nest Media",
    "logo": "https://merojob.com/media/cache/6e/a8/6ea8ae1650978b205e7fdc765ce58f2a.jpg",
    "industry": "Designing / Printing / Publishing",
    "about": "Nest Media is a media and communication company which focuses primarily on print and digital platforms (website, software, digital marketing). We are a team of young and energetic people, constantly on the lookout for new and innovative ways to deliver our services, and driven with the intention of reviving the respective industry."
  },
  {
    "companyName": "New York Global Consultants Inc. (NYGCI)",
    "logo": "https://merojob.com/media/cache/48/5a/485aba209eb33746565dd179d4ced7b4.jpg",
    "industry": "Consulting / Legal",
    "about": "New York Global Consultants Inc. (NYGCI) is an innovative technology services provider. Our major capabilities include IT Consulting, Data Protection Services and Application Performance Management services. We transform, build and operate IT infrastructure and business processes on behalf of clients to help improve their productivity and performance. Our team harnesses the power of technology to drive innovation, deliver cutting-edge solutions and increase productivity.\n\nEstablished in 2007, we provide Information Technology solutions and services to medium and large enterprises in USA, Canada, Brazil, Europe, Africa, UAE, India, Singapore, Malaysia, Philippines, Japan, China, Hong Kong, Australia, and New Zealand markets. nygci.com"
  },
  {
    "companyName": "NG Metal Works",
    "logo": "https://merojob.com/media/cache/d8/ac/d8acf42fe2fb1623e9e7f012f25c54e4.jpg",
    "industry": "Manufacturing / Engineering",
    "about": "NG Metal Works Pvt. Ltd is a firm engaged in manufacturing Doors and windows with the manufacturing plant situated at Sankhadevi, Mahalaxmi – 8, Lalitpur.\n\n\nN.G also manufactures different profiles including steel profiles and distributes nationwide through wide network of its dealers and workshops."
  },
  {
    "companyName": "OneLoveOneWorld",
    "logo": "https://merojob.com/media/cache/b4/ca/b4cafa3c507ab2110a34d207723cd6c2.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "OneLoveOneWorld (OLOW) is a non-profit organization registered in Kathmandu, Nepal in 2011. OLOW is dedicated to the planning and implementation of social programmes, targeting unprivileged people especially children and women in Nepal. OLOW supports marginalized and vulnerable people to access their rights and social service (education, health care) and through capacity building."
  },
  {
    "companyName": "Otech Pvt. Ltd",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Telecommunication",
    "about": "OTECH Pvt. Ltd. is established under the motto of “total technical solution” in a professional manner. The company has a team of highly enthusiastic young as well as experienced professional engineers, management experts and professionals with specialized expertise. Our team has focused energies and expertise in reliable and specialized functions, which give us true international perspective. We desire to meet rigorous standards of professional and operational competence. We provide minute information on worldwide business practices and deliver standard services and products as per the need. We trust in continuous strategic and technical alliances for better solutions."
  },
  {
    "companyName": "Oxford University Clinical Research Unit-Nepal (OUCRU-NP)",
    "logo": "https://merojob.com/media/cache/b1/15/b115ef5dc302402aef25e5ced6a66fd8.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Oxford University Clinical Research Unit-Nepal (OUCRU-NP), is a not for profit organization (NPO) with its head office located in Lalitpur, Bagmati Province, Nepal. The mission of OUCRU-NP is to build a strong mass of young Nepalese clinicians and scientists who can help build the scientific and clinical future of Nepal. The main research focus of OUCRU-NP has been on the common infectious diseases within Nepal including but not limited to: enteric fever (Typhoid and Paratyphoid); scrub and murine typhus as well as other causes of febrile illness; antimicrobial resistance (AMR) and infections of the central nervous system and Hepatitis E. OUCRU-NP plans to expand its research work to emerging pathogens with a flexibility to be able to address the public health priorities in Nepal in the future."
  },
  {
    "companyName": "Paragon Public School",
    "logo": "https://merojob.com/media/cache/ec/20/ec203ca9ce5de3af9100944cd6a0918a.jpg",
    "industry": "Education - School & Colleges",
    "about": "Paragon Public School was established in the year 1994 in Battisputali, Kathmandu with 57 students and 15 staff members. In the year 2003 with the vision of providing quality education at an affordable cost by using modern pedagogies in the state-of-the art infrastructure facilities Paragon shifted to a permanent location beside the banks of Bagmati River . \n\n\nWe are a school with a vision, aimed at creating citizens of a global community. The emphasis is on a stimulating, happy learning environment where a child's talents can be nuturned in fulfillment. We opt to provide holistic education in which children are prepared to face any crisis in life with moral dignity and become loyal citizens of the country. With Honesty and Loyalty deeply embedded in our heart we encourage innovative learning through different academic and non-academic activities.\n\nSchool Website"
  },
  {
    "companyName": "PasalRun",
    "logo": "https://merojob.com/media/cache/ec/6c/ec6c91c822c8ebbeb85b52c6674dda7f.jpg",
    "industry": "E-Commerce/ E-Business",
    "about": "Pasalrun is an e-commerce & delivery platform that strives to provide the best-in-class customer experience for online shopping and delivery. We are breaking the grounds to provide delivery within 2-hours for our partners in and around Kathmandu, Lalitpur, and Bhaktapur area."
  },
  {
    "companyName": "Pashupati Architect Associates",
    "logo": "https://merojob.com/media/cache/41/da/41da2a008af592dde14f95f6d387d4dd.jpg",
    "industry": "Construction / Real Estate",
    "about": "We are an Architectural Design, Construction and Project Management company. Generally, we take up projects on design and build basis."
  },
  {
    "companyName": "Phoenix Distillery",
    "logo": "https://merojob.com/media/cache/6e/e0/6ee0f9ed8c1ccd8a72615daeb512c48c.jpg",
    "industry": "Manufacturing / Engineering",
    "about": "Phoenix Distillery established in 2015, the Phoenix Distillery is where it all started. The goal was simple: create a spirit that would forge a benchmark in the Nepalese Alcohol industry, and proudly represent the nation on a global scale. Lucky for us, the fertile soils and pure spring waters of the pristine mid hills of Nepal laid the groundwork for our endeavors. What followed was a long and meticulous process of research, development, and experimentation to create the perfect bottle of high quality, single barrel malt whiskey. No half measures were taken in our pursuit for perfection. By putting together an expert team of Master Blenders from Ireland, Scotland, and Poland, along with an elite group of highly skilled distillers in Nepal, we were finally able to create something that we were proud of."
  },
  {
    "companyName": "Pixel Creatives",
    "logo": "https://merojob.com/media/cache/0a/be/0abe68ba1b27575c94d775d6f77df7bb.jpg",
    "industry": "Advertising Agency",
    "about": "Pixel Creatives is a digital solutions company that provides integrated marketing solutions that meld all aspects of content fulfilment, content strategy, media production, and web development services.\n\n\n\n\nWe at, Pixel Creatives, have been actively working with medium & large scale businesses across creative, technology & media. We’re integrated, which means all three of our departments – Creative, Production & Web, work under a single roof building a quality product that is guided by a single look, tone of voice, and business vision. This ensures everything we create is always in line with the business direction and creative direction you set out.\n\n\n\n\nLet's make something beautiful together. Get in touch.\n\n📞981-3244523"
  },
  {
    "companyName": "PricewaterhouseCoopers",
    "logo": "https://merojob.com/media/cache/c1/9b/c19b16200d49ce6ed1a23165711c7e97.jpg",
    "industry": "Audit Firms / Tax Consultant",
    "about": "Provincial Support Programme (PSP) is a joint initiative of the Government of Switzerland and the Government of Nepal with Office of the Chief Minister and Council of Ministers (OCMCM) of Province 1 as an executing agency. PSP is supported by Swiss Agency for Development and Cooperation (SDC). The project duration is 01.02.2020 to 31.01.2024. The Consortium of PwC Switzerland (PwC AG) and PwC India (PwC PL), through Programme Management and Implementation Supports Consultants (PMISC) is supporting OCMCM to implement the programme. The overall goal of PSP is to support the Government of Nepal to strengthening federalism through well-functioning institutions, systems and processes.\n\nIn order to supplement PMISC team, PSP/ PwC is now seeking applications from qualified and experienced Nepali Nationals for the following full-time positions based in Biratnagar."
  },
  {
    "companyName": "Proshore Nepal",
    "logo": "https://merojob.com/media/cache/af/a1/afa1a1f8c4edd128ef3d13e5d3a221b9.png",
    "industry": "Information / Computer / Technology",
    "about": "We are Proshore. A long-term service partner that builds, trains, and coaches co-located development teams in Nepal. We combine technical talent, extensive experience and entrepreneurship to accelerate your business growth."
  },
  {
    "companyName": "PSP Corporation",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Information / Computer / Technology",
    "about": "Healthcare IT company is looking for young engineers to join us."
  },
  {
    "companyName": "Quasar Energy Consultants",
    "logo": "https://merojob.com/media/cache/3a/ad/3aad2e08a15a5479b41317abbe852e85.jpg",
    "industry": "Hydropower / Alternate Energy",
    "about": "Quasar Energy Consultants is formed by a group of Renewable Energy Experts and Entrepreneurs with local insights and international expertise. We at Quasar Energy Consultants, believe that renewable energy has the power to change the lives of people in developing economies. Our team possesses a high degree of professionalism to provide data-driven research and analysis for Renewable Energy consulting and advisory services."
  },
  {
    "companyName": "RB Diagnostic Pvt. Ltd",
    "logo": "https://merojob.com/media/cache/0e/6a/0e6a30cf69f991b837323b541b755cfc.jpg",
    "industry": "Pharmaceuticals / Healthcare",
    "about": "Rb Diagnostic is an India-based Diagnostic Centre. It is a chain of diagnostic centre with its head office in Kolkata. We are opening a new Branch in Kathmandu. Rb Diagnostic is a one-stop location for all your Health needs."
  },
  {
    "companyName": "Reizvoll Cosmetics",
    "logo": "https://merojob.com/media/cache/e1/fb/e1fbc137a9c9bb673280a23afa0bda07.jpg",
    "industry": "Beauty, wellness and Grooming",
    "about": "Reizvoll is a cosmetic brand that produces makeup products, manufactured mostly in Europe. We are proud to create a comprehensive line of makeup that celebrates diverse beauty and brings out your best with our holistic approach to beauty, we passionately work on discovering new beauty innovations.\n\n\nGoals and objective\n\n#To serve the market, with exclusive marketing lines, excellence in service, and un-comparable quality and price of products.\n\n#Become a key player in the cosmetics business.\n\n#To build a good reputation in the field of Make-up, Health, and beauty."
  },
  {
    "companyName": "Reliance Trade Link",
    "logo": "https://merojob.com/media/cache/1c/eb/1ceb72ade8511174fd2d27a047d18f86.jpg",
    "industry": "Construction Material and Equipment",
    "about": "Reliance Trade Link is seeking to recruit a dedicated and qualified candidate for following positiopn:"
  },
  {
    "companyName": "RM Group",
    "logo": "https://merojob.com/media/cache/5a/99/5a99fca5684f1ae640f6e2ee93607baa.png",
    "industry": "Hydropower / Alternate Energy",
    "about": "RM Group is a prominent hydropower development conglomerate of Nepal, currently engaged in the implementation of a cumulative of 240 MW hydroelectric projects located at Taplejung, Dolakha, and Ramechhap, Rasuwa, Lamjung and Kaski, Districts of Nepal."
  },
  {
    "companyName": "SabKura Consultancy",
    "logo": "https://merojob.com/media/cache/72/74/7274a450b6e0d14e27d1ba74d1ed7ebb.jpg",
    "industry": "Consulting / Legal",
    "about": "Welcome to our Consultancy\n\nSabKura Education Consultancy is one of the pioneers for abroad education counselling in Nepal. We are registered under The Ministry of Education, Science & Technology and fulfil all of the technical and certification requirements along with attaining the global certification of training which have possessed us with the knowledge to lead the counselling industry. We specialize in counselling destinations like Australia, the USA, United Kingdom, Canada, Netherland and India. And along with the high visa success rate, we also are proud of our students who have been successful in their careers through our counselling and guidance. That makes us possibly the best education consultancy in Nepal."
  },
  {
    "companyName": "Sagoon Nepal",
    "logo": "https://merojob.com/media/cache/15/d9/15d97eb17f289e43f7354076bb0e22db.jpg",
    "industry": "E-Commerce/ E-Business",
    "about": "Sagoon – an everyday household name in South Asia is becoming a favorite social media platform among the young population in Nepal and India. Thousands of users are joining Sagoon daily to Connect with friends, Share knowledge & experience, and Earn smart coins while spending time on the platform. The experience becomes more flattering with features like trending videos and mood talk. Users can also find stories based on their interests and location about everyday life, religion, politics, sports, entertainment, health and fitness, humor and jokes, student life, inspiration—whatever interests the most! \n\n Sagoon offers you a revolutionary product – “Social Smart Card”, a digital wallet that enables you to earn smart coins on every story you post or any activity you do on the platform. The more your story becomes popular, the more smart coins you will earn. The more you earn, the more you shop and gift to your loved ones. Isn’t it amazing? \n\n Sagoon has more than 8 Million users so far and together these users have performed over 300 Million activities on the platform. With these activities, users of Sagoon have earned over 1.3 Billion Smart Coins, out of that over 288 Million Smart Coins have been used for shopping 200,000 gift items."
  },
  {
    "companyName": "SB Furniture Nepal",
    "logo": "https://merojob.com/media/cache/9f/36/9f367fb0b769269b6b058ea6b6caff2d.jpg",
    "industry": "Manufacturing / Engineering",
    "about": "SB Furniture Nepal - SB Furniture continuously expands its market internationally and in Nepal making the brand more accessible to its customers. They cater to both condominium and residential markets selling quality and space saving furniture that will satisfy and fit any lifestyle.\n\nAll items went through and passed an international quality inspection making the brand known for its E1 seal or European Class Standard which indicates a low formaldehyde emission. Meaning, there is a guarantee that each piece of furniture is safe for you and your family's health.\n\nBeing the pioneer furniture brand to offer free furniture layout design for your condo and any kind of house, SB Furniture aims to create added value for its customers. This service is made easy with the help of skilled in-house interior design specialists that shares their professional experience and expertise to every customer in need of a designed home."
  },
  {
    "companyName": "Scott Wilson Nepal",
    "logo": "https://merojob.com/media/cache/de/64/de64accbae4b42afc8d6bb416e59957c.jpg",
    "industry": "Research Firms",
    "about": "S.W. Nepal Pvt. Ltd. (Scott Wilson Nepal/ SWN) is a wholly Nepali-owned multidisciplinary research and infrastructure development consulting service, provider. It has leading expertise in Nepal in Third Party Monitoring, capacity building of Local Governments in infrastructure service delivery, and a deep commitment to inclusive social and governance initiatives in different spheres of governance in Nepal. SWN is a choice of international development partners and the Government of Nepal for delivery of quality outputs in the design and management of projects and programmes; green infrastructure development; social protection based programmes; field-based research works on social and governance issues including gender-related areas; and monitoring and evaluation of projects and programmes. It has a strong in-house management capability for undertaking the above assignments.\n \nWe encourage potential applicants to visit www.swnepal.com.np for more details on our team, location, and our services."
  },
  {
    "companyName": "S.D & Associates",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Audit Firms / Tax Consultant",
    "about": "S.D.& Associates solemnly commenced its chartered accountancy firm registered under Institute of Chartered Accountants of Nepal (ICAN), rendering its service in the field of auditing & advisory, taxation & assurance. Revered for our professional quintessence and technical proficiency, for over years with highly professional squad, we have successfully cultivated efficacious solutions to every individual client's requirements with intensified engagements inclusive of professional ethics. Having served the wider business community we have adopted steady approach i.e. “one-size-fits-all” standardization and tailored services which has reciprocally adhered to standards laid out by our clients. So far, we have built long-term relationships with our clients and have gained respect.  Our expertise in the areas of Assurance, Risk Advisory, Income tax consultancy, Accountant certification, Business formation consultancy services, Corporate Finance, Transactions Services, Merger and Acquisitions, Litigation support, IFRS Implementations etc enables us to assist corporates, associations, donor institutions and even not-for-profit institutions, with professional organizational support services\n\nThat specifically fits to their needs and solves their problems.\n\n\n\n\nWe offer fast and reliable services in the field of:\n\nAssurance & Risk Advisory, \n\nIncome tax consultancy, \n\nAccountant certification, \n\nBusiness formation consultancy services, Corporate Finance, Transactions Services, Merger and Acquisitions,\n\n Litigation support, IFRS Implementations etc."
  },
  {
    "companyName": "Shiv Shakti Group",
    "logo": "https://merojob.com/media/cache/ec/1e/ec1e71f1a1336655619cca969d761a15.jpg",
    "industry": "Consumer Products / FMCG",
    "about": "Shiv Shakti Group is one of leading consumer product manufacturer of Nepal having business in Aluminum, Plastic Fabric, Packaging, laundry Soap and Agriculture based products (e.g. Rice, Mustard Oil, Soybean Oil, Sunflower Oil, Olin and other Edible Oils).\n\nOur Organization, Shiv Shakti Group was established  in 2044. Shiv Shakti Group is dedicated to continuous improvement by working in an utmost ethical manner while maintaining highest standards and quality. While growth is essential for our businesses, it will not come by compromising our relationships with our clients and partners. Our founder has always emphasized that our business should “positively touch every life that we come across or do business with.” Therefore, a positive experience for our clients and our partners is an important part of our core values, which we have sustained for over 25 years.Our Vision & Mission\n\nVision\n\nSustain Shiv Shakti group’s position as one of Nepal’s most valuable corporations through its world class performance. We recognize and seize opportunities for growth that builds upon our strengths and competencies.\n\nMission\n\nWe are always customer focused and will deliver what the customer needs in terms of value, quality and satisfaction.\nShiv Shakti Group Values are aimed at developing a customer-focused, high-performance organisation which creates value for all its stakeholders.\nDevelop and make good relation with our customers.\nBecome the most admired company in Nepal."
  },
  {
    "companyName": "Sindhu Surgical Concern Pvt. Ltd.",
    "logo": "https://merojob.com/media/cache/e3/9a/e39ad9e6b56b42d98740aeef01985369.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "A Reputed Trading Company of Medical Device is seeking for qualified candidates:"
  },
  {
    "companyName": "SK Technology",
    "logo": "https://merojob.com/media/cache/cc/8b/cc8bc27d7439bca8ab5d04c0f88b59e9.png",
    "industry": "Software Companies",
    "about": "SK Technology strives to create strong and well-guided communities in a select group of verticals. We operate one of the largest user-centric communities online with over 1.25 million members throughout our communities today, and continued growth into the future."
  },
  {
    "companyName": "Skytouch Biomed",
    "logo": "https://merojob.com/media/cache/34/d8/34d83fc6e215a01bd38fff81cb28e3cc.jpg",
    "industry": "Pharmaceuticals / Healthcare",
    "about": "Skytouch Biomed Pvt Ltd. is a pioneering trading and manufacturing company established 5 years ago. Skytouch Biomed is a young and dynamic company specializing in importing medical equipment, consumables, and supplies. Skytouch Biomed has been manufacturing and supplying covid essentials such as Face Shields, Fabric PPE, etc"
  },
  {
    "companyName": "Snowball Capital Pvt. Ltd.",
    "logo": "https://merojob.com/media/cache/4e/af/4eaf51536ca20b80c0ecc4f1250f3de3.jpg",
    "industry": "Investment",
    "about": "Snowball Capital is an investment firm focused on opportunities in the Nepali capital market and special situations. Our investment philosophy is value-based, long-term oriented, and driven by rigorous research and common sense."
  },
  {
    "companyName": "Source Code",
    "logo": "https://merojob.com/media/cache/33/68/336892b83d082a9502212bde4dd5f828.jpg",
    "industry": "Software Companies",
    "about": "Source Code is a financial technology company established with the aim of simplifying technology for capital markets. We are primarily focused on developing innovative technology products for stock brokers, merchant bankers and stock investors.\n\nFor more details please login to www.sourcecode.com.np"
  },
  {
    "companyName": "South Asia Focus",
    "logo": "https://merojob.com/media/cache/ba/ef/baefa175711445a22f75d1c3a293ab74.jpg",
    "industry": "Media / Publication (Newspaper, Magazines)",
    "about": "Policy advocacy and capacity building in the areas of youth and gender rights. Also, we conduct training programs and seminars around the country and seeking for qualified and dedicated candidate for following position:"
  },
  {
    "companyName": "Subhagriha Institute and Consultancy",
    "logo": "https://merojob.com/media/cache/9b/c2/9bc27311871d4c47448b1cfe79aad600.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Subha Griha Institute & Consultancy was founded by Mrs. Sugandh Thapa, a nursing professional with more than three (3) decades of industry experience and currently the Chief of HAMS Nursing College. The newest feather in SubhaGriha’s cap is ‘it is now an authorized New Zealand Education Specialist Agent’. This means that candidates can request for information on studying and living in New Zealand and learn about getting admission to any institution in New Zealand from the experts at SubhaGriha.\n\nWith the world now turning into a global village, it is but natural for students to have the desire of studying in a foreign country to acquire an international degree. With the cut throat competition in the job market around the globe, a student from a third world country such as Nepal are likely to be left far behind even before one embarks on the journey. In order to remain in the race, one has to be equipped with the most up to date knowledge that comes with academic programs offered by reputed colleges and universities abroad. Hence, SubhaGriha has and is continuously looking to tie up and partner with reputed educational centers within Nepal and abroad so that such noble dreams can actually come true."
  },
  {
    "companyName": "Subis Poultry Marketing P. Ltd",
    "logo": "https://merojob.com/media/cache/31/d9/31d9da0dc7c4bce9328afeb0b4ad067b.png",
    "industry": "Poultry / Dairy / Veterinary",
    "about": "Subis Poultry Marketing is a combined entity of two prestigious commercial layer egg producers including Subis Poultry Pvt. Ltd and Kathmandu Poultry Pvt. Ltd. Handling the distribution of approximately 200,000 eggs per day, we are focused on distributing fresh and quality ensured table eggs to our wholesale as well as retail partners."
  },
  {
    "companyName": "Sulav Pay",
    "logo": "https://merojob.com/media/cache/26/c8/26c89c4c7a78e7d044ff66abc854fd02.jpg",
    "industry": "E-Commerce/ E-Business",
    "about": "Sulav Pay is a Payment Service Providing Company Recognized and Licensed by Nepal Rastra Bank for PSP. Sulav Pay operates its E-wallet in the name of N-Cash"
  },
  {
    "companyName": "Sunaulo Parivar Nepal (SPN)",
    "logo": "https://merojob.com/media/cache/d1/52/d15229bcb61711d3b291a2d286535832.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Sunaulo Parivar Nepal (SPN), a local implementing partner of Marie Stopes International in Nepal, is a well-established NGO which is delivering Family Planning and Sexual Reproductive Health services through‐out Nepal via different service delivery channels: centres and Marie Stopes (MS) Ladies. It works in partnership with Marie Stopes International UK (MSI), a global charity for providing reproductive health services across the world with a mission of ensuring individual’s fundamental right to have children by choice not chance.\n\nWe are looking for qualified and competent candidates for the following position:"
  },
  {
    "companyName": "Sunway Solar & Electronics Technology",
    "logo": "https://merojob.com/media/cache/d1/51/d1512bb6364f60b67b06a33c53c2873f.jpg",
    "industry": "Hydropower / Alternate Energy",
    "about": "A digital organization set up to address the crucial needs of emerging businesses in our Nation. We value the key role of businesses in our Nation’s economic growth and prosperity. Our aim is to be the catalyst, propelling emerging businesses into new frontiers of growth and performance."
  },
  {
    "companyName": "Swisscontact | Swiss Foundation For Technical Cooperation",
    "logo": "https://merojob.com/media/cache/03/87/038795dafc0a128d61ffe5126b2dc9dc.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Swisscontact is a leading partner organisation for the implementation of international development projects. The organisation promotes inclusive economic, social, and ecological development to make an effective contribution towards sustainable and widespread prosperity in developing and emerging economies. With this objective in    mind, Swisscontact offers the chance to economically and socially disadvantaged people to improve        their lives on their own initiative. The independent, non-profit, and private foundation was established in 1959 in Switzerland.  The organization strengthens   the competencies of people, improving their employability, increases the competitiveness of enterprises, growing their business, and fosters social and economic systems, promoting inclusive development. \n\nIn Nepal, Swisscontact is registered as an International Non‐Governmental Organisation that started its operations in 1991 with the initiation of the Training Institute for Technical Instruction programme.  Currently, Swisscontact Nepal has five development programmes across all seven provinces, with a well‐functioning country office that employs over 50 national and international staff members.\n\nOn‐going initiatives of Swisscontact in Nepal include the Nepal Agricultural Market Development Programme, also known as Sahaj, which contributes to a long‐term vision of thriving and inclusive agriculture markets that develop comparative advantages for import substitution and export growth, and thereby contribute to poverty reduction. Commercial Agriculture for Smallholder and Agribusiness programme works to encourage and support investments that are likely to produce broad based benefits to both farmers and agribusinesses and contribute to the commercialisation of the agriculture sector. The Youth Employment Project supports the integration of youth into the local job market and youth groups into social and economic processes. Swisscontact has furthered its work  in  the  system  development  of  Technical  and  Vocational  Education  and  Training  in  Nepal  through  the Nepal  Vocational  Qualifications  System project,  which  supports  the  Council  for  Technical  Education and Vocational Training, the national autonomous apex body of Technical and Vocational  Education and Training in Nepal,  to establish a National Vocational Qualifications Framework and a  corresponding National Vocational Qualification Authority. The Senior Expert Contact programme in Nepal promotes entrepreneurship through the provision of relevant and demand based technical advisory to enterprises through its international experts. The program works with Small and Medium Enterprises in sectors such as food, tourism, education, agriculture, hydropower, health, media, management and many more."
  },
  {
    "companyName": "Switchback Nepal",
    "logo": "https://merojob.com/media/cache/dd/28/dd28d66cb14e6741a3b71cd8ef632024.jpg",
    "industry": "Retail / Shops",
    "about": "Switchback Nepal stands to promote off-road adventure and mountain biking sport in Nepal. A one stop shop for quality riding gears.\n\nAdventure is in our DNA and we are always seeking thrill in exploration. Dirt biking and Mountain biking is our passion and we encourage the sport, generate enthusiasts to uplift the industry.\n\nWe are dedicated towards offering quality riding gears that are key to performance, safety and durability. We thrive towards making off-road adventure sport into a lifestyle. Nevertheless, we inspire people to “Dare to Dream Big” and explore outdoors to have a lifetime experience.\n\nWe are the authorized distributor of FLY Racing, LEATT, USWE, 100%, Ride Concept and so on. Moreover, we are driven towards developing new standardized products to offer riders that perfectly suits the Nepali market."
  },
  {
    "companyName": "Tech Central",
    "logo": "https://merojob.com/media/cache/36/ba/36ba25fa15aa03cae2f2e046e7a00b64.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Tech Central is a global firm with a diverse portfolio of online brands and more than 20 years of expertise in digital media and online marketing. And we're on the lookout for talented digital media professionals, creative authors, and topic experts to join us in our goal to share information that changes the world for the better."
  },
  {
    "companyName": "Techno Vision Traders",
    "logo": "https://merojob.com/media/cache/43/3f/433f80b5affc5eef74a5c4d06bf6c458.jpg",
    "industry": "Import - Export",
    "about": "Techno Vision Traders is Authorized National Distributor for Hikvision Video Surveillance and Storage products. Techno Vision is also a leading supplier and integrator of Video Surveillance System, Communication System, Bio-metric Solutions, Power Backup Solution and other IT equipment. Techno Vision provides the complete solutions for video surveillance system via identifying the need and proposition of the organization, deploying the experts to ensure the maximum yield. Techno Vision implements these types of security adoption especially designed for the multiple sectors."
  },
  {
    "companyName": "Tech One Global",
    "logo": "https://merojob.com/media/cache/de/a9/dea9248bd3ecaec84c1fd863d30a4c65.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Tech One Global is multinational company with branches in more than 8 countries. For more than a decade, Tech One Global has been committed to offering client-oriented services focused on facilitating efficiency, innovation, and creativity in the field of information technology. From software solutions developments to enterprise software distributions, from document management to business process outsourcing services and from learning solutions to IT certifications, Tech One Global offers a range of products and services that adapt to today’s trends in business and IT.\nTech One Global operate globally and is the Gold Certified Partner of Microsoft in Nepal. \n\n Learn more at www.techoneglobal.com\n\n \n\nWHY JOIN US: Tech One Global believes that the technological revolution gathers its strength from the people. The company’s growing team of employees come from diverse professional and cultural backgrounds. Tech One Global encourages an open workplace that values collaboration, teamwork, and individual growth. Our team members are empowered and take a proactive approach to providing solutions and delivering results."
  },
  {
    "companyName": "Tekvortex",
    "logo": "https://merojob.com/media/cache/21/f2/21f2229bc26f571c50ba04829b68401a.jpg",
    "industry": "Software Companies",
    "about": "Tekvortex is an offshore software and services company offering software development services to its clients worldwide since 2012. Formed by a group of industry experts with decades of experience behind them, the company has been successful in delivering several mission-critical, high-profile projects to its clients in time, quality, and budget since its inception.\n\nTekvortex has people-first policy and ensures that its employees get every opportunity to develop their skills and build a rewarding career."
  },
  {
    "companyName": "Time Square Travel and Tours",
    "logo": "https://merojob.com/media/cache/1b/21/1b21e8d603023fc30877454db5fa0c9f.jpg",
    "industry": "Travel Agents / Tour Operators",
    "about": "It deals with wide range of business and seeking to recruit a qualified and dedicated candidate for following position:"
  },
  {
    "companyName": "Triton International College & School",
    "logo": "https://merojob.com/media/cache/33/8f/338f727a3600eb3794bea005606ea258.jpg",
    "industry": "Education - School & Colleges",
    "about": "Triton College under the management of DV group of companies.\n\nTriton International Sec. School / College has been brought under the Triton International Foundation umbrella and it is run by a team of renowned academicians and promoted by a successful and prestigious corporate house of the nation.\nA true dedication to quality education and imparting practical knowledge to the Tritonians is being accelerated in real sense by the new resourceful, experienced and visionary team."
  },
  {
    "companyName": "UBA Solutions",
    "logo": "https://merojob.com/media/cache/73/9f/739faf313e08055e498696b05fac4c69.jpg",
    "industry": "Software Companies",
    "about": "UBA Solutions incorporated on February 12, 2006, is one of the pioneer IT companies of Nepal. UBA Solutions is a Monotype Partner Company working in collaboration with Monotype Inc. since 2009. Monotype Inc. is a US-based multinational company whose headquarter is in Boston, MA; and has offices in India, USA, Korea, UK, Germany, China, Japan and Nepal.\n\nAt UBA Solutions, we offer an entrepreneurial environment where technology professionals thrive and where individual contributions really count. Our employees create and help shape some of the most cutting edge technologies every day.\n\nAs a partner of Monotype, our engineering teams use best in class advanced techniques and tools in Continuous Integration, LAMP, Node.JS, AWS, Reactjs and automated test solutions in the entire spectrum of solutions in areas like cloud services, e-commerce, embedded systems, digital advertising and brand engagement."
  },
  {
    "companyName": "UNFPA Nepal",
    "logo": "https://merojob.com/media/cache/83/dd/83dde201869ce8edfddf4fcf3aec0289.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "UNFPA, the United Nations Population Fund, is a voluntary-funded international organization with a presence in over 150 countries, including Nepal. UNFPA is guided by the Programme of Action of the 1994 Cairo International Conference on Population and Development (ICPD) and the Sustainable Development Goals. Its mission is to ensure that every pregnancy is wanted, every childbirth is safe and every young person’s potential is fulfilled.\n\nThe work of UNFPA is based on the premise that all human beings are entitled to equal rights and protections. We focus on women and young people because these are groups whose ability to exercise their right to sexual and reproductive health is often compromised. Our work is informed by an understanding of population dynamics, human rights and cultural sensitivity.\n\nUNFPA in Nepal\n\nUNFPA support to Nepal began in 1971 and has evolved in response to the changing national contexts. The current 8th Country Programme (2018-2022) is in line with Sustainable Development Goals, ICPD Programme of Action, the UN Development Assistance Framework (UNDAF) for Nepal and national priorities set by the Government of Nepal.   \n\nUNFPA partners with the Government of Nepal, youth and women’s organizations and development partners to advance its mission. Under the 8th Country Programme and in line with its mandate, UNFPA Nepal is working around the following areas:\n\nSexual and reproductive health and rights: UNFPA is supporting national efforts in Nepal to improve the sexual and reproductive health of the most marginalized adolescent girls and women. The Fund is largely focusing on youth aged 15-24 and the most marginalized women addressing both the demand and supply sides of reproductive health services to improve access to information and services on maternal health, family planning, and sexually transmitted infections, including HIV.\n\nGender equality: UNFPA’s support to the Government of Nepal under this overarching theme seeks to ensure that vulnerable groups experience greater self-confidence, respect and dignity. We are building national capacity in the health sector to address gender-based violence (GBV), prevent child marriage and other harmful practices, and working to enhance the knowledge and capacity of men, women and communities to GBV.\n\nAdolescents and youth: Investing in young people, especially the vulnerable and the marginalized, is a priority for UNFPA Nepal. The country has a large adolescent and youth population. Nepal is experiencing a demographic window of opportunity, a ‘youth bulge’. Nepali youth face several development challenges, including access to education, employment, gender inequality, child marriage, youth-friendly health services and adolescent pregnancy. Yet, with investments in their participation and leadership, young people can transform the social and economic fortunes of the country. UNFPA Nepal works with the government and partners to advocate for adolescents and youth’s rights and investments, including education, livelihood skills and health, including sexual and reproductive health.\n \n\nPopulation dynamics: Population megatrends at the national and sub-national levels in Nepal continued rapid population growth, population aging, urbanization and migration — not only frame the entire development debate, they demand a reconsideration and re-conceptualization of what will be the main challenges for a new Nepal. Without an adequate understanding of how Nepal is changing from a demographic perspective, forward-looking planning and agenda setting will be of little value. Keeping this in mind, UNFPA Nepal is working with the government to ensure that national, sectoral and decentralized policies and plans address population dynamics and the interlinkages with gender equality, poverty reduction, the needs of young people, and reproductive health, including family planning."
  },
  {
    "companyName": "United Academy",
    "logo": "https://merojob.com/media/cache/a5/78/a578e7cf3655b342bb73783aacc88539.jpg",
    "industry": "Education - School & Colleges",
    "about": "United Academy follows scientific teaching techniques, enabling students to approach their subjects with curiosity and keen insight. It is committed to bring out the best in students and strongly believes that good education is linked with discipline so that it becomes an integral part of their life. Efficient management at UA creates a congenial atmosphere for quality education. It also provides its own annual academic calendar before the start of the new academic session."
  },
  {
    "companyName": "USAID’s Strengthening Systems for Better Health (SSBH) Activity",
    "logo": "https://merojob.com/media/cache/45/6d/456d3c29eb87550587ae906df42c5a25.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "USAID’s Strengthening Systems for Better Health (SSBH) Activity is a 5-year project aimed at improving health outcomes in Nepal, particularly for the most marginalized and disadvantaged groups in the country. This will be accomplished through supporting the Government of Nepal’s efforts to expand access to and use of quality maternal, newborn and child health and family planning services, with a specific focus on newborn care. Strengthening Systems for Better Health will achieve three outcomes:\n\n(i) improving access to and utilization of equitable healthcare services;\n\n(ii) improving the quality of health services at facility and community levels;\n\n(iii) improving health system governance, within the context of decentralization and federalism.\n\nSSBH is implemented in close collaboration with the Ministry of Health and Population and the Ministry of Federal Affairs and General Administration at federal level, provincial and municipal governments, facility and community level health service providers, and other key stakeholders. Project technical staff will engage at national, provincial, and municipal levels in the target geographic areas of Karnali and Lumbini Provinces. The project is implemented collaboratively by Abt Associates, Save the Children, Karnali Academy of Health Sciences (KAHS) and Management Support Services (MASS)."
  },
  {
    "companyName": "Vaishno Medisales",
    "logo": "https://merojob.com/media/cache/8b/e1/8be1ae2055d5f5f336e40c29ff6e2445.jpg",
    "industry": "Distribution Companies / Wholesale",
    "about": "Vaisho Medisales is a leading company engaged in sales, distribution and after-sales service of ophthalmic equipment in Nepal with a salogan, \"One stop for complete ophthalmic requirement\". Since 2010 we are leading distributor of Ophthalmic equipment like: Phaco and Vitreoretinal machines, Optical Coherence Tomography(OCT), Operating Microscopes, Dry Eye Machine, Ophthalmic Simulator, Ophthalmic Lasers, Slit lamps, Ultrasound AB-scan units, Lensometer, Keratometer, Ophthalmoscopes, Retinoscopes, etc. dealing with major brands such as: Oertli, Heidelberg, Leica, Oculus, Lightmed, Accutome, & many more products launched recently such as HOYA premium IOL in Nepal.\n\nCurrently we are looking for candidates for the following positions:"
  },
  {
    "companyName": "Verisk Nepal",
    "logo": "https://merojob.com/media/cache/e6/90/e690017b1e4983b38a17745f4c68262f.jpg",
    "industry": "Software Companies",
    "about": "Verisk Nepal is the software development and information technology (IT) service support center for Verisk Analytics. We’re a dedicated team of software and IT professionals who provide technical support to Verisk’s businesses. At Verisk Nepal, we help our internal clients focus on their business solutions while we focus on the technology. Verisk Nepal is a wholly owned subsidiary of ISO, a Verisk Analytics business."
  },
  {
    "companyName": "Veritacore",
    "logo": "https://merojob.com/media/cache/d8/e6/d8e6c07ce1a5735efd36e2fde225dc0c.jpg",
    "industry": "BPO / Call Center / ITES",
    "about": "Veritacore is a unique BPO that exists to provide employment for individuals from disadvantaged communities, and through this, transform their lives via a computer-based career. We believe that the best workplace connects your skills, energy and talent to purpose.\n\nSince 2014, we have been keeping true to our purpose and impacting the lives of hundreds of women and men in Cebu, Philippines.   Our management team comprises of dedicated and experienced BPO professionals who go above and beyond to make a difference in the lives of our employees.\n\nWe are growing rapidly and now over 200 strong - and are making a name as a world-class company for digital media editing.  And we are hiring to support the next exciting phase of our growth into leading digital media technology in our new branch office in Kathmandu."
  },
  {
    "companyName": "Volunteers Initiative Nepal (VIN)",
    "logo": "https://merojob.com/media/cache/58/b5/58b57e5d42128fc5a3c08371be745aa0.png",
    "industry": "NGO / INGO / Development Projects",
    "about": "We are a not-for-profit NGO based in Kathmandu, working in rural communities of Nepal.\n\nOur mission is to empower marginalized communities through equitable, inclusive and holistic development programs. There are four pillars in our developmental approach: Education, Health & Environment, Economy and Basic infrastructure development. These four pillars of development are supported by six major community empowerment programs namely Women’s Empowerment, Children’s Development, Youth Empowerment, Public Health & Medical care, Environment Conservation and Disaster Risk Reduction. All VIN’s developmental and humanitarian programs are aligned with UN Sustainable Development Goals (SDGs)."
  },
  {
    "companyName": "Way To Success",
    "logo": "https://merojob.com/media/cache/ce/01/ce01c40d0c147ee02878de1fb9642736.jpg",
    "industry": "Other",
    "about": "Way To success is an International company which is provide various online/offline Training short term course, Documentation and counselling support which is basically help to people grow on their life with quick action."
  },
  {
    "companyName": "Woodapple Hotel and Spa",
    "logo": "https://merojob.com/media/cache/d0/01/d001339bef3a01a5417fa25f43456a12.png",
    "industry": "Hotels / Resorts / Restaurant",
    "about": "Woodapple Hotel and Spa is a 3 star hotel in Thamel, Kaldhara. It is the most convenient address and popular vicinities of Kathmandu are easily accessible to the guests within walking distance. With the touch of traditional meets contemporary architecture, Woodapple Hotel and Spa is equipped with the dynamic amenities. The hotel is lavishly built with an eye catching craftsmanship to create a homely environment. Our aim is to provide quality service prioritizing comfort and satisfaction.\n\nHere at Woodapple Hotel and Spa we are searching for highly enthusiastic and experienced team of members to build our organization more strong. We believe in team work and look for people who has the spirit to work and grow."
  },
  {
    "companyName": "WorldLink Communications",
    "logo": "https://merojob.com/media/cache/b4/1b/b41bb9fd52055ca0496f0de8e9b44d8d.jpg",
    "industry": "ISP",
    "about": "WorldLink is the largest Internet and Network Service Provider in Nepal and one of the most prominent IT companies. Founded in September 1995 with the aim of providing Internet and IT services by its present Chairman and Managing Director, Dileep Agrawal. WorldLink started off by providing store-and-forward e-mail services over a dial-up link to the Internet in the US. In March 1997, WorldLink started providing full Internet access over a dedicated leased-line to the Internet backbone in the US through Teleglobe International. From September 1999 till June 2008, WorldLink has been connecting to the Internet over a direct satellite uplink through its own VSAT terminal, thereby completely bypassing Nepal Telecommunications Corporation, the local PTT.\n\nWorldLink serves households, small and medium-sized enterprises (SMEs) and enterprise clients. It is the fastest-growing private ISP in the country and has a presence in 67 districts out of country’s 77 districts. Currently Worldlink has around 300,000 household subscribers spread across the country. The company plans to reach all the local bodies by end of 2023.\n\nSince 2012, WorldLink has rolled out a fibre to the home (FTTH) network, which it intends to expand across Province 3 and 4 towns and rural areas at affordable prices."
  },
  {
    "companyName": "World Vision International Nepal",
    "logo": "https://merojob.com/media/cache/40/a0/40a0400004dbf2b47fb2d1d417f199cb.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "\"World Vision is a child focused relief, development and advocacy organization that has contributed to transformation in the lives of millions of children around the world in vulnerable situations. We are driven by Christian values to serve children and families regardless of their religion, age, gender, ethnicity, class and caste. We are looking for potential Nepalese candidates to fill out the following position:\""
  },
  {
    "companyName": "Yodha",
    "logo": "https://merojob.com/media/cache/56/d6/56d67ed8a9415eb3f194ad2e92dee0bc.png",
    "industry": "Multinational Companies",
    "about": "Yodha is a Multinational Company with team of authentic Nepali Astrologers, talented Customer Counselors and professional Software Developers. Join us today to become a part of the top leading astrology company among UK, India, US, Nepal, Australia, Canada and European Union. Our mission is to make specialized Vedic astrology accessible to people world-wide in a convenient, effective, reliable and affordable way.\n\nWe are looking for motivated, educated and bright talents for the mentioned positions:"
  },
  {
    "companyName": "Zinob Inc.",
    "logo": "https://merojob.com/media/cache/d6/d7/d6d708c36df81a1c7f95366688345a70.jpg",
    "industry": "Software Companies",
    "about": "Zinob Inc. Pvt Ltd is a finTech & Customized APP and Software Development company .  With combined team effort, we are able to reach a new horizon in Software and Mobile Capps Development specially in FinTech sector. From CBS to Mobile Banking. We have created complete financial eco-system for financial institutions."
  },
  {
    "companyName": "ZTE Corporation",
    "logo": "https://merojob.com/media/cache/9c/31/9c31deabba321f4551b786af1c2462d0.jpg",
    "industry": "Multinational Companies",
    "about": "ZTE Corporation is China's largest listed telecommunications equipment provider specializing in offering customized network solutions for telecom carriers worldwide. The company develops and manufactures telecommunications equipment for fixed, mobile, data and optical networks, intelligent networks and next generation networks as well as mobile phones. ZTE has been listed on the Shenzhen Stock Exchange since 1997. Today, ZTE has become an important global player in the telecommunications industry with products deployed in over 40 countries and regions including Cyprus, Bangladesh, Thailand, USA, Russia, Egypt, Kenya, Congo, Zambia and Hong Kong. ZTE's respected position as a forward looking global organization within the industry is also reflected by membership of, and participation in, a variety of International Organizations of Standardization. ZTE was the first Chinese individual manufacturer member of 3GPP2 (3rd Generation Partnership 2) and has become a sector member of the International Telecommunications Union (ITU). ZTE is committed to the future of the telecommunications industry, and will continue to develop and expand its global operations to ensure that partners everywhere will have the most effective solutions both now and in the years to come."
  }
]