[
  {
    "companyName": "ABC Consulting",
    "logo": "https://merojob.com/media/cache/0a/f7/0af75ff6ff2ba30716aa0da548d90e1d.jpg",
    "industry": "Research Firms",
    "about": "Consulting firm for Information Technology."
  },
  {
    "companyName": "Ace Media and Marketing",
    "logo": "https://merojob.com/media/cache/c2/21/c2210b9bcc36398e9af3d14fc27de9c4.jpg",
    "industry": "Advertising Agency",
    "about": "Ace Media and Marketing is a young and enthusiastic agency designed to meet the needs of result oriented and innovative advertising and public relations for its clients.\n\nAce is now looking for energetic and potential candidates in the field of marketing, design and administration."
  },
  {
    "companyName": "Action Against Hunger",
    "logo": "https://merojob.com/media/cache/24/9e/249e01428f85fa9c936613efd02a31a4.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Action Against Hunger | Action Contre la Faim (ACF) is an international humanitarian organization committed to ending child hunger. Recognized as a leader in the fight against malnutrition, Action Against Hunger saves the lives of malnourished children while providing communities with access to safe water and sustainable solutions to hunger. With more than 40 years of expertise in emergency situations of conflict, natural disaster and chronic food insecurity, Action Against Hunger runs life-saving programmes in over 45 countries benefitting seven million people each year. With head offices in the United Kingdom, France, Spain, the United States and Canada, our international network shares its combined resources, breadth of experience and technical expertise in pursuit of a world without hunger. Every year, our 7,500+ field workers help over 21 million people in over 45 countries worldwide.\n\nAs a non-governmental, non-profit, non-religious organization, we are committed to principled humanitarian action as outlined in our International Charter of Principles: independence, neutrality, non-discrimination, free and direct access to affected populations, professionalism and transparency."
  },
  {
    "companyName": "AlphaBetaTheta Technologies",
    "logo": "https://merojob.com/media/cache/ac/e5/ace5efc05a9a3104d2145726a4557ca1.png",
    "industry": "Software Companies",
    "about": "Alpha Beta Theta Technologies is an IT services and consulting business. Our purpose is to support our clients to achieve better solutions and outcomes. We are committed to making our clients’ work simpler by providing a wide range of specialized services like web development, software development and IT consulting."
  },
  {
    "companyName": "Animal Health Training and Consultancy Service",
    "logo": "https://merojob.com/media/cache/de/db/dedb9290defa0df571f84ef0c610ab92.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Animal Health Training and Consultancy Service (AHTCS) was established in 2000 as a service-oriented, non-profit making and non-governmental organization for improving living standard of marginalized communities through partnership with national and international organization and agencies. It is registered in District Administration Office Kaski and affiliated with Social Welfare Council (SWC) Lainchaur, Kathmandu and NGO Federation, Kaski.\n\nSince 2007, AHTCS is working for working equine welfare as a Sustainable Equine Welfare through Improved Human Behavior & Working Environment Project (SEWP) in Banke, Bardiya, Bhaktapur and Dang districts in partnership with The Brooke Hospital for Animal (The Brooke UK)."
  },
  {
    "companyName": "A One Global Consultants Pvt Ltd",
    "logo": "https://merojob.com/media/cache/f6/bd/f6bdb305d568279cf050a0f479dd6402.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "A Multi National Education & Visa Services Company stationed in Australia, Nepal and Denmark. \n\nWe are international education representatives working together with global recognition and reputation – we provide assistance and advice to students who wish to pursue higher education abroad. We believe that education is a fundamental right and everyone should have access to quality higher education. With this view in mind, we strive to create opportunities for those who have genuine aspiration and honest intention, who seek excellent quality in tuition, student services, qualifications and career prospects post qualification.\n\nOur team comprises of dedicated enthusiast professionals backed up by long experience in the field of education, study abroad and test preparation. We are proud to achieve highly professional reorganization nationally and internationally being certified by various professional bodies, respected government bodies and stakeholders in the field of the services we offer."
  },
  {
    "companyName": "Apex Manokamana",
    "logo": "https://merojob.com/media/cache/e6/0c/e60c89d2b42ed39282652f06dc3e1ed0.jpg",
    "industry": "Distribution Companies / Wholesale",
    "about": "At Apex Manokamana, we are committed to working in ways that are true to our charter values of sustainability, integrity, respect, performance, simplicity and accountability. We strive to achieve our values across all our national operations.\n\nWe are among the nation’s growing producers of major commodities, including cement, clinker, and bricks and tiles .Our unrivaled portfolio of high quality growth opportunities will ensure we continue to meet the changing needs of our customers. The diversification of the Apex Group continues to be our defining attribute.\n\nOne of the major sector we have entered recently is on distribution of vivo mobile. Vivo mobile is one of the leading brand in Asian region."
  },
  {
    "companyName": "Aqore Software",
    "logo": "https://merojob.com/media/cache/e9/41/e941fcf1d5ad45e0da10119d816da1bc.jpg",
    "industry": "Software Companies",
    "about": "Aqore is a company founded by 2 successful software entrepreneurs with a proven record of building an international product used by thousands of users in the US and Canada. \nCompany is in process of procuring resources to build yet another product targeted for international market. \nWith a work hard/play hard motto we expect employees to grow with the company. Selected group of individuals will be working in multiple small agile startup teams.\n\nRun and managed by people with cumulative 50 years of industry and technical experience.\nCollaborative expertise in enterprise level product delivery, migration and security solutions\nOffer best solutions to clients to support their industry goals.\n\nEmployee Benefits:\n\nCompetitive Salary\nMedical Insurance\nLunch Allowance\nTeam Building events\nSports events\nCIT Option\nFlexible work environment\nVarious Skill Development Training\n\nWork Culture:\n\nYoung and dynamic work culture\nWork hard, play hard\nRight person for the right job\nGrow with us\nPassionate, committed and creative culture"
  },
  {
    "companyName": "Aria Solutions",
    "logo": "https://merojob.com/media/cache/79/37/7937781d2996e23c431ee858fb326412.png",
    "industry": "Other",
    "about": "Aria Solutions provides consulting services primarily to International Development agencies, Humanitarian agencies, Banks and Financial Institutions. Our specialization lie in humanitarian cash and vouchers assistance; financial inclusion; financial literacy; enterprise development; agri-business development; cooperative strengthening; digitalization; project designing and implementation support; capacity building; and developing standard operating procedures and strategic planning documents. Our clients and partners include Mercy Corps, Plan International, Oxfam, ADRA, Finn Church Aid, Prabhu Bank, Muktinath Bikas Bank, Meromicrofinance Bank, Khalti, Label STEP, IDRC, Katmandu Coffee etc. \n\nAria Solutions is dedicated to identifying the need to operate responsibly within a framework of trust, integrity and partnership. We maintain ethical business relationships and practices. We believe in holding on to the principle of delivering outstanding work that meets personal and firm standards. We encourage our team members to work with creative innovations in a dignified work environment.\n\nInvesting time and energy to make a positive impact on the community, environment, and well-being of others is highly valued and encouraged by the organization. At Aria Solutions, we seek, accept and encourage responsibility. We discourage passivity and highly value working towards raising the bar for continuous improvements.\n\nAria Solutions expects all of its team members to share its commitment to high ethical and legal standards and to avoid any activities that could involve the organization or its team members in any real or perceived unethical, improper, or unlawful act. We stand against any form of discrimination and encourage gender equality. We are committed to the safety and wellbeing of people we work with and have Zero Tolerance Policy for child abuse and any form of sexual harassment."
  },
  {
    "companyName": "BgBiz Media",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Advertising Agency",
    "about": "Marketing Agency"
  },
  {
    "companyName": "Bhudev Cooperative Limited",
    "logo": "https://merojob.com/media/cache/ed/0b/ed0bc2ad6eb600d80c988bd6c6c071fb.jpg",
    "industry": "Finance Companies",
    "about": "Bhudev Cooperative"
  },
  {
    "companyName": "Bhugol Park",
    "logo": "https://merojob.com/media/cache/56/c7/56c7999e227f3a9b11152bae700e52cb.jpg",
    "industry": "Research Firms",
    "about": "BhugolPark.com is a platform dedicated exclusively for polling and survey in Nepal in all topics. It is the one and only standing site for polling and survey in Nepal. Find out what Nepalis are thinking about any topic. The site allows anyone to create polls freely."
  },
  {
    "companyName": "Biogain Remedies Pvt. Ltd",
    "logo": "https://merojob.com/media/cache/15/be/15beac88bec40fed6e87b13bc61ef621.jpg",
    "industry": "Pharmaceuticals / Healthcare",
    "about": "Biogain Remedies was initiated in 2014 and is aiming to become one of the best quality driven manufacturers of Pharmaceutical products of Nepal. Biogain Remedies embraces state-of-the-art technology in quality production. The company is always committed to constant development and improvement, resulting in providing better service to its customers.\n\n\n\n\nBiogain Remedies comprises of young, energetic and dedicated professionals who have the expertise knowledge and perception to innovate and fulfill the needs of the market. Biogain Remedies is constantly exercising critical thinking to maintain professional competence for excelling the quality of its products. Biogain Remedies will always embrace highest standard of character to serve and promote quality of life through quality product with higher performance.\n\n\n\n\nBiogain Remedies is endowed with distinct departments of R&D, QC, QA & Production to ensure the quality drugs. The infrastructure of factory is completely equipped with all the requirements of cGMP guidelines without any compromise, which is backed by the most advanced technology and competent technical personnel."
  },
  {
    "companyName": "BM Nepal",
    "logo": "https://merojob.com/media/cache/75/af/75afa41179898e12b73ba037f1e53c8e.jpg",
    "industry": "Information / Computer / Technology",
    "about": "B.M. Nepal Pvt. Ltd. is located in Lainchaur, Kathmandu and is a Business Process Outsourcing (BPO) and software development company working on international clients’ high-profile web applications. We among others work together with one of the world’s largest travel applications, making sure that they stay ahead in an internationally competitive landscape.\n\nWe help our clients solve complex software development needs, provide customer service, conduct marketing, do business development, and handle general Business Process Outsourcing requirements.\n\nIf you’re looking to join a fast-paced and agile company with plenty of opportunities for growth and development, you’ve come to the right place. You’ll be joining a very talented team of people in a fun and challenging work space, allowing you to learn and grow as much as you wish.\n\nIf you’re smart, a quick learner, and ready for new challenges, join our team of professionals. We’re always looking for talented people.\n\nIn general, you will be joining a dynamic and friendly office environment.\n\nUpon starting the job, you’ll be provided with a suitable laptop. Lunch is served daily in the office as well as coffee, tea, water etc (free of charge)."
  },
  {
    "companyName": "BMP Infology",
    "logo": "https://merojob.com/media/cache/2e/f3/2ef311321e4033b2fcc0140f8dee251f.png",
    "industry": "Software Companies",
    "about": "We help launch new businesses or brands; listen carefully to your ideas, goals and expound on them. We come up with even more unique ideas so you don't have to. When you work with us you get a passionate team working to make your business or project a success. Ultimately, We are more than just an experienced developers, designers and marketers; we are your partner. We attract clients, not because we are perfect or we are over the top. It's because we care about you and make your dream project comes true.We escalate your business through our service."
  },
  {
    "companyName": "Bridge Education Foundation",
    "logo": "https://merojob.com/media/cache/2f/d9/2fd9aeb6522d4258ff453ce5a51397d5.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Bridge education foundation is well-established and esteemed educational consultancy based in the heart of Kathmandu, Nepal. Branch offices of Bridge Education Foundation are located at Birtamode, Damak, Hetauda, Simara and Pokhara. We help students to pursue higher education overseas. Motivated by our core values, ethics, expertise and leadership, we are one of the most trusted name in the field of overseas education. Facilitating best educational opportunities in the prestigious universities abroad, we rightly set the academic goals for aspiring students.\nCommitted to the objectives of integrity and excellence, Bridge is an acknowledged leader in overseas educational consultancy in Kathmandu, Nepal. We offer students a choice of thousands of courses at various leading educational institutions in USA, Canada, Australia, UK and Europe."
  },
  {
    "companyName": "Caravan Construction",
    "logo": "https://merojob.com/media/cache/a8/87/a887b6316fc151722d89971f889dda2c.jpg",
    "industry": "Construction / Real Estate",
    "about": "Caravan Construction Pvt. Ltd is a growing “A” class construction company in Nepal having more than 9 years of experience in diverse areas of contract undertakings. The sole objective of the company is to provide quality construction services to its clients. Its core area of work includes supply and delivery contracts, construction contracts covering work areas of road, building, irrigation structure and airport."
  },
  {
    "companyName": "Caritas Nepal",
    "logo": "https://merojob.com/media/cache/fa/57/fa57d7268c1ad50e32d99a7882f27a70.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Caritas Nepal is a non-profit organization solely devoted to the service of the poor, most disadvantaged, and marginalized people irrespective of caste, creed, ethnicity, and nationality.\n\nThe organization was founded in 1990 by the Catholic Church to respond to the devastating floods and other natural disasters that occurred.\n\nCaritas Nepal applies animation approach and sector-specific participatory approaches to empower the poor, marginalized, and disadvantaged class of people to reduce poverty, hunger, secure humanitarian assistance in the situation of man-made and natural emergency and therefore to realize social justice and peace.\n\nWith the vision of creating peaceful, equitable and just society, where there is solidarity among people and respect for human dignity, Caritas Nepal works on the sectors of social justice and community development, disaster risk management, sustainable livelihoods, migrants, refugee and anti-trafficking, emergency and recovery supports as well as advocacy on social concerns."
  },
  {
    "companyName": "CEDB Hydropower Development Company Limited",
    "logo": "https://merojob.com/media/cache/5d/ab/5dab007986cfb8dff59599af39a3c28d.jpg",
    "industry": "Hydropower / Alternate Energy",
    "about": "CEDB Hydropower Development Company Limited (CHDC), a public limited company incorporated under the prevalent laws of Nepal on Mangsir 15, 2066 (November 30, 2009). CEDB Hydropower Development Company Limited (CHDC) was founded by the then Clean Energy Development Bank to provide equity investment for hydropower projects to meet energy needs of the nation. CHDC is currently mandated to invest in and develop Hydropower Projects. It has got four hydropower projects in operation and three projects at construction and development stages.\n\nProjects Under Development/ Construction\n\nDordi-1 Hydro Electric Project (12 MW) (Lamjung)\nRukum Gad Hydropower Project (5 MW) (Rukum)\nKasuwa Hydropower Project (45 MW) (Sankhwasabha)"
  },
  {
    "companyName": "Centre for Agro-Ecology and Development (CAED)",
    "logo": "https://merojob.com/media/cache/17/55/1755336ab0709808130e39e1da8f417e.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Centre for Agro-Ecology and Development (CAED) works on agro-ecology, food sovereignty, social justice of dalit and indigenous groups, women and girls with rights-based development approach. It is seeking a passionate and competent Executive Director based in Kathmandu with frequent working area visits."
  },
  {
    "companyName": "Centre for Social Inclusion and Federalism",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "NGO / INGO / Development Projects",
    "about": "CESIF Nepal is a not-for profit, autonomous and independent private research institution serving in the public interest, with significant independence from any donor or interest group and autonomy from government. Our mission is to help the government and the society create a democratic, secure and just society by making informed and transparent decisions about policies and practices."
  },
  {
    "companyName": "China Communication Construction Company",
    "logo": "https://merojob.com/media/cache/2f/ee/2fee3092aeb1c4b77aa6e56e04607df1.jpg",
    "industry": "Construction / Real Estate",
    "about": "CHINA COMMUNICATIONS CONSTRUCTION COMPANY LIMITED (“CCCC” or the “Company”), initiated and founded by China Communications Construction Group (“CCCG”), was incorporated on 8 October 2006. The Company (including all of its subsidiaries except where the content otherwise requires) is the ﬁrst large state-owned transportation infrastructure group entering the overseas capital market.\n\nThe Company and its subsidiaries (collectively, the “Group”) are principally engaged in the design and construction of transportation infrastructure, dredging and heavy machinery manufacturing business. It covers the following business aspects: port, terminal, road, bridge, railway, tunnel, civil work design and construction, capital dredging and reclamation dredging, container crane, heavy marine machinery, large steel structure and road machinery manufacturing, and international project contracting, import and export trading services. It is the largest port construction and design company in China, a leading company in road and bridge construction and design, a leading railway construction company, the largest dredging company in China and the second largest dredging company (in terms of dredging capacity) in the world. The Company is also the world’s largest container crane manufacturer.\n\nCCCC, Nepal branch would be responsible for the construction of Mugling-Pokhara Highway Improvement Phase. The  objective  of the  project  is  to  widen  and  upgrade  the  road from  existing  double  lane  to  four  lane  bituminous  paved  standard to cater to increased traffic  load and provide smooth, easy and quick access eliminating existing traffic congestion and reduction in roadway accidents. The whole section of the road is rapidly being developed as urban area and forms the only major gateways to Pokhara, famous tourist center in Western Development Region."
  },
  {
    "companyName": "CloudHero",
    "logo": "https://merojob.com/media/cache/50/ca/50ca08269b91614b66e76f605ac65c50.png",
    "industry": "Software Companies",
    "about": "We help companies around the world to deliver better software, and scale faster through Containers, Kubernetes and Cloud Computing.\n\nAt CloudHero, we’re more than just the most innovativeIT consultancy. We are your trusted partners, technologists, experts and innovators.\n\nWe have hands-on expertise in implementing infrastructure-as-code,configuration, management, deploy and manage multi-cloud Kubernetes clusters, operational processes, observability and monitoring."
  },
  {
    "companyName": "Coastline Education and Visa Services",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Immigration & Education Consultancy",
    "about": "Free Counseling for the Abroad Study \n\n• complete Assistance for Admissions \n\n• Proper Guidance for Documentation \n\n• Test Preparation (IELTS/PTE)\n\n • Colleges or University Selection \n\n• VISA Interview Preparation  \n\n• VISA Application Assistance  \n\n• Accommodation Assistance\n\n• Pre Departure Briefing \n\n• Travel Arrangement"
  },
  {
    "companyName": "ContentioLab",
    "logo": "https://merojob.com/media/cache/51/c6/51c63e806517c467fde7d09dd60df016.jpg",
    "industry": "Information / Computer / Technology",
    "about": "We are a research-oriented company that specializes in writing services like content writing, ghostwriting, and technical writing. Contentio Lab is the best in the market offering high-quality services by experienced writers, experts, and professionals."
  },
  {
    "companyName": "Core Dreams Innovation",
    "logo": "https://merojob.com/media/cache/ed/89/ed8983a4beb93adc211fc6a54b1a2382.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Core Dreams Innovation PVT. LTD. is the software development and information technology (IT) company founded in 2008 with International committed Partners.\n\n\nFrom the time of establishment, we have been delivering and working on various challenging and new concept projects.\nFor continuous growth, we believe in teamwork and taking challenging projects.\nIf you are committed, dedicated and hardworking and looking for Career and Knowledge Growth, then you might be the right candidate."
  },
  {
    "companyName": "Creative Dive Education Consultancy Pvt Ltd",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Consulting / Legal",
    "about": "Study abroad USA, Australia, Canada, Uk"
  },
  {
    "companyName": "Dalit JanKalyan Yuba Club Lahan",
    "logo": "https://merojob.com/media/cache/56/47/56476ee7416fca52b576d89e176d2cdf.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Dalit Jan–Kalyan Youth Club (DJKYC) is a social development organization established in Lahan Municipality Ward No.-10 Gudigaw, formed by dalits which has been continuously implementing Dalit Empowerment campaigns after getting its legally registration in 2001 in activeness of dalit youths, DJKYC, organizing Right-based campaign programs like grouping meeting, discussion, workshop, interaction, training, opposition, slogan, rally and unviewed for social justice along public advocacy on Dalits collective issues eg. Caste-based discrimination and untouchables, mainly issues of rights and rights related to Human Rights with Dalits, poor, Women and children has been promoting through ever circulating result oriented campaign of them. In that's way, it has been circulating awareness campaign, empowerment campaign and income generating. Dalit Jan kalyan Youth club has targeted transformation of current conflict of country in peace, conflict victim women, men and children for awareness generating  campaign, skill Development training for income generating, organizing for peace through group formation and mobilization and micro-finance program. It has been affiliated in SWC (social weffare council) at 2001 and in Eastern Region Dalit NGO federation (DNF) at 2003.\n\nVision :\n\n·        Building of caste-base and gender discrimination relief social, empowerment,\n\n·        Human Rights and good governance progressive, equity society.\n\nMission :\n\n   To guard rights of Dalit, women and children and human rights through  empowering Campaign by  conflict management and skill building according  to needs in related areas/sector for establishment of social just peaceful equity society and by organizing and rising to back warded and right deprived Dalit since years poor and disadvantaged family and mobilizing pressure group.\n\nGoal :  \n\n         To promote for peace, development, social transformation and establishment of equity society along  financial enlistment by implementing saving and credit mobilization, education, awareness, human  right, social justice and skill development training.\n\nObjectives:\n\n           DJKYC has designed following objectives to achieve its own goal.\n\nF     To implement campaign against caste-base discrimination and untouchability.\n\nF     To implement Dalit empowerment program for sustainable peace.\n\nF     To advocate for social justice.\n\nF     To work needed in sectors of awareness, security of human rights, development of Republican society and good governance.\n\nF     To organize Youth, Dalit and disadvantage group women and men in equity society building for social transformation.\n\nF     To guide Dalit and disadvantage family for access incensement in resources and means and for management of reservation.\n\nF     To attempt alleviation of domestic women violence existing in society, doorway, witch custom, child marriage and Multi-marriage tradition, conservation through women empowerment group.\n\nF     To enroll Dalit, disadvantaged and conflict victim family's children participating in child class through \"Rights of all in Education\" program.\n\nF     To mobilization financial credit and saving in low interest rate implementing \"Micro-finical program\" by group for poverty alleviation in rural area and organizing stilled training of Dalit and disadvantage women group.\n\nF     To circulate result-oriented program for right of Dalit and conflict victim group according to need.\n\nProgram Implementation Strategy :\n\nF     To utilize program in community by planning with coordination of NGO, INGOs & Local stakeholders.\n\nF     To manage properly for regular evaluation Monitoring and supervision at period of implementing program with coordination of sonar organization .\n\nF     To form and mobilize group / organization for capacity building in direct participation of target community personnel's .\n\nF     To advocate in side of target community for their right adoption.\n\nF     To conduct Right – base program for access in resource and means by coordinating directly eighth beneficiaries group of community.\n\nF     To collect and mobilize regular saving for improvement of social & economical status eighth medium of group.\n\n \n\nFuture Planning for Capacity Building :\n\nF      Community, Origination and mobilization\n\nF     Ownership alienation to community.\n\nF     Affiliation of target community in group.\n\nF     To organize right base training and work shop forming network of organized groups.\n\nF     To provide equal opportunity in several activities for capacity Building of community .\n\nTarget Group :\n\nF     Dalit, Poor, Women & Children\n\nF     Conflict victim family.\n\nF    Youth and Adoleschense\n\nF    Harwa Harawa community\n\n \n\nSupervision, Monitoring and evaluation :\n\nF     By site / location visiting of target area/\n\nF     By group meeting , gathering, discussion.\n\nF     By interacting with stakeholders.\n\nF     By personal meeting & discussion.\n\nF     Evaluating outcomes through public Audit, workshop, review meeting.\n\nF     Letting evaluation & monitoring of effectiveness and transparency of program through PRRP.\n\n \n\nwho will  implement?\n\nF     stakeholders,\n\nF     Beneficiaries community,\n\nF     Member  of  Executive Board  of  organization  ,\n\nF     Representatives  of Donor Agency or organization,\n\nF     Local Agency    and Administration\n\n \n\nExperience  and working capacity  of organization  ( Shade value) :\n\nF     This organization has experience that institution   formation according to right based approach   (RBA) , networking  and campaignize programs for Dalits'  rights have  been more effectively , result -oriented   and successful. This  organization  has following functional  capacity:\n\nF     Having advocacy  training  received Human   Resource.\n\nF     Having capacity to form network and organize meeting , discussion  , interaction, workshop and so on .\n\nF     Having HR for implementing  or conducting workshop.\n\nF     Having women legal literacy training (TOT) received   resource.\n\nF      Having conflict management or transformation training (TOT) taken trainer.\n\nF     Having attendance of Micro Finance Program implementing capable resources/HR."
  },
  {
    "companyName": "Danphe Software Labs",
    "logo": "https://merojob.com/media/cache/71/83/71836e8dd49b3e57052605dabcc1156f.jpg",
    "industry": "Software Companies",
    "about": "Danphe Software Labs is an IT company based in Anamnagar, Kathmandu. We build and maintain web applications, written largely in Ruby on Rails, for clients across the globe."
  },
  {
    "companyName": "Daraz",
    "logo": "https://merojob.com/media/cache/ea/e8/eae85182b1b44978e931f9f2943f2986.jpg",
    "industry": "E-Commerce/ E-Business",
    "about": "Daraz is South Asia's leading online shopping and selling platform present in Pakistan, Bangladesh, Sri Lanka, Myanmar and Nepal. We currently operate an ecosystem of 50,000 sellers serving 10 million consumers with more than 20 million listed products.\n\nIn May 2018 Daraz was acquired by Alibaba Group, and we are proud to carry our part of the mission to 'make it easy to do business anywhere'. As part of the Alibaba ecosystem, we are leveraging Alibaba’s global leadership and experience in technology, online commerce, mobile payment and logistics to drive growth in our markets. Together with Alibaba, we are ready to empower entrepreneurs in the region and to fulfill our promise to offer our customers the best selection of products with a high level of convenience.\n\nWe currently have approximately 3,000 employees in across countries and business units."
  },
  {
    "companyName": "dazuvai online shopping",
    "logo": "https://merojob.com/media/cache/dd/8e/dd8e377636d0ffd7ecfa9f580f93bece.jpg",
    "industry": "E-Commerce/ E-Business",
    "about": "Dazuvai online shopping is a small business startup company, we work as a retail online business and others. We started our journey in 2020 as an e-commerce company and online traders."
  },
  {
    "companyName": "DCWC Community Hospital",
    "logo": "https://merojob.com/media/cache/a4/c2/a4c23fd3a373dab1ee2ef05f35b40df9.jpg",
    "industry": "Hospital / Clinic / Diagnostic Centre",
    "about": "DCWC Community Hospital lies in Nagre Gagarche, Chaurideurali - 2, Rural Municipality, Rajbash in Kavre District of Nepal. It is 15 beds Hospital and in operation since 2010. It has good number of medical staffs lead by Medical Doctor and well equipped with X-ray, Lab Facilities, Pharmacy, 24 hour Emergency, OPD and In Patient services. In addition 24/7 Ambulance Service. The extension and improvement plans are still in progress.\n\nAmong many VDCs of the Kavre district, the Nagre Gagarche VDC is one of the most remote of the district and is a junction of Sindhupalchok, Dolakha and Ramechhap districts."
  },
  {
    "companyName": "Deal Ayo",
    "logo": "https://merojob.com/media/cache/7e/44/7e440083fd6df585fe692a5fea3497fd.jpg",
    "industry": "E-Commerce/ E-Business",
    "about": "Deal Ayo Private Limited a trusted and easy to use online shopping store in Nepal that offers a surprising, and exciting, range of top quality products, at affordable prices. We provide a level of customer service that we believe is second to none. Our aim is to make Deal Ayo people's first choice when they are looking for top quality and affordable online shopping in Nepal."
  },
  {
    "companyName": "Deepdev Business Advisors",
    "logo": "https://merojob.com/media/cache/42/cc/42cc91dfef0f32d1af84e874c492f582.jpg",
    "industry": "Audit Firms / Tax Consultant",
    "about": "We are a fastest growing and dynamic Management Consulting firm specialized in Auditing, Compliances, Tax consulting, Business Advisories, Risk advisories, Process implementation and Integration, M&A, IPO services to national and international organizations in various sectors. Visit www.ddbadvisors.com.np to find out more about us."
  },
  {
    "companyName": "Dhuni Software",
    "logo": "https://merojob.com/media/cache/78/ac/78ac1a40bd3fd9c212b830d9e5e8f209.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Dhuni Software has championed technological innovation since 2019. With two global offices and a growing team of technical experts, we are providing an unparalleled innovation experience to our clients.\n\nWe are passionate about our cross-functional approach where we utilize our precision focus and unique super powers to make a dent in the universe."
  },
  {
    "companyName": "Diagonal Technologies",
    "logo": "https://merojob.com/media/cache/7d/51/7d51be312545438468847733ddbff43a.jpg",
    "industry": "Software Companies",
    "about": "Diagonal Technologies is a software company that offers mobile, web and desktop solutions with an utmost quality, established in 2018. We are bunch of enthusiasts trying to solve problems on Information technology. \n\nOur mission is to provide our customers with exactly the solution they need. Perfectly engineered solution you need, customer satisfaction is our satisfaction. Public relation is to become the most innovative and modern digital agency and reach the world. We love challenges and new ideas that challenge us every day.\n\nWe believe in the value of honesty and transparency. When our customers and we work together honestly and transparently, we always achieve great results!"
  },
  {
    "companyName": "Digital Home International",
    "logo": "https://merojob.com/media/cache/f9/46/f946e2e172cb527acdae896d07177807.jpg",
    "industry": "Business Supplies and Equipment",
    "about": "Digital Home International Pvt. Ltd. is Nepal’s first and the only SET TOP Box Manufacturing company with the largest market share in the industry and growing. Currently, the company is expanding itself to the electronics division with the aim to create a happier home. Moreover, the company's vision is to deliver the best user experience, quality and reliability with innovative products and services. Through innovation and development, we aim to exceed the expectation."
  },
  {
    "companyName": "Dream Chaser",
    "logo": "https://merojob.com/media/cache/79/5b/795b6505cc6fe91453a4fef3c222c340.png",
    "industry": "Architecture / Interior Design Firm",
    "about": "We ‘Dream Chaser‘ is the offshore company that solely open to help you to promote your Business in your Local Market. We delivery Quality Product in given deadline period . We help you in each and every aspect of your business. We have a qualified , dedicated and loyal team expertise in every field. We are very flexible experienced and understanding team so that we are very quick to acknowledge your requirement so that we would mould your product accordingly in real quick time."
  },
  {
    "companyName": "Dzango Technologies Limited",
    "logo": "https://merojob.com/media/cache/35/7d/357ddd0b31d7662827e33973e002b0a5.png",
    "industry": "Information / Computer / Technology",
    "about": "We are a boutique software engineering who specialize in building dedicated dev teams for startups."
  },
  {
    "companyName": "EBPearls",
    "logo": "https://merojob.com/media/cache/78/12/7812ee5c7575e9c67d851e001001846c.png",
    "industry": "Information / Computer / Technology",
    "about": "EB Pearls was established in 2005 and is a full service digital solution agency. EB Pearls has offices in Sydney (Australia) and Lalitpur (Nepal), and it houses around 100 staffs across all offices. We, at EB Pearls, hold expertise in website, eCommerce, and mobile applications development.\n\n\nOur values pronounce solving digital solutions regardless of complexity and quality of services and product to the highest standard.  In such, the pivot to our success is the pool of competent people who own EB Pearl’s values and exhibit strong competence on quality of services, robust business system/process, top-notch technical capabilities, and utmost client’s satisfaction. As EB Pearls is at primary growth stage, we emphasis on cost-effectiveness while taking ambitious goals to grow our business. This stimulates us toward the establishment of strategic and holistic People Operations function at EB Pearls."
  },
  {
    "companyName": "Entrepreneurs Organization Nepal",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "NGO / INGO / Development Projects",
    "about": "The Entrepreneurs’ Organization (EO) is a global, peer-to-peer network of more than 14,000+ influential business owners with 198 chapters in 61 countries. Founded in 1987, EO is the catalyst that enables leading entrepreneurs to learn and grow, leading to greater success in business and beyond."
  },
  {
    "companyName": "Executive Search- merojob",
    "logo": "https://merojob.com/media/cache/8d/67/8d678f2446654fbb2044fcac3013483c.jpg",
    "industry": "Manpower Recruitment",
    "about": "Executive Search Service of merojob specializes in recruiting best fit candidate (Usually Senior/Top level Position) for the client organization in various industries. We are also involved throughout more of the hiring process, conducting detailed interviews and presenting candidates to the client organizations selectively. Our process, involves analyzing the need of roles, screening and approaching right candidate, conduct preliminary interviews, facilitating the overall process from interview to selection.\n\nPlease be assured that your information are strictly kept confidential with merojob (Executive Search) and any details of your application shall only be shared to client only after proper consent.\n\nOn behalf of one of our client we are currently recruiting for the below mentioned position for our client industry."
  },
  {
    "companyName": "Felt and Yarn",
    "logo": "https://merojob.com/media/cache/a1/7b/a17b222fd072cd1622cc153d3164145b.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "Felt and Yarn is a proud provider of premium quality, ethically produced, and eco-friendly handcrafted felt supplies ranging from home decor, cozy shoes, novelty cat caves, rugs, yarns, and many more! Our fine quality wool is processed by hand from local sheep and meticulously dyed and felted into gorgeous and whimsical items with love, from start to finish. Whatever you need, from themed holiday decor, colorful felt balls, to natural cat and dog toys; we have the perfect felted fun for your home.\n\nOur production is centered around employing local household Nepalese women, providing them with training, fair wages, and a safe working environment, by choosing Felt and Yarn you choose to support sustainable, eco-conscious craft and make upskilling the people of our remote villages possible. Thank you, enjoy our soft, colorful products!"
  },
  {
    "companyName": "FHI 360 Nepal",
    "logo": "https://merojob.com/media/cache/c1/2f/c12faf5169ca51c63fb3189498880b83.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "FHI 360 is a nonprofit human development organization dedicated to improving lives in lasting ways by advancing integrated, locally driven solutions. Our staff includes experts in Health, Education, Nutrition, Environment, Economic Development, Civil Society, Gender, Youth, Research and Technology– creating a unique mix of capabilities to address today’s interrelated development challenges. FHI 360 serves more than 60 countries, all 50 U.S. states and all U.S. territories."
  },
  {
    "companyName": "Fiberworld Communication PVT. LTD.",
    "logo": "https://merojob.com/media/cache/42/0a/420a00b83facf30ecd1fd1e44cc82df9.png",
    "industry": "ISP",
    "about": "This company have NSP(Network service provider) and ISP(Internet service provider) lisence and it is one of the fastest growing company."
  },
  {
    "companyName": "Forward Looking",
    "logo": "https://merojob.com/media/cache/59/9d/599d44face8c2893a8dc71eb40af1fcc.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Established in 2001 the Forward Looking (FL) is the national NGO working for empowerment of persons with disability in Nepal. We champion the rights of people with disability in Nepal. The FL is non-governmental, non-profit making, non-sectarian and non-political organization working mostly in disability. The organization is run and operated jointly by people with and without disability.\n\nForward looking is looking for a Field Project Officer under Felm funded Education Support Project. Interested candidates with the following qualification and experience are encouraged to apply:"
  },
  {
    "companyName": "Friends Service Council Nepal",
    "logo": "https://merojob.com/media/cache/09/33/0933403a2c5d21316a958f04b208bea7.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Friends Service Council Nepal (FSCN) is a not - profit making non-government organization, working in the field of Disaster Risk Management and Humanitarian Response, WASH, Livelihood and Institutional Development & good governance. It is registered at District Administration Office Lalitpur in 1991 and affiliated with Social Welfare Council of Nepal."
  },
  {
    "companyName": "Fulcrum Consulting PVT. LTD.",
    "logo": "https://merojob.com/media/cache/76/01/7601b38828c5b7dce983fb2b24f9c9ec.jpg",
    "industry": "Advertising Agency",
    "about": "Fulcrum is a full-service advertising agency based in Kathmandu. We specialize in communication strategy, marketing consulting, digital marketing, and traditional advertisement."
  },
  {
    "companyName": "Garg Dental",
    "logo": "https://merojob.com/media/cache/8c/bd/8cbd9868df838c88b96ccd8e47a1b635.jpg",
    "industry": "Hospital / Clinic / Diagnostic Centre",
    "about": "Established in 1998, as an extension of the existing healthcare business since last six decades, we are importer & distributor of all dental products also involved in designing, developing, planning and upgrading treatment centers/clinics, and dental hospitals. Today we are privileged to be known as one of the leading distributors in Nepal with more than hundred reputed companies and more than 10,000 variety of products dental products in our portfolio"
  },
  {
    "companyName": "Global Explore Travels And Tours",
    "logo": "https://merojob.com/media/cache/9d/4a/9d4ad0b79ce14c716d2e32cc43cac886.jpg",
    "industry": "Travel Agents / Tour Operators",
    "about": "We are here to provide you domestic/international tickets, domestic tour packages , inbound/outbound tour packages , vehicle hire and many more. Quality service for customer satisfaction is our primary moto"
  },
  {
    "companyName": "Global Scholar Education and Visa services",
    "logo": "https://merojob.com/media/cache/da/e1/dae19f1c1ab9123c8f4f5f2c2062cef6.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Global Scholar Education and Visa Services, main motto is client satisfaction by providing quality services to reach their goal. We have a team of expert education counsellors as well as registered migration agents who have already been in this field for ages. We at Global Scholar, with an expert team, understand the client’s requirement, provide the client with proper guidance that could be from mitigating visa risk to showing the path towards Australian Permanent Residency.\n\nOur counselling strategy starts with the analysing phase where we analyse the profile of the client first and then compare their awards with the criteria set by authorities. So, we are here for clients who want to migrate to Australia. We are here for the students who are willing to study, work as well as want to settle in Australia Permanently."
  },
  {
    "companyName": "gogo20",
    "logo": "https://merojob.com/media/cache/5a/06/5a066dc7bcbfbe0f75997c7d5e10b4e6.jpg",
    "industry": "E-Commerce/ E-Business",
    "about": "gogo20 is the intersection of everyday worries and technology. We have products and solutions that impact everyone’s life and their everyday worries. We are one of the fastest-growing e-commerce companies serving Rides, Food, Shopping, and Delivery from a single app. Our main aim is to facilitate our users/customers for their everyday worries! \n\nIf you want to know more about us just browse our website gogo20.com or install our app through https://bit.ly/3282KSg.\n\nCome and become a part of our mission. \n\n#App_Ek_Kaam_Anek #Nepali_Hau_Nepal_Kai_Chalau"
  },
  {
    "companyName": "Gorkha Brewery",
    "logo": "https://merojob.com/media/cache/7b/a1/7ba18f1c854d3d0fadff3ce9fc2e07e2.jpg",
    "industry": "Manufacturing / Engineering",
    "about": "Gorkha Brewery (P) Ltd  part of the Carlsberg Group, presents an opportunity for individuals to team up with us. The extraordinary success of the company is the result of excellence in every arena and adding that extra bit every time are the talented and diverse team who work with the company. This is an invitation to people who have a passion for excellence and seek the opportunity to explore their skills.\n\nWe vision to become stronger together. Our heart lies in local power brands with our core strength being a part of Carlsberg group. #WHOWEARE #SomethingsBrewing"
  },
  {
    "companyName": "Gulmohar Educational Consultancy",
    "logo": "https://merojob.com/media/cache/ae/db/aedb86ff0387a181f551be89cd4b5b9c.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Gulmohar Educational Consultancy is one of the premiums and well cherished consultancy in Nepal. A pragmatic consultation backed with exemplary support at every stride is very critical for the success of overseas study dream and we stand for the same.\nOur vision is to set ourselves out, as the most professional, competent and authentic consultancy which gives wings to student's dreams to spread and soar high in their aspirations.\nOur mission is to be the most adorable and trusted name among our stakeholder when it comes to desire of studying abroad."
  },
  {
    "companyName": "Gurkha Welfare Trust",
    "logo": "https://merojob.com/media/cache/65/c4/65c41c0b0d1ebc28cf9781845251633c.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "The Gurkha Welfare Trust Nepal-GWT(N) is the field arm of Gurkha Welfare Trust UK, a registered charitable Trust working particularly for the ex-Gurkha Veterans and their communities across Nepal. It is a charitable institution, established and registered in the UK in 1969. GWT(N) ensures that Gurkha veterans, their widows and their wider communities are able to live their lives with dignity. We achieve this primarily through the provision of financial, medical and community aid."
  },
  {
    "companyName": "Hajurbuwa.com",
    "logo": "https://merojob.com/media/cache/64/06/64069ad6ffe2fe25df043e67a8c208ba.jpg",
    "industry": "E-Commerce/ E-Business",
    "about": "We empower small and medium enterprises. We are leading B2B e-commerce platform in Nepal providing secure, simple and easy platform for all suppliers, manufacturers, wholesalers, merchants and buyers to trade online making it beneficial for all."
  },
  {
    "companyName": "Hansikar Technologies",
    "logo": "https://merojob.com/media/cache/8a/33/8a33b5b96674cca8c98679d7a4e92593.png",
    "industry": "Information / Computer / Technology",
    "about": "Hansikar is a leading digital marketing agency established in 2018 and has served over 50 clients. We are primarily focused on designing result-driven online marketing strategies (including SMM, SEO, Ecommerce SEO, local SEO, PPC, Content Marketing, Video Marketing) for ensuring accelerated growth in client’s business and improved conversion rates. \n\nOur passionate and professional team is comprised of highly data-driven individual and creative thinkers who take both quantitative and qualitative approaches to achieve desired success.\n\n\nLearn more about us in this link."
  },
  {
    "companyName": "HD Group of Companies",
    "logo": "https://merojob.com/media/cache/3f/08/3f0814114665a22b63015ea8c6cad0e6.jpg",
    "industry": "Consumer Products / FMCG",
    "about": "HD Group of Companies is a leading conglomerate in Nepal, engaged in diversified business intervention- Manufacturing, Foreign Employment, Agriculture, Education, Healthcare,& FMCG. HD Group has been crating diversified products and services as major market player in Nepal through the Service, Medical devices, Manufacturing & Production of network across the country"
  },
  {
    "companyName": "Hetauda School of Management",
    "logo": "https://merojob.com/media/cache/5d/54/5d5474f022c80c683ba6abe4a81b0cca.jpg",
    "industry": "Education - School & Colleges",
    "about": "With the motto of \"Strict Discipline Quality Education\" Hetauda School of Management is a trusted name delivering quality education to students of Makawanpur District and nearby districts. In the long term, HSM dreams of breaking the centralized higher education structure of Nepal and give quality education at minimal cost to student outside Kathmandu Valley.\n\nAt present, HSM is running Undergraduate courses like Bachelor in Business Studies, Bachelor in Information Management, Bachelor in Computer Application and Chartered Accountancy. Likewise in Master we offer Master in Business Studies program.\n\nHetauda School of Management is looking for highly motivated individuals for the following posts:"
  },
  {
    "companyName": "Himalayan Engineering Associates",
    "logo": "https://merojob.com/media/cache/c6/62/c6629074c5bdbc22408b2dd53045544f.jpg",
    "industry": "Engineering Firms",
    "about": "Himalayan Engineering Associates Pvt. Ltd. (HEAPL) was established in 1993 with a mission of providing quality services and customer satisfaction in all kinds of construction works, engineering design, supply and application of construction materials and chemicals. HEAPL is a “Class A” contractor and a pioneer in structural repair, rehabilitation and waterproofing along with various other structural treatment works in Nepal, with a good reputation of over 28+ years."
  },
  {
    "companyName": "Himalayan Java Coffee",
    "logo": "https://merojob.com/media/cache/8e/d5/8ed54634468e78da5adab99ac3e51c5b.jpg",
    "industry": "Hotels / Resorts / Restaurant",
    "about": "Himalayan Java is the first Specialty Coffee shop in Nepal that specializes in hand crafted coffee and bakery since 1999. In its glorious years of establishment, Himalayan Java has diversified from a small individual coffee shop to an international franchising Nepalese Coffee Brand with more than 35 outlets around the world.\n\nHimalayan Java offers 100% Single Origin Nepalese Organic Coffee along with its delicious selection of breakfast, pastries, Pizzas, Sandwiches and Organic Salads. Himalayan Java believes in serving socially responsible coffee with an aim of maintaining a sustainable business ecosystem by supporting local farmers and Nepali Product, while practicing environmentally friendly coffee production methods in its company owned coffee farm located at Fikkal, Illam."
  },
  {
    "companyName": "Hitachi Energy",
    "logo": "https://merojob.com/media/cache/bf/39/bf39cae7c850043482cb57aefba5c058.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Pioneer Solutions Nepal is a wholly owned subsidiary of Hitachi Energy. Hitachi Energy is a global technology leader with a combined heritage of almost 250 years, employing around 36,000 people in 90 countries. Headquartered in Switzerland, the business serves utility, industry and infrastructure customers across the value chain, and emerging areas like sustainable mobility, smart cities, energy storage and data centers. With a proven track record, global footprint and unparalleled installed base, Hitachi Energy balances social, environmental, and economic values, and is committed to powering good for a sustainable energy future, with pioneering and digital technologies, as the partner of choice for enabling a stronger, smarter and greener grid.\n\nWe are looking for following professionals to join our Nepal Office Team."
  },
  {
    "companyName": "HLE Nepal",
    "logo": "https://merojob.com/media/cache/b8/16/b816c3df7e036f1f0b0b9f12588feb92.jpg",
    "industry": "Multinational Companies",
    "about": "Home Loan Experts is the top specialist mortgage company in Australia with rapidly growing offices in Sydney and Kathmandu. Having settled over $5 billion home loans, we are the leading financial service provider in Australia. \n\nWe exist to get tough loans approved; that's why our customer service is the best!\n\nHLE Nepal Pvt. Ltd is an extension of Home Loan Experts. Our office in Kathmandu has 400 happy and energetic team working to provide the best customer service and our team of brilliant tech team focuses on building world-class fintech products. \n\nWe believe in employee growth and offer amazing career advancement opportunities for our employees. \n\nIf you want to be part of this please visit our website https://hlenepal.com.np/\n\n**We regret that only shortlisted candidates will be contacted.**"
  },
  {
    "companyName": "Hotel Jampa",
    "logo": "https://merojob.com/media/cache/a2/5e/a25e93521c5a7049894f26743df30fd6.jpg",
    "industry": "Hotels / Resorts / Restaurant",
    "about": "Located in the heart of Thamel, Kathmandu, Hotel Jampa is a newly established (Proposed) 3 star hotel which run by a core management team with more than decades of experience in hospitality sector.\n\nCurrently, we are in lookout for result driven and career oriented Nepalese citizen to join our team under following position:"
  },
  {
    "companyName": "Hotel Marshyangdi",
    "logo": "https://merojob.com/media/cache/17/a8/17a85d1f81b4d2b861f855d6539f0cdc.jpg",
    "industry": "Hotels / Resorts / Restaurant",
    "about": "Located at the heart of City, Thamel, 25 minutes from the international airport, 10 minutes from Kathmandu Durbar Square, Freak Street and 20 minutes from The Monkey Temple, Hotel Marshyangdi, a 3 star yet an affordable hotel have been serving tourists and corporate houses with comfortable 95 rooms since more than 25 years. Despite of being in the heart of the city, Hotel Marshyangdi has a beautiful garden restaurant where guests can enjoy their leisure time with coffee and snacks. The hotel is famous for its services and the state of the art facilities. We welcome you to our hotel situated in the heart of Thamel and look forward to serving you in the future."
  },
  {
    "companyName": "Hue Shine",
    "logo": "https://merojob.com/media/cache/8a/c3/8ac3e617818469f2dad0c6ae0e44a351.png",
    "industry": "Information / Computer / Technology",
    "about": "Hue Shine Pvt. Ltd. is a design studio based in Kathmandu, regularly servicing the creative and strategic positioning requirements for a wide spectrum of commercial establishments.\n\nWe offer solutions in the areas of Logo Design, Brand & Corporate Identity, Design for Retail, Corporate & Industrial Spaces, Packaging, Visual Merchandising, Signage, Brochures, Magazines, Books, Annual Reports, Web Sites and does the occasional Advertising Campaign as well."
  },
  {
    "companyName": "Hulas Foods",
    "logo": "https://merojob.com/media/cache/11/15/111547f78aba4ae4320d882d4ea774f5.jpg",
    "industry": "Manufacturing / Engineering",
    "about": "Hulas Foods, a venture under Golchha Organization, is a leading consumer brand in Nepal, with it’s manufacturing unit in Sarlahi & Jhapa. The products distributed under the Hulas Brand are Flour, Rice, Chewda, Papad and Daal. Focused towards consumer’s taste and preferences, the company enjoys a formidable share in the consumer market under a renowned and reputed brand name, Hulas. It was founded by Late Shree Ram lal ji Golchha, a philanthropist & founder of Golchha Organization"
  },
  {
    "companyName": "iae GLOBAL NEPAL",
    "logo": "https://merojob.com/media/cache/cb/67/cb67157b9a69b3c51ae572ad922ef5e2.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Since 2013, iae Global Nepal (Dillibazar, Kathmandu) has provided quality college and university placement services (STUDY ABROAD) to Nepali students (study in: Australia, NZ, USA, Canada, EU, UK). Outside of Nepal, we are connected to an extensive education network. Inside Nepal, our local knowhow and expertise form our strengths.\n\nWe are part of the iae GLOBAL network and our number one interest is delivering great results to our students and their parents. In line with global vision and practices, iae GLOBAL provides genuine education placement guidance on a variety of STUDY ABROAD options to suit individual needs. Boasting a large portfolio of educational institutions, we offer a wide range of choices with best in class services.\n\nSince 1992, iae GLOBAL has grown to sales offices and branches or JV partner offices in major international student recruitment markets in Nepal, China, Hong Kong, India, Indonesia, Japan, Myanmar, Taiwan and Thailand. To support this global network, iae also operates on-shore offices in Australia, Canada, New Zealand, the United Kingdom, Japan and the United States of America."
  },
  {
    "companyName": "Ichiban Japanese Language Center",
    "logo": "https://merojob.com/media/cache/df/73/df739597481410e92b5e8cbd12af961e.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "This is a more than 16 years old Japanese Language School and consultancy."
  },
  {
    "companyName": "IDMC Nepal",
    "logo": "https://merojob.com/media/cache/98/44/98445a826d412cdbce5977d08909af0c.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "International Development and Marketing Company (IDMC) Pvt. Ltd. was established in 2001, and an agency house, to represent different products and process from all over the world and market in Nepal. We at IDMC are manufactures’ representatives, marketing agents, commission agent, leasion representative of large scale projects, national, international and multilateral."
  },
  {
    "companyName": "IME Travels",
    "logo": "https://merojob.com/media/cache/10/af/10afee8f72c888c9abb12b8b2039d8c8.jpg",
    "industry": "Travel Agents / Tour Operators",
    "about": "IME Travels Pvt. Ltd. is a leading travel management agency in Nepal announces a vacancy in the following post"
  },
  {
    "companyName": "IMS Health Product",
    "logo": "https://merojob.com/media/cache/bc/56/bc5601c1995f963b6de1b05bf29a288c.jpg",
    "industry": "Manufacturing / Engineering",
    "about": "IMS Health Product is a production company of Surgical mask, bouffant cap. It is situated in Jadibuti, koteshwor. It has a goal to manufacture better mask with aim of improving nepalese health from pollution."
  },
  {
    "companyName": "InfoDevelopers",
    "logo": "https://merojob.com/media/cache/5a/6a/5a6a6708bee397c9ca59b5b333865b7d.jpg",
    "industry": "Information / Computer / Technology",
    "about": "At InfoDevelopers, we continuously work to ensure that our services are maintained at the highest possible level of reliability and satisfaction. We are not successful until every customer start achieving return on their investments from reduced production costs and streamlined processes. InfoDevelopers provides innovative, quality, cost effective IT Services and Software solutions for business process automation and re-engineering. Established in 2002 AD, the Company has been promoted and managed by professionals having long working experience in banking and IT sectors. We have 150 staff members who are currently working with us."
  },
  {
    "companyName": "International Genesis Technology Nepal",
    "logo": "https://merojob.com/media/cache/ab/b6/abb6f92b363708cc2d23e3e464753f21.jpg",
    "industry": "Telecommunication",
    "about": "International Genesis Technology Nepal Pvt. Ltd, is a leading Telecom Services Provider Company in Nepal offering services and solutions to address the Network Life Cycle requirements of Telecom Operators, Technology providers (OEM’s) and Tower Companies.\n\niGenesis is Contributing in the Vision of Digital & Brighter Nepal by Contributing to the Telecom Industry through Excellent Construction Building Capabilities & Expertise in Electrical, Power & Solar."
  },
  {
    "companyName": "IT Computer Trade",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Education - School & Colleges",
    "about": "Computer Teacher"
  },
  {
    "companyName": "ITONICS Nepal",
    "logo": "https://merojob.com/media/cache/c7/c2/c7c25e32f0748f8216370b056ba83e37.png",
    "industry": "Information / Computer / Technology",
    "about": "Empowering Everybody to Innovate\n\nOur data-driven innovation software platform helps organizations around the globe to identify emerging technologies, trends, and market potentials and translate them into powerful growth strategies.\n\nWorld's Leading Platform for AI-Powered Strategy & Innovation\n\nITONICS is a leading SaaS provider of systematic innovation management. Together with our clients, we shape the future. Our AI-powered platform combined with a systematic framework to steer innovation efforts helps companies to identify emerging technologies, trends and market potential and to translate them into customized growth strategies.\nWorking with global teams to innovate new products, services, and business models, ITONICS professional services inspire, guide, and accompany organizations on their innovation journey. With more than 125 experts on five continents, we support innovation leaders such as adidas, AUDI, BMW, CISCO, Intel, Johnson & Johnson, KPMG and SAP."
  },
  {
    "companyName": "Jagaran Media Center (JMC)",
    "logo": "https://merojob.com/media/cache/dc/07/dc07694e66b3f83f88b4ae5a777a60f3.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Jagaran Media Center (JMC) is a non-governmental organization established in 2000 by journalists from the Dalit community in Nepal. The Organization advocates eliminating caste-based discrimination, promoting a more equitable, inclusive and accountable democracy, promoting environmental justice and sustainable disaster risk reduction through media mobilization. Jagaran Media Center (JMC) is registered at District Administration Office (DAO), kathmandu on 8/12/2057 ( 21st March, 2001). The Registration Number is 813/057/058 (DAO-Kathmandu) and is affiliated with Social Welfare Council (Affiliation Number 13180). It is also registered with the Inland Revenue Department with PAN number 302016077."
  },
  {
    "companyName": "Jaruwa Nepal",
    "logo": "https://merojob.com/media/cache/3b/fe/3bfea9ace7c76c993161965270932b92.jpg",
    "industry": "Software Companies",
    "about": "Jaruwa Nepal Private Limited is a trust worthy company with a corporate package of graphic designing, branding, printing, mobile application development and web site development solutions to our valuable Clients. We've provided high quality graphic design and web development solutions to satisfied clients across the country."
  },
  {
    "companyName": "Kalin Tech Pvt Ltd",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "BPO / Call Center / ITES",
    "about": "Kalin Tech is a BPO service provider which specializes on service like e-commerce,  call centre,, network operation centre and other IT Enabled Services. We are focused on serving our clients based in USA, Australia and Israel."
  },
  {
    "companyName": "Kantipur Holidays",
    "logo": "https://merojob.com/media/cache/d5/03/d503e5cda0765151d9aaee8133732777.jpg",
    "industry": "Travel Agents / Tour Operators",
    "about": "Kantipur Holidays is an online travel distribution company established to facilitate our customers with extensive services to plan a perfect solution to an exquisite holiday destination. Through our services you can effortlessly devise your holiday in any location, within the best possible price ranges. As a leading travels and tours firm within Nepal, we assure the ultimate solution to our customers' itinerary, no matter how exclusive they are. We are driven by a zealot and industrious professional team along with an exhaustively maintained IT structure. We are committed to assist our clients with smart travel choices, offering peculiar holiday packages and extensive hotel list at your desired destination within competitive prices. It is our earnest motive to make your trips convenient and memorable."
  },
  {
    "companyName": "Khalti Digital Wallet",
    "logo": "https://merojob.com/media/cache/32/27/3227642d60ceadc3a94c418c71ea9609.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Khalti is a mobile wallet, payment gateway & service provider in Nepal. Launched in January 2017, Khalti is one of the leading online payment solution in Nepal. It allows users to pay for a range of services like basic utility payments, hotel bookings, movie and domestic flight tickets, events and many more. It is operated and owned by Sparrow Pay Pvt. Ltd. \n\nWe offer payment solution to over hundreds of merchants across Nepal and provide seamless payments using ebanking, smart banking, cards, and wallet. Being not just limited to mobile app users, Khalti has more than 8000 POS and Agent Network providing Khalti services to end users.\n\nKhalti is home to some of the brightest minds in the country, which includes a team of highly skilled developers and interactive marketers. Our solution-oriented approach makes us reliable for any and all kind of service you might require from Khalti with the best user experience possible.\n\nOur goal is to simplify lives of people by bringing financial inclusivity to every individual in Nepal and take the payment industry from offline to online through best practices."
  },
  {
    "companyName": "Khantze & Co.",
    "logo": "https://merojob.com/media/cache/d2/95/d295adb0b6ce912b7c85aafae51fc9bd.jpg",
    "industry": "Garments / Carpet Industries",
    "about": "Top 10 Carpet Manufacturer and Exporter."
  },
  {
    "companyName": "Learning Highway Institute and Consultancy services",
    "logo": "https://merojob.com/media/cache/3e/fc/3efc0c395c6c8cc724ed5653e8812b23.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Learning Highway Consultancy Services is enriched with the experience of over 11 years in the international education domain. It is playing a significant role in helping students study in preeminent international universities in the course of their choice. We have our registered office in Canada as well. We at Learning Highway are looking for a marketing person in Nepal who can promote our business in Nepal.\n\n \n\nThe Candidate must be a minimum graduate in any field. \nThe candidate must be fluent in the local as well as the English language. \nOne year of experience in the sales and marketing field.\n\nFull-time job.\n\nThe candidate will be paid a handsome salary."
  },
  {
    "companyName": "Lucky International",
    "logo": "https://merojob.com/media/cache/ee/6d/ee6db0ba0134d58ce063128c03559b0c.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "Lucky International is the Authorized representative of Borouge Pte. Mainly dealing with polymers."
  },
  {
    "companyName": "Magical Media Studio",
    "logo": "https://merojob.com/media/cache/3e/83/3e838deb1059cf968d81ed39295f9831.jpg",
    "industry": "Media / Publication (Newspaper, Magazines)",
    "about": "Magical Media Studio is a startup digital media and internet company based in the United States that focuses on creating and distributing digital content useful in everyday life.\n\n\nOur goal is to create educational, creative, and entertaining content.\n\nWe serve a wide range of verticals through our networks, including technology, business, travel, art, lifestyle, expat updates, and other areas."
  },
  {
    "companyName": "Makalu Holidays",
    "logo": "https://merojob.com/media/cache/3a/39/3a39c287a5492502ec86b6058d115dcb.jpg",
    "industry": "Travel Agents / Tour Operators",
    "about": "Makalu Holidays is a one-stop travel company in Nepal providing wide range of destinations for the holiday seekers, honeymooners, business professionals, adventure lovers, families etc."
  },
  {
    "companyName": "Master Himalaya Treks & Expedition",
    "logo": "https://merojob.com/media/cache/dd/9f/dd9f8fbf5ca9caf3c18be5d8dadb5ff1.jpg",
    "industry": "Travel Agents / Tour Operators",
    "about": "Master Himalaya is an well established company in tourism industry of Nepal. It is a company owned by experienced personals of Nepal tourism who has been in this industry for decades.\n\nOne of the leading, Travel & Trekking Company in Nepal is seeking for smart and dynamic applicants to the following position. Interested candidates are requested to send your resume."
  },
  {
    "companyName": "Mate's Education Pvt. Ltd",
    "logo": "https://merojob.com/media/cache/e0/5f/e05fe95a8bc2d0c4b41bd90063e38742.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "MATES Education trading as MATES International, an Education consulting firm that has thrived with its experience for 14 years in this competitive market, provides you with most reliable free counseling on study and career including visa services. We believe that one decision can change your entire life and we want to make sure that decision is never wrong. \n\nWe understand that choosing the right pathway for your migration outcome, or right course, the right educational institute, preparing academic documents and financial documents can be stressful and time consuming.  Our goal is to make this experience as easy and as stress free as possible by delivering consistent quality service in accordance to the changing dynamics.\n\nMATES\n\nM – Methodical\n\nA – Approachable\n\nT – Trustworthy\n\nE – Efficient\n\nS – Service oriented"
  },
  {
    "companyName": "Max Lagence",
    "logo": "https://merojob.com/media/cache/a8/96/a89688a7016873587ffa4193915748e2.jpg",
    "industry": "Advertising Agency",
    "about": "L'agence is a 360 degree advertising agency and provides creative marketing solutions to some of the most sought-after clientele in Nepal. Our reach and scope of work is unlimited and so should be your commitment - to deliver.\n\nWe are on the look-out for people who understand that being the best does not come on a plate with a silver spoon, but is achieved by the long, brutal working hours.\n\nOur continuous expansion and increased clientele demand that we open up more vacancies."
  },
  {
    "companyName": "Medic",
    "logo": "https://merojob.com/media/cache/5f/2b/5f2b4d3c35cb757a8081f7720d988abf.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Medic builds mobile and web tools for health workers, helping them provide better care that reaches everyone. Operating as a unique, nonprofit technology company, we develop free and open-source tools that can be adapted for specific uses, backed by evidence. Health workers currently use Medic Mobile to register every pregnancy, immunize infants against illnesses, track disease outbreaks faster, keep stock of essential medicines, and communicate about emergencies. Medic Mobile has worked with over 60 partners across 23 countries in Africa, Asia, Latin America, and the US. Based in San Francisco with regional offices in Africa and Asia, our technology supports over 24,000 frontline health workers, improving health systems for over 12 million people.\n\nMedic is growing! We have an opening for the following position and would like to invite applications from qualified candidates."
  },
  {
    "companyName": "Merit Nepal Educational Services",
    "logo": "https://merojob.com/media/cache/43/f2/43f2528b08543152b369a12c0af73132.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Merit Nepal is a educational consultancy focused in Australia processing. We have our HO in Australia. We provide both onshore and offshore student services."
  },
  {
    "companyName": "Millsberry School",
    "logo": "https://merojob.com/media/cache/7e/9a/7e9af2dddc512e2fcb191cf122956cf8.jpg",
    "industry": "Education - School & Colleges",
    "about": "The Millsberry School is a successful family of leading co-educational School providing an outstanding educational experience for students aged 6-18. Millsberry, the Secondary School, is one of the Kathmandu’s leading co-educational day schools; Millsberry international Pre-schools, are a day pre-school for pupils aged 2 to 6, which are situated in five different locations of Kathmandu valley, established in 2004.\n\nAt MBS all aspects of our educational processes are carefully designed to cultivate and stimulate the intellectual, social, and personal development of the most important stakeholders at this institution; the students.\n\nOur students learn the International level curriculum in corporate with Nepal Govt. curriculum, in separate streams. As we are here to serve a global community, we assist internationally-mobile families in making a smooth transfer to any school system or graduate to universities world-wide."
  },
  {
    "companyName": "NAAMII",
    "logo": "https://merojob.com/media/cache/92/78/9278e2a133da3496a972d3aa500a944d.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "What, Why & How of NAAMII in a podcast here.\n\nNAAMII is a leading research institute in Nepal working in Artificial Intelligence (AI), Applied Maths, Informatics, and their applications in a broad range of fields related to society, such as healthcare. NAAMII’s vision is to be a world-class centre of excellence in Nepal that continuously betters people’s lives locally and globally. We aim to build strong research and higher education foundation in informatics, applied mathematics, and AI in Nepal. We have been conducting high-quality research, organizing the international Nepal Winter School in AI that has attracted participants from over 20 countries, and supporting industries in Nepal and abroad with our scientific expertise. Our three main divisions, Research, Education-Outreach, and Industry-Innovation, all work towards building a vibrant research & innovation ecosystem in Nepal and contribute to democratizing AI globally."
  },
  {
    "companyName": "Ncell",
    "logo": "https://merojob.com/media/cache/a5/ab/a5abcccce075669f88c0911d076d0747.jpg",
    "industry": "Telecommunication",
    "about": "Ncell Axiata Limited (Ncell) is a part of the Axiata Group Berhad, one of Asia’s leading telecommunication groups.\n\nAxiata has controlling stakes in market-leading mobile and fixed operators in the region including 'Celcom' in Malaysia, 'XL' in Indonesia, 'Dialog' in Sri Lanka, 'Robi' in Bangladesh, 'Smart' in Cambodia, and 'Ncell' in Nepal. Axiata is actively spearheading efforts to transform its mobile-centric operations into digital converged companies.\n\nAt Ncell, we are passionate about our values, principles, and our strategic priorities. We believe that having the right talent in the right roles enables execution, improves our customer’s experience, and delivers breakthrough results. This is what makes us a winning team.\n\nAt Ncell, we lay much emphasis on our corporate values: Uncompromising Integrity, Exceptional Performance, Customer at our Heart, Breakthrough Innovation, and One Company - One Family. These values are the most integral part of our business. We carry out our daily business by keeping these values in mind as we, as an organization strongly stand for it.\n\n\nApplicants must have the highest ethical standards, strong leadership skills, excellent judgment, a sense of personal initiative, and problem-solving abilities.\n\nNcell offers a competitive package that is designed to make you feel an integral part of the team and directly involved in the company's success.\n\nNcell is also committed to protecting Applicants' personal data. In Ncell, we take privacy seriously and all our activities are underpinned by our T.R.U.S.T principles of being Transparent, respecting your Rights, in our Use of personal data, through robust cyber Security practices and we take due care when Transfer of data is required. Click the link to know more about applicants privacy https://webapi.ncell.axiata.com/upload/Notice/Ncell_Axiata_Privacy_Notice_for_Candidates.pdf"
  },
  {
    "companyName": "Neoteric Nepal",
    "logo": "https://merojob.com/media/cache/27/8e/278eaf34fb2d5bf60d2068f545434f08.jpg",
    "industry": "Distribution Companies / Wholesale",
    "about": "Neoteric Nepal is a value added distribution company involved in Information, Communication and Entertainment Technologies (ICET). IT is one of the oldest companies involved in the ICET distribution in Nepal and boasts itself as one of the leading companies in terms of revenue, experience and reputation.\n\nNeoteric Nepal is a fully owned company of Golchha organization. Golchha Organization is the oldest business organization in Nepal with over 100 years of legacy in a wide range of legacy businesses. The Golchha Organization is a US$ 225 Million company employing 15,000 people. During its 100 years history it initiated industrialization in the country and was a key promoter of foreign trade relations. It is active in Agro-business, steel and engineering, consumer products manufacturing, trade, insurance and banking, information technology and more, including philanthropic charities"
  },
  {
    "companyName": "Nepal Council of Arbitration",
    "logo": "https://merojob.com/media/cache/e4/7a/e47aef83e91290464a80b4c1409f251b.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Nepal Council of Arbitration \"NEPCA\" founded in 1991 is an autonomous and non-profitable organization, established to administer arbitration and other alternative methods of dispute resolution in an expeditious and less expensive manner by arranging co-operation from the concerned sector."
  },
  {
    "companyName": "Nepal Digital Payments Company Limited",
    "logo": "https://merojob.com/media/cache/cb/99/cb997801e6ffdb36398b0a9d5653fe4a.jpg",
    "industry": "E-Commerce/ E-Business",
    "about": "Nepal Digital Payments Company Limited (NDPC) is a public company established by the joint investment of Nepal Doorsanchar Company Limited (Nepal Telecom) and Rastriya Banijya Bank Limited. The Company has been incorporated with an aim to operate mobile financial services to provide cashless payment services to people across Nepal and thus help improve financial inclusion and realize the national goal of digital society. The company shall provide easy, affordable and comprehensive digital mobile financial services to both banked and unbanked masses across the nation, thereby helping create a cashless society."
  },
  {
    "companyName": "Nepal Health Sector Support Programme",
    "logo": "https://merojob.com/media/cache/73/1e/731ed63132c01a628a71955b8e134437.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Nepal Health Sector Support Programme (NHSSP) is a technical assistance programme to the Government of Nepal’s Ministry of Health and Population (MoHP), funded with UKaid. The programme is a technical component of the UK’s support to the MoHP under the Nepal Health Sector Programme-3. It is designed to support the goals of Nepal Health Sector Strategy (2015/16-2020/21) and contribute to the MoHP’s efforts to provide quality health services leaving no-one behind. The programme has been running from April 2017 and will continue until December 2022 to cover the overarching priorities of Health System Strengthening at Subnational Level. It is implemented by a consortium that is led by Options Consultancy Limited, with HERD International and Oxford Policy Management."
  },
  {
    "companyName": "Nest Construction and Engineering",
    "logo": "https://merojob.com/media/cache/7d/51/7d511a52088ca6c9759d7325ded50091.jpg",
    "industry": "Construction Material and Equipment",
    "about": "Nest Construction Company and CLC block manufacturer is looking for qualified candidates for following position."
  },
  {
    "companyName": "New Business Age",
    "logo": "https://merojob.com/media/cache/9e/ea/9eeac47de027b6bb60d6e4995a1101c6.jpg",
    "industry": "Media / Publication (Newspaper, Magazines)",
    "about": "New Business Age Pvt. Ltd is a well-established media house of Nepal (set up in year 2001), which has been publishing, since 2001, New Business Age, an English Monthly and since 2005, Aarthik Abhiyan, a Nepali National Business Daily. Their websites are www.newbusinessage.com and www.abhiyandaily.com."
  },
  {
    "companyName": "Newspaper Posting",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Advertising Agency",
    "about": "-"
  },
  {
    "companyName": "New York Global Consultants Inc. (NYGCI)",
    "logo": "https://merojob.com/media/cache/48/5a/485aba209eb33746565dd179d4ced7b4.jpg",
    "industry": "Consulting / Legal",
    "about": "New York Global Consultants Inc. (NYGCI) is an innovative technology services provider. Our major capabilities include IT Consulting, Data Protection Services and Application Performance Management services. We transform, build and operate IT infrastructure and business processes on behalf of clients to help improve their productivity and performance. Our team harnesses the power of technology to drive innovation, deliver cutting-edge solutions and increase productivity.\n\nEstablished in 2007, we provide Information Technology solutions and services to medium and large enterprises in USA, Canada, Brazil, Europe, Africa, UAE, India, Singapore, Malaysia, Philippines, Japan, China, Hong Kong, Australia, and New Zealand markets. nygci.com"
  },
  {
    "companyName": "NIBC Educational Foundation",
    "logo": "https://merojob.com/media/cache/2a/da/2adaa96d0a77179847931e895e5205d4.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "NIBC Educational Foundation is one of the leading educational consultancies in Nepal, which empowers thousands of Nepalese students to make right career and college/university decision. Our vision is to be the go-to career, test preparation selection & college/ university selection platform, for students considering higher education abroad.\n\nWe are looking for self-driven, result-oriented professional individuals for the following position:"
  },
  {
    "companyName": "NIDAN Hospital",
    "logo": "https://merojob.com/media/cache/c3/75/c3756993c21c0699ef6f4b12725b98b2.jpg",
    "industry": "Hospital / Clinic / Diagnostic Centre",
    "about": "Nidan Hospital is a conceptual product of a group of talented doctors and managerial team. The team is committed to put in their expertise in providing not only the better health services to the patient but also a better hospital management services to the patient. With a motto of “Hospital with difference” Nidan Hospital team has focused its services on ,subspecialty services, mainly in Nephrology, Urology, Endocrinology and now establishing country’s first Gastroenterology service with complete gastro solutions."
  },
  {
    "companyName": "NIKA",
    "logo": "https://merojob.com/media/cache/ef/84/ef84252290aafd0ce850693ad696d3df.png",
    "industry": "Retail / Shops",
    "about": "children clothing made in nepal"
  },
  {
    "companyName": "NYEF- Nepalese Young Entrepreneurs' Forum",
    "logo": "https://merojob.com/media/cache/14/3e/143e4c9b98701fa110862e57f9819b67.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Nepalese Young Entrepreneurs' Forum (NYEF) is an apex body of young entrepreneurs in Nepal. It is a membership based non-profit organization, established with a vision to become the most influential community of young entrepreneurs in Nepal. It aims at creating outstanding entrepreneurs through idea exchange, fellowships, education, training and advocacy among the Nepali youth. The forum was officially instituted by the Federation of Nepalese Chambers of Commerce and Industries (FNCCI) on September 26, 2003. NYEF is also one of the founding members of the SAARC Young Entrepreneurs Forum (SYEF), Association of Youth Organization Nepal (AYON) and the World Young Entrepreneurs Forum (WYEF) and a member of the Confederation of Asia Pacific Chamber of Commerce and Industry (CACCI) Committee on Youth Entrepreneurship. It is currently the Vice President of Young Entrepreneurs Group Asia Pacific (YEGAP) consisting of 29 member countries of CACCI and is the President of SAARC Young Entrepreneurs Forum (SYEF). NYEF is also an invitee member in Commonwealth-Asia Alliance of Young Entrepreneurs (CAAYE)."
  },
  {
    "companyName": "Okhati Solutions",
    "logo": "https://merojob.com/media/cache/d5/60/d560e3d9c1fb84faef2b351e53847580.png",
    "industry": "Software Companies",
    "about": "Okhati Solution is a legally established company in Nepal with its office in Teku, Kathmandu. The operations of the company spans to different parts of the world including Nepal, Finland, and India. Okhati was initiated by 4 Nepali individuals who live in Finland working in renowned IT & software companies for more than 10 years. They have dedicated most of their life in helping to integrate digital systems in various health organizations there and now have brought back their knowledge and expertise in to their home-country to introduce state of the art technology in Nepal.\n\nThe company currently employs 15 staffs in its head office in Kathmandu, Helsinki (Finland) and Mumbai (India). \n\nProduct/ Service: \n\nOkhati App is a web based software that serves health institutions and health service providers likewise. Its functions include easy recording of patient data and medical history into a cloud-based system, appointment management system, time and resource management for health facilities as well as doctors, facilitating reporting systems, and other various features of a general electronic medical recording system."
  },
  {
    "companyName": "Option Educational Consultancy",
    "logo": "https://merojob.com/media/cache/9f/67/9f67b2f53956e9e1b8ac76ebf6c3b29b.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Option is an organization created for the purpose of assisting students in furthering their education abroad. Option Consultancy qualified and trained staff in order to provide clients with reliable and timely services. Option is commenced with the objective of helping the students to get enrolled in various colleges and universities of abroad like Australia ,Canada, UK ,USA, , and many other countries; to assist the students making the right educational decisions, and helping them to gain admission in suitable courses in recognized universities.\n\nOur experienced and qualified counselors provide the students the up-to-date information about the colleges and universities. They suggest the students about programs (courses), colleges / universities, application deadline, documents requires and others. We help the students by facilitating with airport pick up and accommodation while going abroad for study."
  },
  {
    "companyName": "Pacific Engineering Co.",
    "logo": "https://merojob.com/media/cache/a6/a1/a6a17822bb99e42f8caff0a16b4d3ddf.jpg",
    "industry": "Construction / Real Estate",
    "about": "The Company was established as a private limited Company in 1981 under the government of Nepal. It has been established with the aim of providing construction works services in the field of roads, highways, bridges, Airport, irrigation, water supply, river training, hydropower, electrical transmission and distribution lines, tunnels, building and industrial complex.\n\nThe company is highly committed to continuously upgrading its performance to keep pace with the emerging needs of the nations and ultimately achieve people’s satisfaction. The company recognizes that its success comes from and is attributed to its engineers and staff. Without their commitment, ingenuity, and hard work, Company would not be the success story it is today or the company we are striving to be tomorrow.\n\nThe company normally takes up works independently and sometimes it also works as a Partner in a joint venture.\n\nSince the establishment of the company, it has successfully completed different contracts such as highway, village roads, canal, drainage, structures, buildings, irrigations, bridges, etc. We are proud to deliver projects that shape our communities and strengthen our nation’s infrastructure."
  },
  {
    "companyName": "Pantum Nepal",
    "logo": "https://merojob.com/media/cache/41/b4/41b44635dbf7699b8dce6efa46a15d26.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "Pantum is an international Brand that develops, manufactures, and sells laser printers and toner cartridges that are made in China for worldwide clients. Partum’s branded laser printers have advanced core technologies and provided users with reliable, cost-effective, and ecologically friendly printing solutions. The company includes a mission to provide users with solid, cost-effective, and ecologically friendly printing solutions.\n\nPantum is a new brand that has shown significant progress in the printing industry and market penetration around the world in a very short period. Pantum printers are currently marketed and distributed in China, the USA, Europe, Middle East, South Africa and spread over 40 countries and regions. Pantum sales branch companies and service centers have been set up in China, the USA, and Europe.\n\nPantum goal is to be the driving worldwide supplier of printing a solid solution, fetched successfully and naturally neighborly. We are always growing and idealizing our item line, which contains a single function, multifunction, and high-speed duplex printing. Printers are focused towards the government, enterprise, hospital, banking, SMB, SOHO users and so on. Our goal is to give rise to a New Era for Printing."
  },
  {
    "companyName": "Paperline Enterprises",
    "logo": "https://merojob.com/media/cache/64/80/648037c9b6e46c94b8c9eb9174c70855.jpg",
    "industry": "Packaging and Containers",
    "about": "Paperline Enterprises has been in the paper packaging business since 1985. We are located in Yangal, Kathmandu (Near Basantapur ). We deal with paper material  for packaging ."
  },
  {
    "companyName": "Paragon Public School",
    "logo": "https://merojob.com/media/cache/ec/20/ec203ca9ce5de3af9100944cd6a0918a.jpg",
    "industry": "Education - School & Colleges",
    "about": "Paragon Public School was established in the year 1994 in Battisputali, Kathmandu with 57 students and 15 staff members. In the year 2003 with the vision of providing quality education at an affordable cost by using modern pedagogies in the state-of-the art infrastructure facilities Paragon shifted to a permanent location beside the banks of Bagmati River . \n\n\nWe are a school with a vision, aimed at creating citizens of a global community. The emphasis is on a stimulating, happy learning environment where a child's talents can be nuturned in fulfillment. We opt to provide holistic education in which children are prepared to face any crisis in life with moral dignity and become loyal citizens of the country. With Honesty and Loyalty deeply embedded in our heart we encourage innovative learning through different academic and non-academic activities.\n\nSchool Website"
  },
  {
    "companyName": "Parkview Education Consultancy",
    "logo": "https://merojob.com/media/cache/8c/6c/8c6c04bfe3a74344444440c8cc448e2d.jpg",
    "industry": "Education - School & Colleges",
    "about": "Parkview  Education Consultancy Pvt. Ltd Was Established on 28 June 2018 with The Objectives to Provide comprehensive  Educational services to the prospective Nepalese students  Intend To Study  Abroad. The Number of Students Intending  To Study Abroad For Quality Education Has Been Increasing, and it is Responsibility Of Education Agents For Providing Factual Information and Genuine Guidance To The Aspiring Students  For Right Education At Right Institution .Only This Can Fulfill Ambitions Of The Students Helping Them To Achieve The Desired career Goals. Our Prime Objects Is To Ensure That Our Students and Clients Are Given The Best Opportunity To Lay a Solid Foundation For Their Future Careers.\n\nParkview Education Consultancy’s Main Activities Concentrate In Assisting Students To Make The Right Choice With Regard To Pursuing Education In Educational Institutions Abroad and Providing Students With All The Pre-requisites For This Purpose Such As IELTS and TOEFL Preparation Classes .Apart From This Park-view Educational Consultancy Also Provides Guidance For Visa Applications.\n\nOur Well Experienced Counselors Are Update With The Information Regarding Study Abroad Procedures and Opportunities . They  Are Dedicated To Provide Genuine Information in Selecting Right Course and Institution .We Look After Our Clients Right From Application and Admission Process To Visa Application Documentation . In Addition, We Impart Pre-departure Information Like Accommodation, Work Opportunities, Climate and Other Relevant Matters.\n\nIt’s An Important Matter That People Come Different Education Background and May Have Different Needs and Concerns Hence We Listen To Everyone Attentively. Our Well Experienced and Dedicated Counselors As Well As Team Members Are Always At Hands To Ensure That We Give The Best Possible Advice and Guidance To Our Students and Clients Throughout Their Contacts With Park-view . Overall, Our Aim Is To Provide The Highest Standard Of Personal Services To Our Clients.\n\nThough A New Established Company, Our Team Has Well Experienced Members Having Long Time Experience Of Education Counseling and Students Recruitment Activities. Our Team Acquires In Depth Knowledge Of Application and Admission Procedures, Financial  Requirements and Visa Application Procedures  Of Respective Countries.\n\nSince Our Core Objectives Is To Assist The Students For Education Abroad ,We Ever Wish To Work With Esteemed Institutions From Different Countries so That Our Students Would Have More Options To choses The Right Course/Program Of Their Interests At Right Place. We Are Committed and Dedicated To Impart Genuine and Quality Services To The Institutions We Represent."
  },
  {
    "companyName": "Parth International",
    "logo": "https://merojob.com/media/cache/dd/15/dd156ba1234d7d148134254dc7e676a3.jpg",
    "industry": "Steel and Furniture",
    "about": "Incorporated in 2009 Parth International is one of the leading Industrial Raw Material, Furniture & marketing organizations in Nepal today, providing Raw Materials solutions to Paint , Rubber & Ink & Plastic Industries.We are also Providing Complete Office Furniture Solutions , Warehousing & Retail Racking Solutions , Laboratory & Modular OT Solution to the Nepalese market. Strong base through Direct offices in 4 Districts of Nepal strategically Located in North , South East and West Zones. With the specialized team we are able to cement the character of unparalleled achievement and practice of going further in customer satisfaction. The steadfast team of Parth is mounting on an elevated pace and had realized just about growth only in the year of 2011; ensures the trail of promising as one of the fastest growing Chemical & Raw Material trading companies in the region. At Parth International, we are committed to building great brands. We follow shared values, principles and behaviors to provide high quality and great products in a responsible manner"
  },
  {
    "companyName": "Pioneer Trade Concern",
    "logo": "https://merojob.com/media/cache/57/b6/57b675cc2a05ad9329e9a058c0d198c5.jpg",
    "industry": "Retail / Shops",
    "about": "We are a leading Business House responsible for getting International fashion to Nepal since last 15 years. We are the Authorized Franchise Partner for International Brands such as:\n\nPeter England: India's leading men’s wear brand\nPuma: German Sports Wear Brand\nMeters/bonwe: Leading Casual Wear brand from Shanghai\nVan Heusen: Premium Formal Wear Brand from USA\n\nWe believe that building a strong relationship between a brand and their customers’ needs continuous hard work over the period of time."
  },
  {
    "companyName": "Plantation Initiative Nepal",
    "logo": "https://merojob.com/media/cache/6d/f7/6df7f51b1764a675cd61ef2508ba307a.png",
    "industry": "NGO / INGO / Development Projects",
    "about": "Plantation Initiative Nepal is a non-profit NGO registered with the District Administration Office, Lalitpur and recognized by the Social Welfare Council which was established in the year 2075 B.S. In the short period of its establishment, it has made significant contribution in the field of forest rehabilitation and upliftment of local livelihood. This program is working with special priority on women, poor and backward classes. This organization has laid the foundation for sustainable forest management and conservation of endangered wildlife habitats through tree planting. We have been working in coordination with the local community, local bodies, and concerned governments, including the Sherpas of the Himalayas, the Chepangs of the Central Hills, and the Tharu communities of the Terai. At present, we are implementing programs in 15 districts of Nepal from East Jhapa to West Kalikot.\n\nMISSION:\n\nTo offer the dignity of fair employment to people living in impoverished communities, who become transformational agents of global forest restoration.\n\nVISION:\n\nCreating livelihoods for millions of people living in extreme poverty by empowering them to restore and protect forests on a massive scale."
  },
  {
    "companyName": "Platforms Hub",
    "logo": "https://merojob.com/media/cache/94/2b/942b4b74f95b679cbcc77e8d01406572.png",
    "industry": "Information / Computer / Technology",
    "about": "Platforms Hub is an IT Company dedicated to provide IT Infrastructure Solutions to our Customers. We provide the solution from leading brands who has the strong market presence and successful case study globally.\n\nProduct offered by us is genuine, cost efficient,  and reliable. We are the team dedicated for efficient deployment of the IT Infrastructure in order to meet our customer's business goals and objectives. Our team is ready in every step to guide customer through the technology they need to make their business operation smooth."
  },
  {
    "companyName": "Prabal Group of companies",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Construction / Real Estate",
    "about": "Housing \n\nReal state\n\nconstruction material \n\ninterior"
  },
  {
    "companyName": "Premier International School",
    "logo": "https://merojob.com/media/cache/1c/e6/1ce6a88e55e3f2b0d061120cb2e0e36c.jpg",
    "industry": "Education - School & Colleges",
    "about": "Premier International IB Continuum School was instituted in the year 2065 B.S. on demand of the parents to extend the good school culture that the proprietors had been successful in delivering through their preschools, and to fulfill the demand of quality elementary as well as high school in the capital. The school since then is committed in preparing global citizens of tomorrow. Starting off with 31 students, now Premier International IB Continuum School has more than 600 students, and the number increases every year as it upgrades a class each year."
  },
  {
    "companyName": "Pushpanjali Distributors Pvt. Ltd.",
    "logo": "https://merojob.com/media/cache/f6/c4/f6c4cdb4b4c158e1cb0b0992a08c41ef.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "We are a full-service import and distribution company, active for the past 22 years in Nepal. We currently are national distributors for multiple companies including Bikaji, Kangaro and Doms,"
  },
  {
    "companyName": "Ramraj Engineering",
    "logo": "https://merojob.com/media/cache/86/97/8697b0d94b079175ebd40eee8c793da6.jpg",
    "industry": "Telecommunication",
    "about": "Ram Raj Engineering Pvt. Ltd (Founded in 2004) is One of the leading player in the field of Telecom Service Industry.\n\nUnderstand the complete process of Planning, Implementation, O&M & HR outsourcing of Telecom.\n\nVast experience and flexible delivery models enable us to deliver solutions for business support and transformation to our clients \n\nDomain specific technology experts and deliver high quality solutions at optimal cost\n\nWe are having offices in India, Nepal & Ghana and plan to penetrate in Bhutan, Bangladesh and other Countries.\n\nRecognized by all the major telecom Equipment companies and Telecom Operators."
  },
  {
    "companyName": "Reliance Life Insurance",
    "logo": "https://merojob.com/media/cache/f9/ac/f9ac1b6fb704cdd953bf1bf87b5d551e.jpg",
    "industry": "Insurance Companies",
    "about": "Reliance Life Insurance Company is promoted by the eminent business and industrial houses including one of the leading commercial bank in the country and has wide network of 122 branches throughout the country. In a short span of its operation, the Company has established itself as a recognized and prominent brand in the market with innovative products & quality service and operated by the highly professional team."
  },
  {
    "companyName": "Reliance Trade Link",
    "logo": "https://merojob.com/media/cache/1c/eb/1ceb72ade8511174fd2d27a047d18f86.jpg",
    "industry": "Construction Material and Equipment",
    "about": "Reliance Trade Link is seeking to recruit a dedicated and qualified candidate for following positiopn:"
  },
  {
    "companyName": "Rukmani International",
    "logo": "https://merojob.com/media/cache/cb/87/cb8723b6665721bb01352ad4c0a9a586.jpg",
    "industry": "Manufacturing / Engineering",
    "about": "Established in 1992 with a vision to transform the Luxury Bathroom segment of Nepal, Rukmani International was established as a representative of European and Asian Luxury Manufacturers. Rukmani Group has today become the fastest growing manufacturing, trading and industrial company in Nepal, involved in the trading of building material like bathroom fixtures and fitting, tiles and other materials, representing over 40 of the World’s leading brands in the segment, including Roca, Laufen and Grohe among others."
  },
  {
    "companyName": "Rupakot Resort",
    "logo": "https://merojob.com/media/cache/30/1a/301a4a6aca954136859e2fd074022238.png",
    "industry": "Hotels / Resorts / Restaurant",
    "about": "With more than 7 years of experience in hospitality along with expertise from Europe, we at Rupakot Resort aim to become the top luxury brand within the hospitality sector in Nepal. We aspire to build an organization that empowers all its people and enables them to grow together with the organization.\n\nThe nature surrounding Rupakot with its spectacular views, in combination with our distinguished hospitality is the reasons our guests like to visit Rupakot Resort."
  },
  {
    "companyName": "Saathi",
    "logo": "https://merojob.com/media/cache/af/0a/af0a664db151634c3d6a2fc9998e9872.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Saathi, an apolitical and non-governmental organization, has long been crusading against gender-based violence in Nepal. It has been working for the safety, security and empowerment of violence survivor women and girls since its establishment in 1992. As an organization committed to the elimination of all forms of violence meted about against women and girls in the country, it focuses on tackling trafficking, unsafe migration, child marriage, domestic violence and sexual and gender-based violence. The organization is also running the interventions in addressing internal trafficking of the young children and girls, specially in the adult entertainment sector. Saathi is now going to implement Supporting Children, Adolescents and Youth At Risk Of And Survivors Of Exploitation. In Nepal (UTTHAN)” under the auspices of The World Education Inc (WEI). The project aims to reach out and provide protection services, including psychosocial counselling and training for the children trafficked internally and children in exploitative child labor such as in the adult entertainment sector. The project will build the capacity of the children at risk and survivors providing them with educational, life skills or vocational trainings. Therefore, Saathi invites application from interested and able candidates for the following posts for the project mentioned above"
  },
  {
    "companyName": "Sagar Distillery",
    "logo": "https://merojob.com/media/cache/f2/9f/f29f8913d59e53d8a3b0c7b12755c27e.jpg",
    "industry": "Manufacturing / Engineering",
    "about": "Sagar Distillery Pvt. Ltd. Established in 2014, is modern hard drink blending and bottling unit, manufacturing high-grade Nepal made Foreign Liquors like Vodka, Whiskey, etc. Every product is carefully crafted and with a commitment to deliver on the consumer experience. \n\nAt the heart of our company, Sagar Distillery is guided by a set of principles that shapes the company high performance culture and the way we do business, our key strategies and partnerships, and the future of our growth. We are deeply passionate about creating and building brands that people love and value, in a responsible way."
  },
  {
    "companyName": "Sagarmatha Secondary School",
    "logo": "https://merojob.com/media/cache/30/90/3090e3ad02dbc0eda7acb3d781d315fe.jpg",
    "industry": "Education - School & Colleges",
    "about": "Sagarmatha Secondary School established since 1965 is located at Chailsa, Solududhkunda municipality in Solukhumbu district. For many years the school has been providing quality education to village children with modern facilities and conducive environment."
  },
  {
    "companyName": "Sajilo Sewa",
    "logo": "https://merojob.com/media/cache/b5/6d/b56d21ddd72557f13b0aab23a8f82c6e.jpg",
    "industry": "E-Commerce/ E-Business",
    "about": "Sajilo Sewa is a one stop maintenance solution to all the daily needs for the household and corporate houses."
  },
  {
    "companyName": "Sanima Hydro",
    "logo": "https://merojob.com/media/cache/c8/a7/c8a766b92c76df34cfa70ecc37815143.jpg",
    "industry": "Hydropower / Alternate Energy",
    "about": "Sanima Hydro is a leading Hydropower Company in Nepal with a team of highly qualified experts and engineers who are involved in projects since preliminary study till complete construction and operation of HydroPower plants. We are currently looking for:"
  },
  {
    "companyName": "Scott Wilson Nepal",
    "logo": "https://merojob.com/media/cache/de/64/de64accbae4b42afc8d6bb416e59957c.jpg",
    "industry": "Research Firms",
    "about": "Scott Wilson Nepal is an engineering and development consulting firm, leading Nepal’s development and infrastructure landscape since 2000. We work with a wide range of clients, including the Government of Nepal and international governments, I/NGOs, intergovernmental organizations, private corporations and bilateral and multilateral donors to solve complex development challenges.\n\nWe are trusted professionals – engineers, consultants, designers and program managers, delivering expert services spanning across infrastructure, climate and renewable energy, education, food security and agriculture, urban and rural development, governance, gender equality and inclusion, WASH and disaster management. For over two decades, our clients have depended on us to provide the engineering advice, evidence-backed solutions and independent analysis they have needed to overcome their most pressing obstacles.\n\nWe encourage potential applicants to visit www.swnepal.com.np for more details on our team, location, and our services."
  },
  {
    "companyName": "SeeLogic International",
    "logo": "https://merojob.com/media/cache/de/92/de92beb2f8b377661cb675da226048f9.jpg",
    "industry": "Software Companies",
    "about": "SeeLogic LTD is an award-winning CRM consultancy that specializes in supplying, deploying and supporting CRM solutions either on-premises or in the cloud. SeeLogic is one of the leading Microsoft Gold CRM partners, as well as a highly respected Microsoft Gold, Authorised Education Partner. We consult on Business Process Mapping, SharePoint, Office 365, Data Migration and Digital Transformation. For our clients, this means we provide exemplary advice and support on a wide range of services. For our staff, it means we provide experience and training, grounded in all systems and with multiple methodologies. At SeeLogic we take great pride in our values, and our team is the heart of our organization."
  },
  {
    "companyName": "Shangri-La Development Association",
    "logo": "https://merojob.com/media/cache/dd/41/dd41d92faa113ab34af5b1a955fe5c77.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Shangri-La Development Association (SDA) is a team of young energetic professionals coming from varied academic and vocational discipline – Humanities, Management, Health, Agriculture, Engineering, Science and Law. It is a non-profit non-government organization founded by the youths on 10th November 2014, which became partner of GA/SA formally on 1st December 2014. It has been working for the improvement of the lives of Deaf children in Jumla and Chepang community through integrated activities in Health, Education and Agriculture."
  },
  {
    "companyName": "Shikhar Himalayan Security",
    "logo": "https://merojob.com/media/cache/18/21/182151b62320eda7adcc05175e5267e9.jpg",
    "industry": "Security Service Company",
    "about": "Shikhar Himalayan security service Pvt. Ltd was established in 2058 B.S/2001A.D with experienced personnel and struggled to reach our height with several competitors. It’s our sheer pride to stand as the first security service providing company in the Bhaktapur district. Shikhar Himalayan security service Pvt. ltd is a guard supplying organization that intends to provide full-fledged security according to your workspace. Our motto is “Safety and Security”."
  },
  {
    "companyName": "Shikhar Organization Limited",
    "logo": "https://merojob.com/media/cache/be/ad/beade33eb8f2d4019f9653d91b652e3f.png",
    "industry": "Information / Computer / Technology",
    "about": "Techno Dawn started with a vision of becoming a center of excellence in multiple fields mainly including Advertising, HR Support, IT Support, Web and Application development. The key drivers to our success are dedication, trust and innovative approach. Needless to say, client satisfaction is our forte and keep the client interest foremost on our roster."
  },
  {
    "companyName": "Shree Steels Private Limited",
    "logo": "https://merojob.com/media/cache/5a/cc/5accbf01b15f9ab3dae8ed17589e9565.jpg",
    "industry": "Manufacturing / Engineering",
    "about": "Manufacturing Company"
  },
  {
    "companyName": "Shristi Academy",
    "logo": "https://merojob.com/media/cache/d0/40/d0407adaf956ffffa07ff7ab64163c54.jpg",
    "industry": "Education - School & Colleges",
    "about": "Shristi Academy is an organic school where every student is nurtured and  thrives to their highest potential."
  },
  {
    "companyName": "SK Technology",
    "logo": "https://merojob.com/media/cache/cc/8b/cc8bc27d7439bca8ab5d04c0f88b59e9.png",
    "industry": "Software Companies",
    "about": "SK Technology strives to create strong and well-guided communities in a select group of verticals. We operate one of the largest user-centric communities online with over 1.25 million members throughout our communities today, and continued growth into the future."
  },
  {
    "companyName": "Skytouch Biomed",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Pharmaceuticals / Healthcare",
    "about": "Skytouch Biomed Pvt Ltd. is a pioneering trading and manufacturing company established 5 years ago. Skytouch Biomed is a young and dynamic company specializing in importing medical equipment, consumables and supplies. Skytouch Biomed has been manufacturing and supplying covid essentials such as Face Shields, Fabric PPE etc"
  },
  {
    "companyName": "Smart Data Solution",
    "logo": "https://merojob.com/media/cache/7a/0a/7a0a4e229bfac2d7b4149d2f61b18c16.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Smart Data Solutions(SDS) is Minnesota (US) based healthcare workflow automation company with its SDS software development Nepal.\n\nSDS has been managing 450 million healthcare claims transactions annually for over 19 years.\n\nWe specialize in providing US healthcare payers and networks with front-end medical claims processing services and EDI solutions to expedite and streamline operations."
  },
  {
    "companyName": "Smart Kids Kindergarten",
    "logo": "https://merojob.com/media/cache/7f/46/7f46a02cc59a9c469955bde73a1b8d0c.jpg",
    "industry": "Education - School & Colleges",
    "about": "Montessori-based preschool was established with the motto of providing education with an effective playful method by creating a homely environment for the kids.\n\nA healthy mind can learn fast and remember for a long. Good food for the sound health of the kids is our main focal point.\n\nHaving ample space for the run and play during the leisure time. \nHygenic food.\nFull sunlight and open classrooms\nHomely environment.\nCaring and lovely teachers."
  },
  {
    "companyName": "SMEC International Nepal",
    "logo": "https://merojob.com/media/cache/21/0c/210ce5ec7e5afcf45bc63356ded20b29.jpg",
    "industry": "Engineering Firms",
    "about": "SMEC International Pty. Ltd. is a professional service firm with Australian origins and global footprints that provides high-quality Consultancy services for major infrastructure projects. Working in more than 40 countries all around the South Asia and Central Asia, SMEC aligns local knowledge with global expertise to address the needs of its diverse client base and has delivered thousands of projects in more than 100 countries including Nepal."
  },
  {
    "companyName": "Sneha's Care",
    "logo": "https://merojob.com/media/cache/0b/4a/0b4a60154142b7dc97796dcb77292e0a.png",
    "industry": "NGO / INGO / Development Projects",
    "about": "Sneha’s Care is one of the largest leading animal welfare charities in Nepal. Since its inception in 2014, animal advocate Ms. Sneha Shrestha and the team has been working to protect, and rescue the street animals and community dogs from torture, cruelty, or any form of abuse. And, treat the severely injured furry friends and street animals and shelter them until their recovery. Sneha’s Care has managed a full-time veterinary doctor and the staff to provide professional medical and humane care to the injured, sick, and abandoned dogs and other street animals in its animal shelter and also in the spot, through mobile treatment. Recently, Sneha’s Care is operating the animal sanctuary where numbers of cows, pigs, and buffaloes are rescued and looked after. \n\n\nWe firmly believe that in the actions of individuals, businesses, and governments, all forms of animal exploitation including factory farming should not be acted. Sneha’s Care is continuously campaigning and attempting to introduce animal welfare law in Nepal for improved safeguards for animals and penalties for animal abuse and cruelty. We are also actively spreading animal welfare awareness on a national scale and educating the public to be compassionate to all non-humans."
  },
  {
    "companyName": "Soani Tech Nepal",
    "logo": "https://merojob.com/media/cache/23/5d/235d1e367e82f53408874d8be8279726.jpg",
    "industry": "Software Companies",
    "about": "We are a team of Computer Engineers and Developers from different parts of Nepal, who are always eager to work on new technologies and present users with innovative products. SoAni Tech was established with the vision to digitalize what we have and to develop Software and e-Books for every person.\n\nSoAni Tech, an abbreviation for Software and Animation Technologies, is a professional software development company. Using the cutting edge technologies for software development, mobile apps and websites, we make sure our products run in every widely used gadget and browser."
  },
  {
    "companyName": "Subis Poultry Marketing P. Ltd",
    "logo": "https://merojob.com/media/cache/31/d9/31d9da0dc7c4bce9328afeb0b4ad067b.png",
    "industry": "Poultry / Dairy / Veterinary",
    "about": "Subis Poultry Marketing is a combined entity of two prestigious commercial layer egg producers including Subis Poultry Pvt. Ltd and Kathmandu Poultry Pvt. Ltd. Handling the distribution of approximately 200,000 eggs per day, we are focused on distributing fresh and quality ensured table eggs to our wholesale as well as retail partners."
  },
  {
    "companyName": "Sukalpa International",
    "logo": "https://merojob.com/media/cache/a2/8a/a28a1476b54c677152f6cbaba93e0bf1.jpg",
    "industry": "Training Institutes",
    "about": "Sukalpa is a 'Skill Provider for a Knowledge Economy'​ and Employer’s First Choice! Sukalpa believes three trends as a key driver underpinning industry-wide transformation which needs to be proactively incorporated into their workforce, culture, and strategy:\n\n• The changing nature and expectations of professional buyers\n\n• The opportunities offered by new technologies\n\n• Enhanced levels of globalization and competition"
  },
  {
    "companyName": "Sunam Infrastructure Nirman Pvt Ltd",
    "logo": "https://merojob.com/media/cache/b4/41/b4412a8731ddca6172e3df04d5ce2764.jpg",
    "industry": "Construction / Real Estate",
    "about": "Hydro Constrcuction Company"
  },
  {
    "companyName": "Sunaulo Parivar Nepal (SPN)",
    "logo": "https://merojob.com/media/cache/d1/52/d15229bcb61711d3b291a2d286535832.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "Sunaulo Parivar Nepal (SPN), a local implementing partner of Marie Stopes International in Nepal, is a well-established NGO which is delivering Family Planning and Sexual Reproductive Health services through‐out Nepal via different service delivery channels: centres and Marie Stopes (MS) Ladies. It works in partnership with Marie Stopes International UK (MSI), a global charity for providing reproductive health services across the world with a mission of ensuring individual’s fundamental right to have children by choice not chance.\n\nWe are looking for qualified and competent candidates for the following position:"
  },
  {
    "companyName": "Sunil Chapain & Associates",
    "logo": "https://merojob.com/media/cache/5e/dc/5edcc7237ba64acf848e376bf0c50e59.jpg",
    "industry": "Audit Firms / Tax Consultant",
    "about": "We are growing audit, account and tax firm covering diverse area of expertise."
  },
  {
    "companyName": "Susankya Tech",
    "logo": "https://merojob.com/media/cache/77/cf/77cfa1ca6fe486552e88c11c4690058b.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Susankya Tech Pvt. Ltd. is an IT & Software company established in early 2016 with just a team of four. Over the last years, it has been successful in establishing a client network of more than 150 clients with a growth rate of over 200% in the last year alone. Currently, the team boasts of 20+ members with main offices at Kupondole, Lalitpur.\n\nSusankya Tech has been primarily, but not limited to, active in the field of Education and Management. With signature products such as School Valley and Consultancy Manager it has helped play a role to change the way education is perceived in the country.\n\nSusankya Tech is trusted by big names such as Emami Ltd. (Indian conglomerate), Vibrant MBBS Entrance Preparation, and ECAN (Educational Consultancies Association of Nepal)."
  },
  {
    "companyName": "TAMARIND GROUP OF COMPANIES",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Banquet / Catering",
    "about": "Group of companies that provides the best services in food and beverage industry."
  },
  {
    "companyName": "Tech Central",
    "logo": "https://merojob.com/media/cache/36/ba/36ba25fa15aa03cae2f2e046e7a00b64.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Tech Central is a global firm with a diverse portfolio of online brands and more than 20 years of expertise in digital media and online marketing. And we're on the lookout for talented digital media professionals, creative authors, and topic experts to join us in our goal to share information that changes the world for the better."
  },
  {
    "companyName": "Teqmint Innovations",
    "logo": "https://merojob.com/media/cache/37/65/37654c4586ffbefdd1edabe564cdf1a5.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Teqmint Innovations is a leading IT solutions provider. We are the official sales partner of Nepal for Gravitas based in the London, UK which is a visionary and a reliable partner serving world-class brands who provide Enterprise-grade AI solutions. We are a boutique digital transformation consultancy and software development company that provides cutting edge engineering solutions.We focus on improving employee productivity and enhancing customer experience. Our team is a mix of accomplished technology and management experts supported by experienced senior executives. We work with businesses of various sizes and have experience of working in multiple sectors. Our key strength is our problem solving skills, which is reflected in our world class products and services. We strive for continuous innovation and have developed rapidly evolving and ready to market efficient, low maintenance, highly intelligent solutions with high degree of customization.intelligent solutions with high degree of customization. We focus on growing customer expectations with market-shaping AI, Blockchain, SAP solutions along with web and App development for Enterprise and SME customers along with Self- optimizing systems."
  },
  {
    "companyName": "Thakral One Nepal",
    "logo": "https://merojob.com/media/cache/5b/21/5b21a21711055d5e909516219052df21.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "We are a reputed multinational technology consulting and services company focused on core business applications, banking solutions, digital technologies and data analytics.\n\nWe are focused on building consulting and delivery capabilities around leading global technologies. We draw on our specialized functional, technical and industry experts and our data scientists to design methodologies, optimize processes and infuse global know-how into each unique engagement."
  },
  {
    "companyName": "Thakur International",
    "logo": "https://merojob.com/media/cache/43/65/4365046a171f3e700ede9b42298d1b69.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Thakur International is a reflection of our initial idea that connects three major hoops: the environment, the information technology, and the business. The anticipation of the future and its pessimistic visualization was a reason for us to input the efforts in order to clear the fog from our home planet future’s outlook and present the idea of this company’s officialization. From the moment it has officially established, in 2013, the company showed the potential to grow and to go outside of the Nepal’s borders. We are aware that we have the supporters all around the world: even if they don’t have a direct contribution to this company, their silence is a proof of the acceptance and support."
  },
  {
    "companyName": "The Crazy Studio",
    "logo": "https://merojob.com/media/cache/6b/17/6b177e0eb28cd01c985897c52d9ff9b1.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Who are we:\n\nWe are a bunch of accomplished storytellers founded in the year 2015. At The Crazy Studio, we believe in expressing client stories with passion, emotion, and devotion. We help our clients to get the exposure that they need over the web.\n\nWe partner with our clients to create their digital presence mainly through the following services:\n\nBranding and identity\nWebsites\nGraphic and print design\nSocial media marketing (SMM)\nEmail Marketing\nSearch Engine Optimization (SEO)\nAs a company, we aim to be involved in your everyday dosage of viral contents to some of your most astounding work. \n\nWorking with us, you will be taking care of clients' emotionally rooted values and transforming them into something beautiful. \n\n\nYou will be working with many companies to give them the mileage they deserve."
  },
  {
    "companyName": "The Soaltee Kathmandu",
    "logo": "https://merojob.com/media/cache/55/aa/55aadae69972bf91bb1db8650e59fbc8.jpg",
    "industry": "Hotels / Resorts / Restaurant",
    "about": "An exceptional blend of royal and traditional elegance, The Soaltee Kathmandu - Soaltee Nepal’s premier 5 Star Deluxe hotel is set in lush green 12 acres of landscaped area with a magnificent view of the Himalayas. It’s located in peaceful Tahachal just 8km from the Tribhuvan International Airport and 4km from the city center its finest shopping destinations, cultural attractions, and entertainment options in Kathmandu. While staying at this 5-star hotel in Kathmandu, you enjoy a range of prime amenities. Gaze up at the mountains while you float in the pool or unwind with one of our rejuvenating therapies at the Tranquility Spa, the largest in the city."
  },
  {
    "companyName": "Thread Garment",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Manufacturing / Engineering",
    "about": "Textile Production Manager Job Description:\n\nThe production manager is a very important person for both in textile and apparel manufacturing industry.  Because he is responsible for the execution of all production work of converting inputs into outputs as per Apparel buyer’s instructions and thus making value additions. He delivers goods on a designated shipment date. He is responsible for cutting, sewing, finishing, and maintenance sections and works through the different heads of the departments of the readymade apparel factory.  He generally reports to the apparel manufacturing CEO or a general manager for his duties.\n\n \n\nResponsibility of Production Manager in Apparel and Textile industry:\n\nA production manager generally performs the following tasks:\n\n1.    The production manager receives the order plan and order sheet from the senior authorities.\n\n2.    He will prepare textile and apparel production plans weekly, monthly, and quarterly basis.\n\n3.    He will receive material status against each order and will monitor the progress of material received.\n\n4.    He will receive an approved sample, swatch card against the order sheet.\n\n5.    He ensures that apparel production lines are properly balanced for target output.\n\n6.    He coordinates with the quality manager so that defective or faulty goods are not produced.\n\n7.    He provides job assignments to supervisors and other subordinates.\n\n8.    He ensures that the floor, machinery, dining spaces is neat and clean.\n\n9.    He ensures that all work stations are properly illuminated.\n\n10. He will arrange for continuous training of helpers and operators.\n\n11. He will have a pre-production sample prepared and compared with the originally approved sample.\n\n12. He ensures to pursue the right works, quality, and maintenance standards.\n\n13. He ensures that materials are organized at each stage of processing.\n\n14. He ensures that a congenial atmosphere exists on the floor.\n\n15. He makes the right evaluation of the performance of his subordinates.\n\n16. He arranged for proper documentation of all the activities on the floor.\n\n17. The production manager will make arrangements for the right line layout or machine layout.\n\n18. As a leader, he inspires unites employees for better works, better motivation.\n\n19. He ensures that all the machinery is equipped with protective devices.\n\n20. He organizes pre-production meetings or pre-production activities to discuss related issues.\n\n21. He will approve the commencement of production against a work order.\n\n22. He monitors the progress of production against the production plan.\n\n23. He takes countermeasures if the progress of textile or apparel production is not satisfactory.\n\n24. The production manager coordinates with all the concerns so that clothing or textile production progresses as per plan.\n\n25. He is responsible for ensuring discipline on the floor.\n\n26. He takes care of the worker’s safety and welfare.\n\n27. He makes the best efforts to create a congenial work environment which is called a “win-win situation”."
  },
  {
    "companyName": "TO THE NEW",
    "logo": "https://merojob.com/media/cache/8d/49/8d49c614b2b72dde89f6bb0227f782df.jpg",
    "industry": "Information / Computer / Technology",
    "about": "TO THE NEW (TTN) is a technology services company that designs, builds, & runs digital products and platforms for Fortune 500 companies, enterprises, SaaS, and consumer tech companies. We are recognized by global analyst firms like Gartner, Everest, ISG, and Zinnov for our capabilities in Digital Engineering, Cloud, and Data & Analytics. We have deep expertise in Experience design, Open source technologies across Web, Mobility, CMS, diverse Cloud infrastructures, DevOps, Big data & analytics, Quality, and test automation; combined with proven experience in Agile methodologies.\n\nFounded in 2008, TTN is one of the fastest-growing companies with a growth rate of over 60% since 2017. Our passionate team of 2000+ “Newers” is spread across our delivery centers in Delhi, Dubai, NYC, and Sydney. TO THE NEW been a consistent winner of the prestigious ‘Great Place to Work’ award since 2015 and ranked #47 in the ‘Top 100 companies in India to Work’ for 2019. Recently TTN was also recognized as one of the ‘Top 25 India’s best IT & IT-BPM workplaces’.\n\nWe take pride in our culture driven by a passion for making an impact through technology and is backed by our emphasis on learning and development."
  },
  {
    "companyName": "Troika International",
    "logo": "https://merojob.com/media/cache/e5/fa/e5fa7fe9f9448fc0c176dd27a576f7d2.jpg",
    "industry": "Trading - Export / Import / Merchandising",
    "about": "We are an established trading and import company mainly dealing with medical equipments, surgical goods, and bio-technology products catering mostly to health and hospital segments of Nepal for more than 12 years in the medical field.\n\n We have a vision to promote and distribute such essential surgical/medical products of today's need of high quality, yet of reasonable cost with better service and support to the medical institutions/hospitals in Nepal."
  },
  {
    "companyName": "UNFPA Nepal",
    "logo": "https://merojob.com/media/cache/83/dd/83dde201869ce8edfddf4fcf3aec0289.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "UNFPA, the United Nations Population Fund, is a voluntary-funded international organization with a presence in over 150 countries, including Nepal. UNFPA is guided by the Programme of Action of the 1994 Cairo International Conference on Population and Development (ICPD) and the Sustainable Development Goals. Its mission is to ensure that every pregnancy is wanted, every childbirth is safe and every young person’s potential is fulfilled.\n\nThe work of UNFPA is based on the premise that all human beings are entitled to equal rights and protections. We focus on women and young people because these are groups whose ability to exercise their right to sexual and reproductive health is often compromised. Our work is informed by an understanding of population dynamics, human rights and cultural sensitivity.\n\nUNFPA in Nepal\n\nUNFPA support to Nepal began in 1971 and has evolved in response to the changing national contexts. The current 8th Country Programme (2018-2022) is in line with Sustainable Development Goals, ICPD Programme of Action, the UN Development Assistance Framework (UNDAF) for Nepal and national priorities set by the Government of Nepal.   \n\nUNFPA partners with the Government of Nepal, youth and women’s organizations and development partners to advance its mission. Under the 8th Country Programme and in line with its mandate, UNFPA Nepal is working around the following areas:\n\nSexual and reproductive health and rights: UNFPA is supporting national efforts in Nepal to improve the sexual and reproductive health of the most marginalized adolescent girls and women. The Fund is largely focusing on youth aged 15-24 and the most marginalized women addressing both the demand and supply sides of reproductive health services to improve access to information and services on maternal health, family planning, and sexually transmitted infections, including HIV.\n\nGender equality: UNFPA’s support to the Government of Nepal under this overarching theme seeks to ensure that vulnerable groups experience greater self-confidence, respect and dignity. We are building national capacity in the health sector to address gender-based violence (GBV), prevent child marriage and other harmful practices, and working to enhance the knowledge and capacity of men, women and communities to GBV.\n\nAdolescents and youth: Investing in young people, especially the vulnerable and the marginalized, is a priority for UNFPA Nepal. The country has a large adolescent and youth population. Nepal is experiencing a demographic window of opportunity, a ‘youth bulge’. Nepali youth face several development challenges, including access to education, employment, gender inequality, child marriage, youth-friendly health services and adolescent pregnancy. Yet, with investments in their participation and leadership, young people can transform the social and economic fortunes of the country. UNFPA Nepal works with the government and partners to advocate for adolescents and youth’s rights and investments, including education, livelihood skills and health, including sexual and reproductive health.\n \n\nPopulation dynamics: Population megatrends at the national and sub-national levels in Nepal continued rapid population growth, population aging, urbanization and migration — not only frame the entire development debate, they demand a reconsideration and re-conceptualization of what will be the main challenges for a new Nepal. Without an adequate understanding of how Nepal is changing from a demographic perspective, forward-looking planning and agenda setting will be of little value. Keeping this in mind, UNFPA Nepal is working with the government to ensure that national, sectoral and decentralized policies and plans address population dynamics and the interlinkages with gender equality, poverty reduction, the needs of young people, and reproductive health, including family planning."
  },
  {
    "companyName": "United Academy",
    "logo": "https://merojob.com/media/cache/a5/78/a578e7cf3655b342bb73783aacc88539.jpg",
    "industry": "Education - School & Colleges",
    "about": "United Academy follows scientific teaching techniques, enabling students to approach their subjects with curiosity and keen insight. It is committed to bring out the best in students and strongly believes that good education is linked with discipline so that it becomes an integral part of their life. Efficient management at UA creates a congenial atmosphere for quality education. It also provides its own annual academic calendar before the start of the new academic session."
  },
  {
    "companyName": "Vaishno Medisales",
    "logo": "https://merojob.com/media/cache/8b/e1/8be1ae2055d5f5f336e40c29ff6e2445.jpg",
    "industry": "Distribution Companies / Wholesale",
    "about": "Vaisho Medisales is a leading company engaged in sales, distribution and after-sales service of ophthalmic equipment in Nepal with a salogan, \"One stop for complete ophthalmic requirement\". Since 2010 we are leading distributor of Ophthalmic equipment like: Phaco and Vitreoretinal machines, Optical Coherence Tomography(OCT), Operating Microscopes, Dry Eye Machine, Ophthalmic Simulator, Ophthalmic Lasers, Slit lamps, Ultrasound AB-scan units, Lensometer, Keratometer, Ophthalmoscopes, Retinoscopes, etc. dealing with major brands such as: Oertli, Heidelberg, Leica, Oculus, Lightmed, Accutome, & many more products launched recently such as HOYA premium IOL in Nepal.\n\nCurrently we are looking for candidates for the following positions:"
  },
  {
    "companyName": "VAJRATECH",
    "logo": "https://merojob.com/media/cache/f3/50/f3504541a8ae0b14f6f21569cf7d5f14.png",
    "industry": "Software Companies",
    "about": "VAJRATECH is an IT company focused on driving innovation and developing high performance utilities and tools for solving real world problems. Besides conventional website development for businesses, the company specializes on developing AI integrated solutions and applications that require complex business or mathematical models.\n\n\nThe company emphasizes on learning and staying up to date with the latest technological advancements for production."
  },
  {
    "companyName": "Varun Beverages Nepal",
    "logo": "https://merojob.com/media/cache/3f/19/3f19f2d045c9de5c8b90f9063c6edcf7.jpg",
    "industry": "Multinational Companies",
    "about": "Varun Beverages (Nepal) the second largest franchisee in the world (outside US) of carbonated soft drinks (“CSDs”) and non-carbonated beverages (“NCBs”) sold under trademarks owned by PepsiCo and a key player in the beverage industry. We produce and distribute a wide range of CSDs, as well as a large selection of NCBs, including packaged drinking water. PepsiCo CSD brands sold by us include Pepsi, Diet Pepsi, Seven-Up, Mirinda Orange, Mirinda Lemon, Mountain Dew, Seven-Up Nimbooz Masala Soda, Evervess Soda, Duke’s Soda and Sting"
  },
  {
    "companyName": "VRock & Company",
    "logo": "https://merojob.com/media/cache/40/01/4001391ff624d664f28e552c8d3e2461.png",
    "industry": "NGO / INGO / Development Projects",
    "about": "VRock & Company (VRock) focuses on consulting and advisory work in the field of infrastructure development, project management, financial services and organizational leadership. The organization is strategically oriented to propel ideas to implementation, removing bottlenecks and addressing problems for tangible outcomes. With decades of empirical and pragmatic experience in our collective arsenal, we strive to solve real and diverse set of problems, stimulating value creation for sustained growth across both private and public sector organizations.\n\nWe draw on our team’s extensive experience in developing appropriate policy and frameworks aimed at actual delivering of infrastructure projects. We have driven institutional reforms by enhancing organizational capacity and introducing innovative ways of doing business across Nepal’s three tier governments.  Our work on alternative financing sources for infrastructure has helped subnational governments explore non-traditional budgetary sources, for fuelling development needs and driving critical reforms. \n\nCollectively, we offer over 50 years of cumulative team experience, of which 30 years are Nepal based spanning across the public, development and private sectors. The team’s achievements underpin our ability to deliver on VRock’s area of expertise, ensuring certainty through informed decision making in an otherwise unpredictable and volatile environment. \n\nVRock & Company is registered as a private limited company in Nepal."
  },
  {
    "companyName": "VSK Engineering Company",
    "logo": "https://merojob.com/media/cache/44/a1/44a19fe552a8c73c082dfde06141f506.png",
    "industry": "Manufacturing / Engineering",
    "about": "No overview found."
  },
  {
    "companyName": "WaterAid Nepal",
    "logo": "https://merojob.com/media/cache/68/55/68553060e1244b92533219fe500283d9.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "WaterAid is an international not-for-profit, determined to make clean water, decent toilets and good hygiene normal for everyone, everywhere within a generation. Since we started in 1981, we have remained resolutely focused on tackling these three essentials that transform people’s lives. Without all three, people cannot live dignified, healthy lives. With all three, they can unlock their potential, break free from poverty, and change their lives for good. Children grow up healthy and strong, women and men get to earn a living, whole communities start to thrive. It sounds normal and it should be. \n\nBy inspiring people and sparking chain reactions we help deliver lasting change in what’s normal. By working closely with partners internationally and on the ground in some of the toughest places in the world, we help achieve widespread change. Millions of people have already taken control of their lives and built better futures.\n\n WaterAid Nepal seeks to recruit a dynamic, self-motivated and compassionate individual to champion WASH in various roles, playing a vital role in our mission to transform lives with safe water, sanitation and hygiene essential foundations for healthy and dignified lives."
  },
  {
    "companyName": "Water Communication",
    "logo": "https://merojob.com/media/cache/da/76/da7619b531ba6453ed147bad31b02194.jpg",
    "industry": "Public Relation and Communication",
    "about": "We are a 15 years old design management company working with over 300+ satisfied clients across various industries including airline, automobile, hospitality, tourism, real estate, pharmaceutical, tourism, health, environment, education and SME enterprises. We apply our passionate team's varied skill sets in strategic thinking and creative design on various brand platform. By engaging your customers and partners, we make sure your brand stand out and speak up. www.water-comm.com"
  },
  {
    "companyName": "Web Creation Nepal",
    "logo": "https://merojob.com/media/cache/43/e4/43e4cc1c2a74633f06e90d68e7481ea4.jpg",
    "industry": "Information / Computer / Technology",
    "about": "Web Creation Nepal is a well-established IT company – a trusted brand for its efficient and first-class services to a diverse range of clients in Nepal and worldwide. Since its establishment in 2011, we have been providing creative, secure, bug-free and winning web design and mobile apps development services at reasonable costs to our clients. Enjoy the fullest!\n\nWe give you the best returns on your investment. Guaranteed!"
  },
  {
    "companyName": "WhiteHat Engineering Inc.",
    "logo": "https://merojob.com/media/cache/00/25/00259cfb628129c94bf623fd188e68e5.jpg",
    "industry": "Information / Computer / Technology",
    "about": "We are a USA-based blockchain startup technology company. We are a crypto tax product that helps individual cryptocurrency investors and accountants with their tax filings. We have thousands of customers and have processed over $1B of transactions. We are a venture backed, 15-person team, established in 2017. We work with Big 4 accounting firms, large CPA firms, wealthy investors, and everyday traders. We are growing fast and are looking for great team members!"
  },
  {
    "companyName": "Wood Berry Furniture",
    "logo": "https://merojob.com/media/cache/b8/b4/b8b4f3ff791ada7ec7c1ee4043870f69.jpg",
    "industry": "Steel and Furniture",
    "about": "Wood Berry is a furniture production company that produces all types of furniture items for all kinds of housing, restaurants and hotels, offices, etc., \n\nWe are located at Sundarijal and are in the process of expanding our team. \n\nWe seek applications from qualified, enthusiastic, and committed individuals in the following positions."
  },
  {
    "companyName": "WorldLink Communications",
    "logo": "https://merojob.com/media/cache/b4/1b/b41bb9fd52055ca0496f0de8e9b44d8d.jpg",
    "industry": "ISP",
    "about": "WorldLink is the largest Internet and Network Service Provider in Nepal and one of the most prominent IT companies. Founded in September 1995 with the aim of providing Internet and IT services by its present Chairman and Managing Director, Dileep Agrawal. WorldLink started off by providing store-and-forward e-mail services over a dial-up link to the Internet in the US. In March 1997, WorldLink started providing full Internet access over a dedicated leased-line to the Internet backbone in the US through Teleglobe International. From September 1999 till June 2008, WorldLink has been connecting to the Internet over a direct satellite uplink through its own VSAT terminal, thereby completely bypassing Nepal Telecommunications Corporation, the local PTT.\n\nWorldLink serves households, small and medium-sized enterprises (SMEs) and enterprise clients. It is the fastest-growing private ISP in the country and has a presence in 67 districts out of country’s 77 districts. Currently Worldlink has around 300,000 household subscribers spread across the country. The company plans to reach all the local bodies by end of 2023.\n\nSince 2012, WorldLink has rolled out a fibre to the home (FTTH) network, which it intends to expand across Province 3 and 4 towns and rural areas at affordable prices."
  },
  {
    "companyName": "World Vision International Nepal",
    "logo": "https://merojob.com/media/cache/40/a0/40a0400004dbf2b47fb2d1d417f199cb.jpg",
    "industry": "NGO / INGO / Development Projects",
    "about": "\"World Vision is a child focused relief, development and advocacy organization that has contributed to transformation in the lives of millions of children around the world in vulnerable situations. We are driven by Christian values to serve children and families regardless of their religion, age, gender, ethnicity, class and caste. We are looking for potential Nepalese candidates to fill out the following position:\""
  },
  {
    "companyName": "Yale Education Consultancy",
    "logo": "https://merojob.com/media/cache/94/d4/94d44c7eaec37e6e310bbbe157275afa.jpg",
    "industry": "Immigration & Education Consultancy",
    "about": "Yale Education Consultancy (YEC in short) was established in the year 2011 with the mission to provide \"a complete educational solution\" amongst the growing number of students considering overseas education. Located centrally at Hattisar, Kathmandu with ample space, classrooms equipped with high tech study materials, well-experienced councilors and instructors, YEC provides various services with in a close proximity from overall Kathmandu Valley. YEC is registered under the company act of Nepal Government and is strictly bound to Company and Educational Law of Nepal.\n\nYEC was established with the long-term vision of facilitating awareness about the benefits of education in this cross-cultural and naturally beautiful country of Nepal. YEC has its own recognition between the many co-existent educational consultancies operating being always as the first choice among the students aspiring for abroad study programs. YEC conducts various test preparation classes and counseling sessions to comfort students in choosing the best foreign universities.\n\nYEC is keen to carry student's aim to the best education institutions abroad and hasdeveloped programs accordinglyto fully utilize the capacity in themand to expand their horizon forward to international arena. YEC believes in better youth and envisages them as a responsible citizen for the development of country, once they are back with their international degrees.\n\nYEC provides placement for students in plentiful educational institutes at varying locations all over the world. YEC is one among the most qualitative education consultancies providingits services on behalf of the student's desires and destinations. YEC advises suitable career options after analyzing their inherent capabilities and coordinatesbest education policies for them."
  },
  {
    "companyName": "Yum Yum Cafe",
    "logo": "https://merojob.com/media/cache/14/7b/147b46ca5d7cdd64d366abc87af2784f.jpg",
    "industry": "Hotels / Resorts / Restaurant",
    "about": "We are a cafe located in Jhamshikel, Lalitpur."
  }
]